{"content": "Are Gradients The New Colors? Colors are one of the most important and powerful elements in design. Since design is an evolution, our perception of colors (and the ways we use them) is ever-changing. I’ve noticed that there is a new and fresh trend in design that involves a prominent use of gradients in UI, branding, illustration, typography and more. It seems like we got bored of all the existing colors in the world, so we started to create new ways to use them. Gradient in logo and UI (by Gleb Kuznetsov) 👑 A gradient is created by using two or more different colors to paint one element while gradually fading between them. Gradients let designers create something that feels like a new color. A tone which didn’t exist before, something that looks unique, modern and refreshing. Instagram’s new gradient logo Is this going to be the new way we use colors? Are flat colors old-fashioned now? Only time could tell because anything new these days is considered a “trend”. We all know that most of the trends change over the years, and lots of them will become old-fashioned themselves. And then Instagram might change their logo again. 🤔 Why are gradients so trendy? 1. Gradients are memorable Gradients are something we don’t see a lot, our eyes catch them as something new, and being memorable is exactly what you want for your design or brand identity. We remember these unusual visuals much better because we aren’t used to see them yet. We are surrounded by a very limited amount of usual and flat colors, we all know them since we were babies and we recognize them in an instance. Our language to describe colors is limited to a specific perception structure. So if suddenly we see something which we can’t name as “blue” or “purple”, we remember it. We remember it like we remember the first time we traveled to a new place or the first time we tasted something new. Asana’s gradient logo 2. Gradients are unique Let’s be honest, there are not enough different colors in the world in order to let brands create their unique identity. I think there are around 20 common colors we can actually name and recognize, while on the other hand there are hundreds of thousands of brands trying to create their own unique identity. You can’t choose blue because Facebook already did, so you try a different blue and you realize that Twitter took it. Not enough colors for everyone. 🤷 That’s where gradients change the game. Designers can fade multiple different colors and the use of gradients actually adds a lot of more options to the amount of “tones” available. The amount of brands that use a “Blurple” (a gradient between blue and purple) is really small, so that gives brands the opportunity to obtain a unique color identity. 3. Gradients feel realistic I’ve noticed that in the real world, where a circle doesn’t exists but a ball does, we see way more gradients than flat colors. Every lemon has its shady half which is more brown or green. Same in flowers, the sky, different materials, and more. They are all painted with gradients. Maybe it might be more natural and logic for our eyes to see gradients also on our screens. Gradient in UI (by Alper Tornaci) 👑 4. Gradients are just more colorful and playful People love colors. We are attracted to colors by our nature since we were on the hunt for fruits and flowers for too many years. Eventually those natural things were designed by nature itself to be as colorful as possible in order to attract us and other animals. So this is another winning point for gradients, since they basically got the potential to be more colorful, playful and attractive than a flat color. Thanks! These were my thoughts on how gradients can become a way more prominent element in the design world. I would really appreciate if you click the 💛 button to recommend this article and write a comment below to share your thoughts. My name is Gal Shir and I’m a product designer and art director. Stay updated with new stuff I write by joining my private mailing list ✌️ Galgalshir.com ", "child": "7_1\t7_2\t7_3\t7_4\t7_5\t7_6\t7_7\t7_8\t7_9\t7_10\t7_11\t7_12\t7_13\t7_14\t7_15\t7_167_1\t7_2\t7_3\t7_4\t7_5\t7_6\t7_7\t7_8\t7_9\t7_10\t7_11\t7_12\t7_13\t7_14\t7_15\t7_167_1\t7_2\t7_3\t7_4\t7_5\t7_6\t7_7\t7_8\t7_9\t7_10\t7_11\t7_12\t7_13\t7_14\t7_15\t7_16", "title": "Are Gradients The New Colors?", "parent": "", "sentences": [{"9a4e": "Are Gradients The New Colors?"}, {"1192": "Colors are one of the most important and powerful elements in design. Since design is an evolution, our perception of colors (and the ways we use them) is ever-changing."}, {"6a22": "I’ve noticed that there is a new and fresh trend in design that involves a prominent use of gradients in UI, branding, illustration, typography and more. It seems like we got bored of all the existing colors in the world, so we started to create new ways to use them."}, {"c9b9": "Gradient in logo and UI (by Gleb Kuznetsov) 👑"}, {"ea01": "A gradient is created by using two or more different colors to paint one element while gradually fading between them. Gradients let designers create something that feels like a new color. A tone which didn’t exist before, something that looks unique, modern and refreshing."}, {"d96c": "Instagram’s new gradient logo"}, {"f3c6": "Is this going to be the new way we use colors? Are flat colors old-fashioned now? Only time could tell because anything new these days is considered a “trend”. We all know that most of the trends change over the years, and lots of them will become old-fashioned themselves. And then Instagram might change their logo again. 🤔"}, {"3cd9": "Why are gradients so trendy?"}, {"0a01": "1. Gradients are memorable"}, {"9dd4": "Gradients are something we don’t see a lot, our eyes catch them as something new, and being memorable is exactly what you want for your design or brand identity. We remember these unusual visuals much better because we aren’t used to see them yet. We are surrounded by a very limited amount of usual and flat colors, we all know them since we were babies and we recognize them in an instance."}, {"5fe5": "Our language to describe colors is limited to a specific perception structure. So if suddenly we see something which we can’t name as “blue” or “purple”, we remember it. We remember it like we remember the first time we traveled to a new place or the first time we tasted something new."}, {"69f6": "Asana’s gradient logo"}, {"1ad6": "2. Gradients are unique"}, {"33e8": "Let’s be honest, there are not enough different colors in the world in order to let brands create their unique identity. I think there are around 20 common colors we can actually name and recognize, while on the other hand there are hundreds of thousands of brands trying to create their own unique identity. You can’t choose blue because Facebook already did, so you try a different blue and you realize that Twitter took it. Not enough colors for everyone. 🤷"}, {"0f89": "That’s where gradients change the game. Designers can fade multiple different colors and the use of gradients actually adds a lot of more options to the amount of “tones” available. The amount of brands that use a “Blurple” (a gradient between blue and purple) is really small, so that gives brands the opportunity to obtain a unique color identity."}, {"4a57": "3. Gradients feel realistic"}, {"9074": "I’ve noticed that in the real world, where a circle doesn’t exists but a ball does, we see way more gradients than flat colors. Every lemon has its shady half which is more brown or green. Same in flowers, the sky, different materials, and more. They are all painted with gradients. Maybe it might be more natural and logic for our eyes to see gradients also on our screens."}, {"d119": "Gradient in UI (by Alper Tornaci) 👑"}, {"86fb": "4. Gradients are just more colorful and playful"}, {"2bb7": "People love colors. We are attracted to colors by our nature since we were on the hunt for fruits and flowers for too many years. Eventually those natural things were designed by nature itself to be as colorful as possible in order to attract us and other animals. So this is another winning point for gradients, since they basically got the potential to be more colorful, playful and attractive than a flat color."}, {"5fc6": "Thanks!"}, {"1515": "These were my thoughts on how gradients can become a way more prominent element in the design world. I would really appreciate if you click the 💛 button to recommend this article and write a comment below to share your thoughts."}, {"750b": "My name is Gal Shir and I’m a product designer and art director. Stay updated with new stuff I write by joining my private mailing list ✌️"}, {"d0a7": "Galgalshir.com"}], "name": "7"}