{"name": "70", "parent": "", "content": "Tank or Nah? The Knicks are on the edge of mediocrity. Why not tank? Photo: Troy Taormina/USA TODAY Sports (via Fansided) According to conventional wisdom and a very general interpretation the New York Knicks have a very decent starting five for the season. One could go as far as saying that the Knicks even have a bench rotation that could prove to be considerably formidable for the 2016–2017 season. However, in NBA basketball and in most professional sports, conventional wisdom is overrated. And, if the first preseason game of the year was any indication of future success, the Knicks will have very little. After a huge blowout by the Houston Rockets led by James Harden, a lot of fans were left embarrassed and disappointed. It’s too early to tell what the outcome of the season maybe so the former and later predictions are premature analysis that could both very well be wrong. On the other hand, anyone worth their meddle in analytics could anticipate tangible goals this season. A playoff seeding above 4th in the eastern conference sounds like a stretch for the Knicks. So, logically, a 4th through an 8th seed appears to be a realistic achievement to strive for as a target in terms of objectives this NBA season. To a team that hasn’t made the playoffs since 2013, this is a levelheaded aspiration. Unfortunately, the Knicks have never been a levelheaded team with steady, incremental progress. In 1999, after two trades of notable Knickerbockers, the team found a way to make it to the NBA finals. Ultimately, they lost, but any team that performs well enough to make it to the NBA finals is worthy of praise. This Knicks team is not that Knicks team. With a “win-now” mentality in the works, a 4th through the 8th seed is only heeding the second word in the operative “win-now.” The current Knicks roster faces a multitude of challenges, internal and external. The health of the ailing former All-Stars Derrick Rose, Carmelo Anthony, and Joakim Noah could end any playoff hopes quick, fast, and in a hurry. The biggest challenge the team faces outside of the organization falls on the head of one man, the King, LeBron. Even casual fans know that James slays the NBA Championship dreams of Eastern Conference opponents like it gives him sustenance in playoffs. Ask the Chicago Bulls. Ask the Indiana Pacers. Even ask the reigning MVP Steph Curry and the Warriors. Unless the Knicks have a LeBron Stopper in their ranks, there will be no Finals played at Madison Square Garden. This sobering reality begs the question: Should the Knicks just tank? The rare occurrence of the Knicks retaining their first round draft pick has come again. And when the groundhog reveals his shadow don’t you settle for the long con? It would behoove Phil Jackson, the President of the Knicks, to take a break from preaching about the greatness of the Triangle Offense and inspect the Knicks as organization not just from a naive “win-now” perspective, but aim for a “win-long” window. Photo: Stephen R. Sylvanie/USA TODAY Sports (via BleacherReport) The Assets: The Knicks have quietly acquired a plethora of 2nd round picks from a number of teams over the last few years. Great, fantastic. This leaves them with plenty of opportunities for players to develop. With that many draft picks in the second round they might even get lucky enough to find a steal in an overlooked draft prospect eager to prove that he belongs in the NBA. Odds like that are hard to determine at best, but optimism is appreciated, especially when all other things may look bleak. Although a tank would leave these draft picks unaffected, the first round pick, would be the consolation prize for the pain of another embarrassing season. If the Knicks were to play so terribly that a lottery pick was obtained, that player, along with mid-level draftees, have the potential to develop into innumerable incarnations for the future. The Knicks current players, the “win-now” players would merely fade into irrelevance. It seems like most of them are already well on their way. Another young, budding star for the ‘Bockers sounds like a dream come true as Carmelo Anthony struggles to shoulder the load of work in New York. Two lottery picks and a gunning Captain America has a better ring to it than a 4-seed being annihilated by LeBron. If the second rounders prove to be NBA players, a naturally gifted first rounder among them only sweetens the pot, if not, completes it. The future may be bright, but maybe the realities of today should be assessed as well. Possible Obstacles: So far, one fear that keeps rearing its ugly head is the health of the veterans that the Knicks have added to the roster. Noah hasn’t been the same since the 2013–14 season. He hasn’t averaged ten points since, so, his desperately needed double-double days are looking over. Jennings ruptured his Achilles Tendon early in 2015 and, although this stint may be a rally for a comeback, he hasn’t looked like much of his old self unless jacking up bad shots is a fan’s idea of vintage Jennings. This isn’t the end of the Knicks point guard woes since, according to multiple sources, Derrick Rose is made of glass. Additionally, Carmelo’s knee health probably won’t improve during the end of his career. The Knicks are looking like a team consisting of above average players who are the epitome of the saying “good, when healthy”. It’s a surprise Adrian Peterson hasn’t made a guest appearance on the roster yet. This isn’t the end however, because the Knicks recently christened six players into the NBA with a 20+ blowout. The new blood looked pretty lost and uncomfortable on the court. It was only their first game with limited minutes. Any merciful basketball god wouldn’t look twice at it. Still, the ceiling for all of them could be very low. Or, the first preseason game could be a dark foretelling of future misfortune. In short, the Knicks could opt for the win-now plan, fall short due to tripping up on the Cleveland Cavaliers, and pick up decent role players in the second round. Or, they could tank, intentionally or unintentionally, and end up with the Pippen to their Porzingis. Undeniably, the immediate future is scary, but any future past that, no matter the outcome of the 2016–2017 season, may be bright. — Ty Jordan, site writer What do you think? Should the Knicks just flat out tank this season? Let us know on our Facebook and Twitter! ", "title": "Tank or Nah?", "sentences": [{"1622": "Tank or Nah?"}, {"c979": "The Knicks are on the edge of mediocrity. Why not tank?"}, {"5e56": "Photo: Troy Taormina/USA TODAY Sports (via Fansided)"}, {"a1ea": "According to conventional wisdom and a very general interpretation the New York Knicks have a very decent starting five for the season. One could go as far as saying that the Knicks even have a bench rotation that could prove to be considerably formidable for the 2016–2017 season."}, {"a066": "However, in NBA basketball and in most professional sports, conventional wisdom is overrated. And, if the first preseason game of the year was any indication of future success, the Knicks will have very little. After a huge blowout by the Houston Rockets led by James Harden, a lot of fans were left embarrassed and disappointed."}, {"858e": "It’s too early to tell what the outcome of the season maybe so the former and later predictions are premature analysis that could both very well be wrong. On the other hand, anyone worth their meddle in analytics could anticipate tangible goals this season. A playoff seeding above 4th in the eastern conference sounds like a stretch for the Knicks. So, logically, a 4th through an 8th seed appears to be a realistic achievement to strive for as a target in terms of objectives this NBA season."}, {"4941": "To a team that hasn’t made the playoffs since 2013, this is a levelheaded aspiration. Unfortunately, the Knicks have never been a levelheaded team with steady, incremental progress. In 1999, after two trades of notable Knickerbockers, the team found a way to make it to the NBA finals. Ultimately, they lost, but any team that performs well enough to make it to the NBA finals is worthy of praise. This Knicks team is not that Knicks team. With a “win-now” mentality in the works, a 4th through the 8th seed is only heeding the second word in the operative “win-now.”"}, {"83e1": "The current Knicks roster faces a multitude of challenges, internal and external. The health of the ailing former All-Stars Derrick Rose, Carmelo Anthony, and Joakim Noah could end any playoff hopes quick, fast, and in a hurry. The biggest challenge the team faces outside of the organization falls on the head of one man, the King, LeBron. Even casual fans know that James slays the NBA Championship dreams of Eastern Conference opponents like it gives him sustenance in playoffs. Ask the Chicago Bulls. Ask the Indiana Pacers. Even ask the reigning MVP Steph Curry and the Warriors."}, {"3301": "Unless the Knicks have a LeBron Stopper in their ranks, there will be no Finals played at Madison Square Garden. This sobering reality begs the question: Should the Knicks just tank?"}, {"1583": "The rare occurrence of the Knicks retaining their first round draft pick has come again. And when the groundhog reveals his shadow don’t you settle for the long con?"}, {"1818": "It would behoove Phil Jackson, the President of the Knicks, to take a break from preaching about the greatness of the Triangle Offense and inspect the Knicks as organization not just from a naive “win-now” perspective, but aim for a “win-long” window."}, {"b78a": "Photo: Stephen R. Sylvanie/USA TODAY Sports (via BleacherReport)"}, {"60ae": "The Assets:"}, {"7d63": "The Knicks have quietly acquired a plethora of 2nd round picks from a number of teams over the last few years. Great, fantastic. This leaves them with plenty of opportunities for players to develop. With that many draft picks in the second round they might even get lucky enough to find a steal in an overlooked draft prospect eager to prove that he belongs in the NBA. Odds like that are hard to determine at best, but optimism is appreciated, especially when all other things may look bleak."}, {"8a7f": "Although a tank would leave these draft picks unaffected, the first round pick, would be the consolation prize for the pain of another embarrassing season. If the Knicks were to play so terribly that a lottery pick was obtained, that player, along with mid-level draftees, have the potential to develop into innumerable incarnations for the future. The Knicks current players, the “win-now” players would merely fade into irrelevance. It seems like most of them are already well on their way. Another young, budding star for the ‘Bockers sounds like a dream come true as Carmelo Anthony struggles to shoulder the load of work in New York."}, {"f138": "Two lottery picks and a gunning Captain America has a better ring to it than a 4-seed being annihilated by LeBron. If the second rounders prove to be NBA players, a naturally gifted first rounder among them only sweetens the pot, if not, completes it. The future may be bright, but maybe the realities of today should be assessed as well."}, {"d975": "Possible Obstacles:"}, {"3170": "So far, one fear that keeps rearing its ugly head is the health of the veterans that the Knicks have added to the roster. Noah hasn’t been the same since the 2013–14 season. He hasn’t averaged ten points since, so, his desperately needed double-double days are looking over. Jennings ruptured his Achilles Tendon early in 2015 and, although this stint may be a rally for a comeback, he hasn’t looked like much of his old self unless jacking up bad shots is a fan’s idea of vintage Jennings. This isn’t the end of the Knicks point guard woes since, according to multiple sources, Derrick Rose is made of glass. Additionally, Carmelo’s knee health probably won’t improve during the end of his career."}, {"c0ef": "The Knicks are looking like a team consisting of above average players who are the epitome of the saying “good, when healthy”. It’s a surprise Adrian Peterson hasn’t made a guest appearance on the roster yet. This isn’t the end however, because the Knicks recently christened six players into the NBA with a 20+ blowout. The new blood looked pretty lost and uncomfortable on the court. It was only their first game with limited minutes. Any merciful basketball god wouldn’t look twice at it. Still, the ceiling for all of them could be very low. Or, the first preseason game could be a dark foretelling of future misfortune."}, {"8591": "In short, the Knicks could opt for the win-now plan, fall short due to tripping up on the Cleveland Cavaliers, and pick up decent role players in the second round. Or, they could tank, intentionally or unintentionally, and end up with the Pippen to their Porzingis. Undeniably, the immediate future is scary, but any future past that, no matter the outcome of the 2016–2017 season, may be bright."}, {"7d05": "— Ty Jordan, site writer"}, {"90a9": "What do you think? Should the Knicks just flat out tank this season? Let us know on our Facebook and Twitter!"}], "child": "70_170_170_1"}