{"name": "700", "parent": "", "content": "Commoditisation of UI Why unique UI will not make or break your product A lot of designers overestimate the value of unique UI design for the success of a product. The truth is that it’s actually hardly important at all. It doesn’t matter how unique your UI is, competitors will eventually copy it and it will end up commoditised. Commoditisation (early 1990s in business theory) is the process by which goods that have economic value and are distinguishable in terms of attributes (uniqueness or brand) end up becoming simple commodities in the eyes of the market or consumers. It is the movement of a market from differentiated to undifferentiated price competition and from monopolistic to perfect competition. Wikipedia There are many examples of this in the past. Graphic user interface Microsoft Windows is the most popular desktop OS in the world. But Microsoft didn’t come up with the idea of graphic user interface in the first place. They copied it from Apple Macintosh, who in turn stole it from Xerox Alto. Pull-to-refresh Pull-to-refresh is one of the most ubiquitous interaction patterns in mobile design. Every application that has some kind of feed uses the pull-to-refresh gesture. It’s taken as a given these days, but once upon a time it was a signature interaction of Loren Brichter’s Tweetie app. He even patented it! It doesn’t prevent it from being copied by lots of other apps. Camera as an input This might be a bit controversial, but I’d say that camera as an input got commoditised too. Yes, Snapchat was a pioneer here, but the fact that Facebook managed to use it in all their apps from Instagram to Messenger and Whatsapp is completely normal. The fact that someone invented something good or useful, doesn’t mean that others can’t use it too. It’s inevitable that all great inventions will be copied and widely adopted by others. It’s just the way progress happens. What does this mean? First, unique and good design alone does not lead to a successful product. In the post-iPhone world good UI is not a differentiation point, but a cheap commodity, a de-facto standard. In the early days of the new era, there were innovative products that managed to beat incumbents just by having a great design (e.g. Slack had the same core tech as Hipchat, but 10x better design). Good design is a new baseline now (even Android has good design these days). Second, your users don’t care if your design is unique or not. They just want it to work for them. In fact, using existing patterns increases the chances that your product will be simpler to understand and more widely adopted. Third, as the industry matures UIs will converge even more: think about conversational chatbots or voice. Interface there is literally invisible. It means that it’s time to focus more on what can’t be commoditised or easily copied. Unique value your product is creating for people or your design culture, for example. Everything else will follow. It doesn’t mean you don’t need to push the boundaries of what’s possible and try innovative approaches to designing user interface. Just don’t overestimate the value of uniqueness. After all, your design will be available to your competitors tomorrow. Good artists copy, great artists steal, innit. P.S. Tom Cavill pointed out that there’s an exception from this rule—Clear. Clear has such a unique and bold design that it’s impossible to copy (I mean it’s totally possible, but the copy would look like fake pair of Adidas trainers). Although, this is probably an exception that proves the rule. Also there’s a question of how scalable that design would be beyond the very narrow niche of mobile to-do apps. If you liked this, click the💚 below so other people will see this here on Medium. ", "title": "Commoditisation of UI", "sentences": [{"5202": "Commoditisation of UI"}, {"92f4": "Why unique UI will not make or break your product"}, {"3478": "A lot of designers overestimate the value of unique UI design for the success of a product. The truth is that it’s actually hardly important at all."}, {"b30f": "It doesn’t matter how unique your UI is, competitors will eventually copy it and it will end up commoditised."}, {"337c": "Commoditisation (early 1990s in business theory) is the process by which goods that have economic value and are distinguishable in terms of attributes (uniqueness or brand) end up becoming simple commodities in the eyes of the market or consumers. It is the movement of a market from differentiated to undifferentiated price competition and from monopolistic to perfect competition. Wikipedia"}, {"50db": "There are many examples of this in the past."}, {"384f": "Graphic user interface"}, {"0ab8": "Microsoft Windows is the most popular desktop OS in the world. But Microsoft didn’t come up with the idea of graphic user interface in the first place. They copied it from Apple Macintosh, who in turn stole it from Xerox Alto."}, {"16b4": "Pull-to-refresh"}, {"8fae": "Pull-to-refresh is one of the most ubiquitous interaction patterns in mobile design. Every application that has some kind of feed uses the pull-to-refresh gesture. It’s taken as a given these days, but once upon a time it was a signature interaction of Loren Brichter’s Tweetie app. He even patented it! It doesn’t prevent it from being copied by lots of other apps."}, {"8dc2": "Camera as an input"}, {"877c": "This might be a bit controversial, but I’d say that camera as an input got commoditised too. Yes, Snapchat was a pioneer here, but the fact that Facebook managed to use it in all their apps from Instagram to Messenger and Whatsapp is completely normal."}, {"a704": "The fact that someone invented something good or useful, doesn’t mean that others can’t use it too. It’s inevitable that all great inventions will be copied and widely adopted by others. It’s just the way progress happens."}, {"bccf": "What does this mean?"}, {"280c": "First, unique and good design alone does not lead to a successful product. In the post-iPhone world good UI is not a differentiation point, but a cheap commodity, a de-facto standard. In the early days of the new era, there were innovative products that managed to beat incumbents just by having a great design (e.g. Slack had the same core tech as Hipchat, but 10x better design). Good design is a new baseline now (even Android has good design these days)."}, {"883f": "Second, your users don’t care if your design is unique or not. They just want it to work for them. In fact, using existing patterns increases the chances that your product will be simpler to understand and more widely adopted."}, {"5e2d": "Third, as the industry matures UIs will converge even more: think about conversational chatbots or voice. Interface there is literally invisible."}, {"9b71": "It means that it’s time to focus more on what can’t be commoditised or easily copied. Unique value your product is creating for people or your design culture, for example. Everything else will follow."}, {"ab80": "It doesn’t mean you don’t need to push the boundaries of what’s possible and try innovative approaches to designing user interface. Just don’t overestimate the value of uniqueness. After all, your design will be available to your competitors tomorrow."}, {"57bb": "Good artists copy, great artists steal, innit."}, {"712e": "P.S. Tom Cavill pointed out that there’s an exception from this rule—Clear."}, {"27b8": "Clear has such a unique and bold design that it’s impossible to copy (I mean it’s totally possible, but the copy would look like fake pair of Adidas trainers). Although, this is probably an exception that proves the rule. Also there’s a question of how scalable that design would be beyond the very narrow niche of mobile to-do apps."}, {"c40d": "If you liked this, click the💚 below so other people will see this here on Medium."}], "child": "700_1\t700_2\t700_3\t700_4\t700_5\t700_6\t700_7"}