{"name": "704", "parent": "", "content": "Influencing redesign How to convince your company to do a redesign With over 1,500 people working at Dropbox, getting a complete web redesign to happen isn’t easy. Redesigning each and every component is hard enough. But do you know what’s even harder? Convincing everyone in your organization to get on board with the idea. How do you redesign a product built by dozens of teams? How do you convince leaders from multiple teams to commit to a giant project that isn’t on anyone’s roadmap? You might have already read stories about the craft and creative process of holistic redesigns. I want to focus on something a little different: How do you get the organizational support to do a redesign? Empathy — A memorable problem Powerful changes are motivated by powerful reasons. The more powerful the reason, the more irresistible the change. To find our own inspiration, we sifted through user complaints to identify the main areas that people were having trouble with. We then assigned memorable names to the biggest problems: Next, we described these issues by using illustrative examples to paint a clear picture of each problem. For example, when describing the downside of “Tangled accounts,” I would say, “On some pages, your spicy beach photos might show up next to your company presentation.” Most people found that scenario unnerving. It was particularly helpful to linger on the word spicy. We repeated the names and examples of these problems everywhere — in design presentations, in product reviews, in all-hands meetings. By repeating these terms and examples, our organization was able to stay aware of the biggest problems that plagued our product. Linearity — A corresponding solution Once everyone understood the challenge, it was time to rally people around a common vision. So for each one of our problems, we coined a corresponding solution: Naming our solutions in this way provided a clear description of success. This article won’t go into all the iterations we explored, but it’s worth mentioning that setting these goals kept our team focused on the things that mattered — the things that our users cared most about. A slide from our design presentation that defined the problems and corresponding solutions. Belief — A convincing experience It’s one thing to imagine a solution, but nothing beats seeing it in action. To give people a clear picture of how we planned to solve the problems, we created a prototype that felt believable. Koen Bok is most well-known for his mobile prototyping tool Framer. But not a lot of people know that his static site generator Cactus is a near-equal prototyping wonder for the web. By letting you locally serve countless static sites simultaneously, you can test multiple prototypes at once. And because it’s all HTML/CSS/JS, it’s just a hop, skip, and jump from reality. The Cactus Mac App enables you to switch on/off multiple prototypes at once. Deploying the prototype just like any other website enabled us to run it by real users just by forwarding them a link. Twenty prototypes in and many user testing sessions later, we felt confident we had a design that performed a lot better than our existing website did. Proliferation — A widespread message Now that we had a proven prototype in hand, we just needed a way to get the message out — to the whole organization. If you’ve been following Dropbox recently, you might have heard of Dropbox Paper, a tool for documenting ideas and collaborating on those ideas with others. Of course, Dropbox itself runs on Paper, and it’s become the center of our company knowledge. So, we created a Paper doc. We stated the problems and their solutions and linked to our prototype. After a few carefully sent emails and Slack messages, we had people from all over the organization reading the doc and playing with our prototype, including one of our founders. Endurance — A relentless advance I mentioned this earlier, but in an organization our size, it’s tough to push through a redesign of this scale — especially if it isn’t already on the roadmap. Checks and balances are in place to ensure decisions aren’t rushed or isolated. This is for a good reason. At Dropbox, where dozens of teams need to build in lockstep, rapidly launching a redesign without organizational alignment would spell certain disaster. That’s why we had to be persistent and resilient. It would take many months to make our case and align the organization from top to bottom. Resourcing and prioritization would have to be won gradually. There were countless times I thought the project was on its last legs. But we kept rolling with the punches and adapting our approach. When one door closed, we’d find another. When one person said no, we’d find someone who’d say yes. Ultimately, if a redesign really is worthwhile, more and more people will get on board, and this is exactly what we saw happen. Over time, growing support for the redesign made it impossible for the project not to move forward. Before we ever got the green light from leadership, product designers across the org were already designing for the new Dropbox. Product managers were making plans for it. Engineers were asking about it. And an especially exciting moment came when Arash, one of our founders, started to passionately evangelize it in the form of another Paper doc. That was the moment I realized the redesign could become a reality. A month later, we were on the roadmap with a small team of engineers and a mandate from leadership paving the way for us to build. Reflection — A hopeful conclusion A few weeks ago, we started rolling out our redesign to the world. Not only has it simplified navigation, disentangled accounts and unified our web interface, it has also launched a new design system that will help our teams build together more efficiently going forward. Dropbox is a big company. Maybe yours is, too. But if I’ve learned anything from this experience, it’s that even a small set of people can influence big changes with the right approach and right temperament. If you have a rational and compelling solution, I encourage you to keep pushing forward. The process isn’t always easy, but the end result is well worth the effort. Want more from the Dropbox Design team? Follow our publication, Twitter, and Dribbble. Want to make magic together? We’re hiring! ", "title": "Influencing redesign", "sentences": [{"5740": "Influencing redesign"}, {"4d63": "How to convince your company to do a redesign"}, {"e5c9": "With over 1,500 people working at Dropbox, getting a complete web redesign to happen isn’t easy. Redesigning each and every component is hard enough. But do you know what’s even harder? Convincing everyone in your organization to get on board with the idea."}, {"a67e": "How do you redesign a product built by dozens of teams? How do you convince leaders from multiple teams to commit to a giant project that isn’t on anyone’s roadmap? You might have already read stories about the craft and creative process of holistic redesigns. I want to focus on something a little different: How do you get the organizational support to do a redesign?"}, {"d68c": "Empathy — A memorable problem"}, {"2404": "Powerful changes are motivated by powerful reasons. The more powerful the reason, the more irresistible the change."}, {"8057": "To find our own inspiration, we sifted through user complaints to identify the main areas that people were having trouble with. We then assigned memorable names to the biggest problems:"}, {"26ac": "Next, we described these issues by using illustrative examples to paint a clear picture of each problem. For example, when describing the downside of “Tangled accounts,” I would say, “On some pages, your spicy beach photos might show up next to your company presentation.” Most people found that scenario unnerving. It was particularly helpful to linger on the word spicy."}, {"5d69": "We repeated the names and examples of these problems everywhere — in design presentations, in product reviews, in all-hands meetings. By repeating these terms and examples, our organization was able to stay aware of the biggest problems that plagued our product."}, {"d794": "Linearity — A corresponding solution"}, {"99bd": "Once everyone understood the challenge, it was time to rally people around a common vision. So for each one of our problems, we coined a corresponding solution:"}, {"6588": "Naming our solutions in this way provided a clear description of success. This article won’t go into all the iterations we explored, but it’s worth mentioning that setting these goals kept our team focused on the things that mattered — the things that our users cared most about."}, {"94d3": "A slide from our design presentation that defined the problems and corresponding solutions."}, {"2191": "Belief — A convincing experience"}, {"c23c": "It’s one thing to imagine a solution, but nothing beats seeing it in action. To give people a clear picture of how we planned to solve the problems, we created a prototype that felt believable."}, {"d714": "Koen Bok is most well-known for his mobile prototyping tool Framer. But not a lot of people know that his static site generator Cactus is a near-equal prototyping wonder for the web. By letting you locally serve countless static sites simultaneously, you can test multiple prototypes at once. And because it’s all HTML/CSS/JS, it’s just a hop, skip, and jump from reality."}, {"442c": "The Cactus Mac App enables you to switch on/off multiple prototypes at once."}, {"59fe": "Deploying the prototype just like any other website enabled us to run it by real users just by forwarding them a link. Twenty prototypes in and many user testing sessions later, we felt confident we had a design that performed a lot better than our existing website did."}, {"53e5": "Proliferation — A widespread message"}, {"758b": "Now that we had a proven prototype in hand, we just needed a way to get the message out — to the whole organization."}, {"a6b5": "If you’ve been following Dropbox recently, you might have heard of Dropbox Paper, a tool for documenting ideas and collaborating on those ideas with others. Of course, Dropbox itself runs on Paper, and it’s become the center of our company knowledge."}, {"9739": "So, we created a Paper doc. We stated the problems and their solutions and linked to our prototype. After a few carefully sent emails and Slack messages, we had people from all over the organization reading the doc and playing with our prototype, including one of our founders."}, {"589a": "Endurance — A relentless advance"}, {"1d66": "I mentioned this earlier, but in an organization our size, it’s tough to push through a redesign of this scale — especially if it isn’t already on the roadmap. Checks and balances are in place to ensure decisions aren’t rushed or isolated. This is for a good reason."}, {"ab6b": "At Dropbox, where dozens of teams need to build in lockstep, rapidly launching a redesign without organizational alignment would spell certain disaster. That’s why we had to be persistent and resilient. It would take many months to make our case and align the organization from top to bottom. Resourcing and prioritization would have to be won gradually."}, {"223e": "There were countless times I thought the project was on its last legs. But we kept rolling with the punches and adapting our approach. When one door closed, we’d find another. When one person said no, we’d find someone who’d say yes. Ultimately, if a redesign really is worthwhile, more and more people will get on board, and this is exactly what we saw happen. Over time, growing support for the redesign made it impossible for the project not to move forward."}, {"e352": "Before we ever got the green light from leadership, product designers across the org were already designing for the new Dropbox. Product managers were making plans for it. Engineers were asking about it. And an especially exciting moment came when Arash, one of our founders, started to passionately evangelize it in the form of another Paper doc. That was the moment I realized the redesign could become a reality."}, {"bf71": "A month later, we were on the roadmap with a small team of engineers and a mandate from leadership paving the way for us to build."}, {"0331": "Reflection — A hopeful conclusion"}, {"9966": "A few weeks ago, we started rolling out our redesign to the world. Not only has it simplified navigation, disentangled accounts and unified our web interface, it has also launched a new design system that will help our teams build together more efficiently going forward."}, {"e128": "Dropbox is a big company. Maybe yours is, too. But if I’ve learned anything from this experience, it’s that even a small set of people can influence big changes with the right approach and right temperament. If you have a rational and compelling solution, I encourage you to keep pushing forward. The process isn’t always easy, but the end result is well worth the effort."}, {"90ab": "Want more from the Dropbox Design team? Follow our publication, Twitter, and Dribbble. Want to make magic together? We’re hiring!"}], "child": "704_1\t704_2\t704_3\t704_4\t704_5\t704_6\t704_7\t704_8\t704_9\t704_10\t704_11\t704_12\t704_13\t704_14\t704_15\t704_16\t704_17\t704_18\t704_19\t704_20\t704_21704_1\t704_2\t704_3\t704_4\t704_5\t704_6\t704_7\t704_8\t704_9\t704_10\t704_11\t704_12\t704_13\t704_14\t704_15\t704_16\t704_17\t704_18\t704_19\t704_20\t704_21"}