{"name": "708", "parent": "", "content": "Decision-Making Biases: Why Terrible Designs Seem Like a Good Idea at the Time Everyone has biases. We all like to think that we are level-headed, rational people, but our brains are actually hard-wired to jump to conclusions. As designers, our biases seep into our work and cause us to create concepts that seem like a great idea at the time… until we expose them to the light. Simply recognizing our own biases is an important first step in addressing the effects they might have on our design work. We may never be able to rid ourselves of bias, but by keeping an eye out for it, we can become better designers and better business people. Action-Oriented Bias Humans are optimistic beings. We tend to believe that the things we do will work out for us, and therefore we have a bias toward action. This means that we sometimes make changes that don’t need to be made and create complications where none are needed. Because of our action-oriented bias: What this means for designers: Self-Interest Bias Also known as the “status-quo bias,” self-interest bias is when we have a tendency to like and expect things to stay the same. Deep down, we prefer the world to match our perception of how we think things work. Because of our self-interest bias: What this means for designers: Pattern-Recognition Bias As humans, we love patterns. Patterns are comfortable. They make us feel like there is sense and order in the world. As a result, we have a tendency to imagine patterns where none actually exist. Because of our pattern-recognition bias: What this means for designers: Social Harmony Bias Humans hate conflict in their own lives. Our tendency is to stick with the herd, go with the flow, and generally stay out of other people’s way. We’d love it if we could rise to the top of the pack, but very few of us are willing to ruffle feathers in order to get there. Because of our social harmony bias: What this means for designers: Stability Bias Most of us work nine-to-five jobs, because we are uncomfortable with the prospect of working for ourselves and not knowing where our next paycheck is coming from. While this isn’t always the case for designers, we still favor stability in many ways. It’s why we always order the same things at our go-to restaurants and stay in the town where we grew up. Because of our stability bias: What this means for designers: As designers, we can never be complacent about our designs, our work processes, or even our worldviews. If you’ve recognized other types of bias that affect your design work, please share them in the comments. Suggestions for how to combat natural biases are also welcome. Originally published at www.toptal.com. ", "title": "Decision-Making Biases: Why Terrible Designs Seem Like a Good Idea at the Time", "sentences": [{"1447": "Decision-Making Biases: Why Terrible Designs Seem Like a Good Idea at the Time"}, {"bb12": "Everyone has biases. We all like to think that we are level-headed, rational people, but our brains are actually hard-wired to jump to conclusions."}, {"c1d7": "As designers, our biases seep into our work and cause us to create concepts that seem like a great idea at the time… until we expose them to the light."}, {"068f": "Simply recognizing our own biases is an important first step in addressing the effects they might have on our design work. We may never be able to rid ourselves of bias, but by keeping an eye out for it, we can become better designers and better business people."}, {"a471": "Action-Oriented Bias"}, {"0292": "Humans are optimistic beings."}, {"0f28": "We tend to believe that the things we do will work out for us, and therefore we have a bias toward action. This means that we sometimes make changes that don’t need to be made and create complications where none are needed."}, {"f32b": "Because of our action-oriented bias:"}, {"32d2": "What this means for designers:"}, {"a334": "Self-Interest Bias"}, {"83b7": "Also known as the “status-quo bias,” self-interest bias is when we have a tendency to like and expect things to stay the same. Deep down, we prefer the world to match our perception of how we think things work."}, {"fc6c": "Because of our self-interest bias:"}, {"71d0": "What this means for designers:"}, {"d8cb": "Pattern-Recognition Bias"}, {"5041": "As humans, we love patterns. Patterns are comfortable. They make us feel like there is sense and order in the world. As a result, we have a tendency to imagine patterns where none actually exist."}, {"74d6": "Because of our pattern-recognition bias:"}, {"8c0d": "What this means for designers:"}, {"c27e": "Social Harmony Bias"}, {"f895": "Humans hate conflict in their own lives."}, {"195d": "Our tendency is to stick with the herd, go with the flow, and generally stay out of other people’s way. We’d love it if we could rise to the top of the pack, but very few of us are willing to ruffle feathers in order to get there."}, {"7066": "Because of our social harmony bias:"}, {"11f5": "What this means for designers:"}, {"c706": "Stability Bias"}, {"a544": "Most of us work nine-to-five jobs, because we are uncomfortable with the prospect of working for ourselves and not knowing where our next paycheck is coming from."}, {"aab4": "While this isn’t always the case for designers, we still favor stability in many ways. It’s why we always order the same things at our go-to restaurants and stay in the town where we grew up."}, {"2110": "Because of our stability bias:"}, {"a7bf": "What this means for designers:"}, {"3604": "As designers, we can never be complacent about our designs, our work processes, or even our worldviews."}, {"0aaf": "If you’ve recognized other types of bias that affect your design work, please share them in the comments. Suggestions for how to combat natural biases are also welcome."}, {"7205": "Originally published at www.toptal.com."}], "child": "708_1\t708_2\t708_3\t708_4\t708_5708_1\t708_2\t708_3\t708_4\t708_5"}