{"name": "711", "parent": "", "content": "A More Human Interface Through AI Use machine learning to better adapt UI to the individual user Users are individuals. Their goals and behavior are unique. In the name of user centricity, designers bucket people into groups based on their similar goals and behaviors. This grouping focuses the outcome of the interface, but is contradictory. To be truly user centered, designers should treat each user as an individual human-being. Adapt user interface with machine learning What if designers used artificial intelligence to augment their decisions? The old methods of user experience will continue to be invaluable to the product design process and will direct the major design decisions. Machine learning will take it one step further by constantly calibrating design based on user activity. AI will recognize usage patterns and create subtle changes to the UI. These small changes will have a compound effect over time, designing the ideal interface to accommodate a persons needs and abilities. What could go wrong? The moral dilemma of AI influenced UI As Eli Pariser points out in his book The Filter Bubble, personalizing content based on a users previous interactions further isolates them in their preconceived reality. Allowing an algorithm to manipulate a user interface to better fit an individual’s usage patterns is far different from allowing an algorithm to manipulate the content people view. However, as every media critic likes to point out, the medium is the message. This phrase was coined by Marshall McLuhan, who believed that the medium content is distributed through influences how it is perceived, thereby changing the meaning of the message. Does the user interface design change a user’s actions, thereby changing the content the action produces? Undoubtedly so. Could AI adapt UI toward perilous ends? Perhaps. Despite the risks, I think designers should embrace artificial intelligence to augment their decisions. Picture a world in which UI is forever calibrating to user activity, until the interface and human are interwoven together. Building a better UI foundation Each major operating system goes through endless refreshes and redesigns in an attempt to keep up with changing paradigms. This constant evolution is a good thing, and one in-which machine learning should accelerate. In order to work successfully with artificial intelligence, a universal foundation should be laid. This foundation already exists, but the language is scattered. OhApollo is an attempt at categorizing, dissecting, and defining the archetypal core of user interface components and patterns. The hope is that in the future this base can be used with AI to grow into a more human interface. Find me on Twitter. ", "title": "A More Human Interface Through AI", "sentences": [{"243a": "A More Human Interface Through AI"}, {"d0dc": "Use machine learning to better adapt UI to the individual user"}, {"8053": "Users are individuals. Their goals and behavior are unique. In the name of user centricity, designers bucket people into groups based on their similar goals and behaviors. This grouping focuses the outcome of the interface, but is contradictory. To be truly user centered, designers should treat each user as an individual human-being."}, {"815d": "Adapt user interface with machine learning"}, {"3143": "What if designers used artificial intelligence to augment their decisions?"}, {"7f64": "The old methods of user experience will continue to be invaluable to the product design process and will direct the major design decisions. Machine learning will take it one step further by constantly calibrating design based on user activity."}, {"62e8": "AI will recognize usage patterns and create subtle changes to the UI. These small changes will have a compound effect over time, designing the ideal interface to accommodate a persons needs and abilities."}, {"ae36": "What could go wrong?"}, {"0866": "The moral dilemma of AI influenced UI"}, {"5459": "As Eli Pariser points out in his book The Filter Bubble, personalizing content based on a users previous interactions further isolates them in their preconceived reality."}, {"2c68": "Allowing an algorithm to manipulate a user interface to better fit an individual’s usage patterns is far different from allowing an algorithm to manipulate the content people view."}, {"a282": "However, as every media critic likes to point out, the medium is the message. This phrase was coined by Marshall McLuhan, who believed that the medium content is distributed through influences how it is perceived, thereby changing the meaning of the message. Does the user interface design change a user’s actions, thereby changing the content the action produces? Undoubtedly so. Could AI adapt UI toward perilous ends? Perhaps."}, {"2e6a": "Despite the risks, I think designers should embrace artificial intelligence to augment their decisions. Picture a world in which UI is forever calibrating to user activity, until the interface and human are interwoven together."}, {"b367": "Building a better UI foundation"}, {"1718": "Each major operating system goes through endless refreshes and redesigns in an attempt to keep up with changing paradigms. This constant evolution is a good thing, and one in-which machine learning should accelerate."}, {"2aa6": "In order to work successfully with artificial intelligence, a universal foundation should be laid. This foundation already exists, but the language is scattered."}, {"ed5d": "OhApollo is an attempt at categorizing, dissecting, and defining the archetypal core of user interface components and patterns. The hope is that in the future this base can be used with AI to grow into a more human interface."}, {"f1e1": "Find me on Twitter."}], "child": "711_1\t711_2\t711_3"}