{"name": "713", "parent": "", "content": "10 Steps for better Onboarding Experience Onboarding is one of the most crucial elements of every app. Very often, it will determine whether a user will continue using an app or not because of how simple it is to use. Onboarding is way more than just 5 intro screens and explanatory tooltips on a user interface. I’ve described my onboarding process below using the most interesting examples. 1. Focus on User Goals Let’s start with a simple question: What is our user’s main goal? Why are they using our app? For example: Whatsapp’s purpose is to connect the users with their friends. To achieve our goal we usually have to complete some additional, unrelated tasks that only distant us from desired goals. These steps should be limited to minimum. 2. Create customer journey The next step is to create a path the user has to take to achieve his goal. Focus on key moments like “Opening the App for the first time”, “Creating a profile” or “Choosing your first contact”. The last step is the most important — it’s the moment when the user achieves his goal. Airbnb created Journey map to show user process Flight Experience by LEGO Cellphone purchasing experience by Jessica Tien To learn some more about customer journey check Megan’s extensive article 3. Cut out useless s**t For each step reduce user input to a minimum and explain in detail why you need information that is absolutely necessary. Everything else should be available to update later. In this step focus solely on the goal; achieving it makes the user return to your app. The goal isn’t adding an avatar to your profile, filling in your location or creating a profile. Appear.in lets you jump right into the video call without any obstacles like having to sign up or choosing a name 4. Introduce features one by one Most of the time, users focus on one feature. But what if we want to explain more than a single feature? Let’s take a closer look at the Medium app. We have the main feature — reading articles. On the other hand, Medium lets us create articles. We don’t want to explain how to write articles for users only interested in consuming content. In this case we should create an app porch — a place where we define who we are dealing with, and give the proper instructions. Medium Introduces writing features only if you try to write an article. Youtube introduces Live Streaming feature only in dedicated tab 5. Do it interactively Way too often I see onboardings completely detached from the app itself. Static text is the least engaging way to introduce features and explain the rules of our app. Instead, try to make use of the app’s mechanics. It’s a great way to utilize already designed interface solutions. Slack uses its bot feature to introduce app features and fill in personal information. Trello uses cards to introduce features in a simple way 6. Explain why you need it No one likes to waste time filling out long forms and reading onboarding instructions. Unfortunately, in some cases it’s inevitable. To ease the pain, let the user know which exact information is mandatory to fill in. A good explanation will decrease the number of users closing the app. GetResponse clearly shows what the inputted text is used for. Clear information why birthday information is important by Apple 7. Let them play Don’t force anything. Some users like to explore on their own. Be sure you always have a “skip” button visible. It allows exploratory users to have fun. It also helps returning users, who already know your app. 8.Tailor onboarding to different user goals This step is well known to game designers. Some features are dedicated to advanced users and should be promoted only to them (it doesn’t mean they shouldn’t be available to everyone). As a result, your user will have a less steep, longer learning curve and won’t be overwhelmed by options. Evernote recognizes user goal by simply asking user 9. Make use of your blank screens If your app starts with a blank slate, try to use it in a way to help your user understand your tool. A good idea is to suggest popular user content or create sample data. 10. Talk to your user 1 on 1 Last, but not least! Talk to your user! Talk often. There’s no better source of information than 1 on 1 interviews. You’ll be amazed by how they use your app and how different their problems are with navigating around your app. Wrapping it up Onboarding is difficult and fragile matter. Take your time and try the process described in my article. Be sure to involve users. Number of discovered issues might be hard to tackle, but keep on fighting for better experience! Fixing problems iteratively is inevitable element of every design process. With each session you’ll observe improvement, it’s the greatest motivation. Good luck! Follow GogoApps at Dribbble. Visit our GogoApps Website. ", "title": "10 Steps for better Onboarding Experience", "sentences": [{"5ac0": "10 Steps for better Onboarding Experience"}, {"275c": "Onboarding is one of the most crucial elements of every app. Very often, it will determine whether a user will continue using an app or not because of how simple it is to use. Onboarding is way more than just 5 intro screens and explanatory tooltips on a user interface. I’ve described my onboarding process below using the most interesting examples."}, {"0b7f": "1. Focus on User Goals"}, {"a6cd": "Let’s start with a simple question: What is our user’s main goal? Why are they using our app? For example: Whatsapp’s purpose is to connect the users with their friends. To achieve our goal we usually have to complete some additional, unrelated tasks that only distant us from desired goals. These steps should be limited to minimum."}, {"8452": "2. Create customer journey"}, {"8f4b": "The next step is to create a path the user has to take to achieve his goal. Focus on key moments like “Opening the App for the first time”, “Creating a profile” or “Choosing your first contact”. The last step is the most important — it’s the moment when the user achieves his goal."}, {"d98e": "Airbnb created Journey map to show user process"}, {"7729": "Flight Experience by LEGO"}, {"f999": "Cellphone purchasing experience by Jessica Tien"}, {"03e8": "To learn some more about customer journey check Megan’s extensive article"}, {"d08b": "3. Cut out useless s**t"}, {"0c0b": "For each step reduce user input to a minimum and explain in detail why you need information that is absolutely necessary. Everything else should be available to update later. In this step focus solely on the goal; achieving it makes the user return to your app. The goal isn’t adding an avatar to your profile, filling in your location or creating a profile."}, {"d54f": "Appear.in lets you jump right into the video call without any obstacles like having to sign up or choosing a name"}, {"e1f5": "4. Introduce features one by one"}, {"2ace": "Most of the time, users focus on one feature. But what if we want to explain more than a single feature? Let’s take a closer look at the Medium app. We have the main feature — reading articles. On the other hand, Medium lets us create articles. We don’t want to explain how to write articles for users only interested in consuming content. In this case we should create an app porch — a place where we define who we are dealing with, and give the proper instructions."}, {"4df3": "Medium Introduces writing features only if you try to write an article."}, {"082f": "Youtube introduces Live Streaming feature only in dedicated tab"}, {"f6f3": "5. Do it interactively"}, {"cae2": "Way too often I see onboardings completely detached from the app itself. Static text is the least engaging way to introduce features and explain the rules of our app. Instead, try to make use of the app’s mechanics. It’s a great way to utilize already designed interface solutions."}, {"3736": "Slack uses its bot feature to introduce app features and fill in personal information."}, {"8895": "Trello uses cards to introduce features in a simple way"}, {"9758": "6. Explain why you need it"}, {"c051": "No one likes to waste time filling out long forms and reading onboarding instructions. Unfortunately, in some cases it’s inevitable. To ease the pain, let the user know which exact information is mandatory to fill in. A good explanation will decrease the number of users closing the app."}, {"b13f": "GetResponse clearly shows what the inputted text is used for."}, {"117c": "Clear information why birthday information is important by Apple"}, {"73c2": "7. Let them play"}, {"96c9": "Don’t force anything. Some users like to explore on their own. Be sure you always have a “skip” button visible. It allows exploratory users to have fun. It also helps returning users, who already know your app."}, {"46f3": "8.Tailor onboarding to different user goals"}, {"5059": "This step is well known to game designers. Some features are dedicated to advanced users and should be promoted only to them (it doesn’t mean they shouldn’t be available to everyone). As a result, your user will have a less steep, longer learning curve and won’t be overwhelmed by options."}, {"e553": "Evernote recognizes user goal by simply asking user"}, {"ae5f": "9. Make use of your blank screens"}, {"ca19": "If your app starts with a blank slate, try to use it in a way to help your user understand your tool. A good idea is to suggest popular user content or create sample data."}, {"db75": "10. Talk to your user 1 on 1"}, {"f5cf": "Last, but not least! Talk to your user! Talk often. There’s no better source of information than 1 on 1 interviews. You’ll be amazed by how they use your app and how different their problems are with navigating around your app."}, {"742e": "Wrapping it up"}, {"a341": "Onboarding is difficult and fragile matter. Take your time and try the process described in my article. Be sure to involve users. Number of discovered issues might be hard to tackle, but keep on fighting for better experience! Fixing problems iteratively is inevitable element of every design process. With each session you’ll observe improvement, it’s the greatest motivation."}, {"75ca": "Good luck!"}, {"7a29": "Follow GogoApps at Dribbble. Visit our GogoApps Website."}], "child": "713_1\t713_2\t713_3\t713_4\t713_5\t713_6713_1\t713_2\t713_3\t713_4\t713_5\t713_6713_1\t713_2\t713_3\t713_4\t713_5\t713_6713_1\t713_2\t713_3\t713_4\t713_5\t713_6713_1\t713_2\t713_3\t713_4\t713_5\t713_6713_1\t713_2\t713_3\t713_4\t713_5\t713_6713_1\t713_2\t713_3\t713_4\t713_5\t713_6713_1\t713_2\t713_3\t713_4\t713_5\t713_6713_1\t713_2\t713_3\t713_4\t713_5\t713_6713_1\t713_2\t713_3\t713_4\t713_5\t713_6"}