{"name": "714", "parent": "", "content": "Caveats of Motion in Design I’ve been advocating motion in UX design for some time now. In fact, I even wrote poems about it: “If the motion curve isn’t right, the animation won’t delight.” Lately, motion has become so important that you’re not considered “cool” anymore if you don’t do it. So we go out there, fine-tune our curves, apply the 12 Walt Disney animation principles and high five each other on our beautiful gifs on dribbble. “Well done!” … while the engineer happily implements our little masterpiece. 👋 Make no mistake, I think there are many good reasons why motion has become so ubiquitous and I’m super excited about seeing it become more and more ingrained in the design process. And yet, this whole movement also made me take a step back and think about the more holistic role of motion again. The reason why I believe motion is so crucial isn’t just because it looks nice, but because it changes the way we approach design. Rather than thinking in screens, we are now thinking in stories. Stories explaining how those screens and the elements in them relate to one another. It’s this simple thought, this simple idea really, that already elevates the quality of our interfaces considerably. But while motion is all about timing, we rarely consider at which point we should actually start incorporating it into our processes. Here are some of the reasons why I believe it’s important. 1. Motion can lie to you Thinking about motion early on is crucial. But building high fidelity motion assets too early can actually have the opposite effect. The reason motion is both so powerful and dangerous is because it absorbs focus. We can’t help ourselves to look at things that move. So naturally, when we look at prototypes, we spend a lot of mental energy focusing on how things move, rather than what’s actually on the screen. This can quickly result in what I respectfully call beautiful bullshit: products that look nice, but which actually do a poor job in solving the problem at hand. I have observed countless times how various stakeholders got immediately swayed by a mediocre idea, simply because it was nicely animated. Animating at the right time is just as important as the timing of the animation itself. 2. The animation you spend most time looking at, is your own animation You love your animation don’t you? I feel you. I replay my animations all the time. It’s part of the process. Once you’re happy with it, you’ll probably play it a few more times. That’s okay. Everyone does. But let’s keep in mind that we are not our users. As soon as users feel like motion is slowing them down, there is probably something wrong with it. In order to use animation in a more meaningful way, we have to consider the frequency in which users get see it. The more often you expose users to an animation, the less obtrusive it should probably be. It’s all about time and pace. 3. The law of diminishing confetti Appreciation of animation diminishes over time. But it doesn’t have to. When I designed the UX Bear, I spent a lot of time fine-tuning the transitions and pace of the interface. Any yet, something was always missing… I needed confetti in there! Oliver Reichenstein on icons — uxchat.me It took me quite some time to figure out how to implement it. Once I was done, I was very tempted by the idea of adding the effect to many more conversations. But then I remembered the old principle of motion: the more often you show the same animation, the less delightful it becomes. It’s obviously very tempting to show the beautiful animation you meticulously crafted as many times as possible. Unfortunately, that only results in compromising the appreciation you worked for so hard . Restraint is a critical characteristic only a few motion designers practice. Making sure motion is invisible most of the time, and very visible at specific points in time is key. We’ve come a long way in motion in user interfaces. It has become part of modern design culture. But let’s not forget why we signed up for it in the first place, and how we can use it in a more sustainable way. Thanks for reading, if you like this post, please recommend. 🙌 You can follow me on Twitter. ", "title": "Caveats of Motion in Design", "sentences": [{"b997": "Caveats of Motion in Design"}, {"584f": "I’ve been advocating motion in UX design for some time now. In fact, I even wrote poems about it:"}, {"dfb8": "“If the motion curve isn’t right, the animation won’t delight.”"}, {"625c": "Lately, motion has become so important that you’re not considered “cool” anymore if you don’t do it."}, {"6ab2": "So we go out there, fine-tune our curves, apply the 12 Walt Disney animation principles and high five each other on our beautiful gifs on dribbble."}, {"3b52": "“Well done!”"}, {"3e9d": "… while the engineer happily implements our little masterpiece. 👋"}, {"2bc6": "Make no mistake, I think there are many good reasons why motion has become so ubiquitous and I’m super excited about seeing it become more and more ingrained in the design process."}, {"057b": "And yet, this whole movement also made me take a step back and think about the more holistic role of motion again."}, {"26ab": "The reason why I believe motion is so crucial isn’t just because it looks nice, but because it changes the way we approach design."}, {"d819": "Rather than thinking in screens, we are now thinking in stories. Stories explaining how those screens and the elements in them relate to one another. It’s this simple thought, this simple idea really, that already elevates the quality of our interfaces considerably."}, {"6f89": "But while motion is all about timing, we rarely consider at which point we should actually start incorporating it into our processes."}, {"64bc": "Here are some of the reasons why I believe it’s important."}, {"d25c": "1. Motion can lie to you"}, {"e5ab": "Thinking about motion early on is crucial. But building high fidelity motion assets too early can actually have the opposite effect."}, {"2f53": "The reason motion is both so powerful and dangerous is because it absorbs focus."}, {"0a55": "We can’t help ourselves to look at things that move. So naturally, when we look at prototypes, we spend a lot of mental energy focusing on how things move, rather than what’s actually on the screen."}, {"0c6a": "This can quickly result in what I respectfully call beautiful bullshit: products that look nice, but which actually do a poor job in solving the problem at hand."}, {"b8b4": "I have observed countless times how various stakeholders got immediately swayed by a mediocre idea, simply because it was nicely animated."}, {"48b9": "Animating at the right time is just as important as the timing of the animation itself."}, {"89df": "2. The animation you spend most time looking at, is your own animation"}, {"8dc4": "You love your animation don’t you? I feel you. I replay my animations all the time. It’s part of the process. Once you’re happy with it, you’ll probably play it a few more times. That’s okay. Everyone does."}, {"5897": "But let’s keep in mind that we are not our users. As soon as users feel like motion is slowing them down, there is probably something wrong with it."}, {"790d": "In order to use animation in a more meaningful way, we have to consider the frequency in which users get see it."}, {"879f": "The more often you expose users to an animation, the less obtrusive it should probably be. It’s all about time and pace."}, {"96a6": "3. The law of diminishing confetti"}, {"f606": "Appreciation of animation diminishes over time. But it doesn’t have to."}, {"fa1f": "When I designed the UX Bear, I spent a lot of time fine-tuning the transitions and pace of the interface. Any yet, something was always missing… I needed confetti in there!"}, {"7b49": "Oliver Reichenstein on icons — uxchat.me"}, {"5d89": "It took me quite some time to figure out how to implement it. Once I was done, I was very tempted by the idea of adding the effect to many more conversations."}, {"412a": "But then I remembered the old principle of motion: the more often you show the same animation, the less delightful it becomes."}, {"92ff": "It’s obviously very tempting to show the beautiful animation you meticulously crafted as many times as possible. Unfortunately, that only results in compromising the appreciation you worked for so hard ."}, {"85a3": "Restraint is a critical characteristic only a few motion designers practice. Making sure motion is invisible most of the time, and very visible at specific points in time is key."}, {"c28c": "We’ve come a long way in motion in user interfaces. It has become part of modern design culture. But let’s not forget why we signed up for it in the first place, and how we can use it in a more sustainable way."}, {"e9ad": "Thanks for reading, if you like this post, please recommend. 🙌 You can follow me on Twitter."}], "child": "714_1\t714_2\t714_3714_1\t714_2\t714_3714_1\t714_2\t714_3"}