{"name": "718", "parent": "", "content": "Linear UX How to build a truly intuitive experience every time At its most simple, Linear UX is a set of methods for creating user-centred, goal-oriented experiences. The core principle revolves around creating a guided experience that allows users to achieve a goal or solve a problem by walking through a path in a frictionless journey. This way of thinking is used widely in game design: Create an environment, provide a path to a goal, and leave clues for the character/user to help walk them through a sequence of tasks on the way toward achieving that ultimate goal. This approach is not unique to digital or interactive experiences only. Most of these principles can also be used in offline environments. If you study the history of art in Gothic and Renaissance eras, you can see how this type of guided experience was implemented in paintings mainly by Da Vinci and Rembrandt; There’s always an entry point for the eye, a storyline, and an invisible path that takes you through the entire painting. Virgin of the rocks — Da Vinci Backstory “Linear UX” and its principles are something I have been drawing up for sometime now, with a goal to formulate methods universally applicable to product design. I have refined the approach over time to five core principles that can be used as a cheat sheet to create user-centered experiences. I originally referred to this approach as “linear” because the approach, at its core, is sequential. It progresses from one stage to another in a single series of steps. Linear UX is naturally progressive and fits in perfectly in an Agile product development environment. It shines brightest when creating an MVP or the very first iteration of a product. I find it very useful, not just to evaluate ideas, but also to streamline the decision-making process. Another key benefit of Linear UX is its minimalistic approach to UX design, which removes a lot of unnecessary complications from the user experience. This allows for a better understanding of user behaviours, better measurement of user journeys, and more precise identification of critical touch-points. Objective driven experience The core of Linear UX is about providing a way for users to complete a desired task and achieve a goal in a quick, easy, and friction free environment. Like any great experience, users are at the centre of this approach and helping them reach their goals should be the main objective of your product. The ability to clearly define the main objectives is key in creating intuitive experiences. One technique I often use to design a goal-driven experience is to reverse engineer the tasks needed to accomplish a goal. I start by considering the task done, then go backwards and identify all the steps in between. This way you can see the entire journey from a bird’s eye view. This helps to re-evaluate the steps and take actions to remove/exchange them to make the journey shorter. Once all the steps are defined, then I start finding ways to stitch different steps together and begin to build a consistent and clear path for users to walk through. Remove as many steps as possible. Identify key actions and stitch steps together to create a clear user story. Your goal should be to allow users complete the task in the fewest steps. When using the Linear approach, you think of your product as an enabler to take your users from Point A to point B. So it’s essential to know what the Point A and Point B are beforehand. It’s a problem-first approach Many designers fall in love with a solution before completely comprehending the problem. In the Linear UX approach, being able to state the problem clearly is everything. The better you can connect the the dots between the problem and a human condition or a basic need, the closer you are to identifying the core of the problem you are trying to solve. Something I often tell less experienced designers: You should spend more time identifying the problem and trying to get to the core of it than trying to come up with solutions. Most of the time the real problem is completely different than what is stated. The problem-first approach helps prevent getting too attached to a solution too early. This way, you are putting yourself in a position where you can change approaches to achieve your goal. Charles Kettering said it best: “A problem well stated is a problem half solved.” “Get obsessed with the problem not the solution.” Light to Heavy, Easy to Hard In Linear UX the experience is designed layer by layer. And more often than not, step by step. Every layer or step starts with a simple, lightweight task and it gets more complex as the journey progresses. For example to get users to grant you access to their photo library you’d explain why you need that permission before throwing an action card/screen for them to act on. “If you need users to perform a complex or doubtable task put an easy task or step right before it. This will ease users to complete the task with a better mindset.” Fewer options, Fewer actions This is may be a bit more controversial than other principles in Linear UX (since there are different schools of thought on this subject matter), but a lot of people think your value to a user/customer is directly tied to the number of options or features you can provide. That’s not the case. Study after study have shown that people provided with fewer options are happier with their decisions when compared to those who had more options to choose from. This phenomena is so well documented, in fact, the TED Blog dedicated a roundup to the subject of happiness and choice. In the Linear UX approach, we remove as many options and actions as possible from the experience and stick with the core actions that are critical to solving the problem. For less critical decisions, you can simplify the process by making the decisions on behalf of the user, automating the process as much as you can. This approach brings a lot of simplicity to the experience you are designing, and makes the journey more consistent throughout. You have probably heard some version of this before: “Make that button bigger so we will get more clicks on it.” I disagree with that advice. I say remove all the other buttons and only have one action on the screen. See how it increases your clicks, no matter where it is or what size it is. In short: Keep the number of actions and options to a minimum and keep to the essentials. Make those small decisions on behalf of the user and smooth out the journey. Don’t force your users to work hard just to use your product. “Don’t make me think.” — Steve Krug Moment of Delight The Moment of Delight (MOD) is when you reward users for doing or accomplishing a task. It can appear in the form of an encouraging message like, “You have reached inbox zero”, or in the form of a delightful animation. This is a small detail, but small details are what turn a good experience into a great experience. MOD is not necessarily for critical touch points, although it is more predominate in those moments. MOD can also come in the form of micro animations that provide feedback on basic interactions. “Acknowledge, give feedback, and reward users for tasks done within the user journey.” Linear UX is extremely functional and solution driven. Therefore sometimes, you have to forgo creativity over functionality. This doesn’t mean you can’t introduce new creative experiences or try out new things, it means by using this approach you can put the right foundations first, and build creative experiences on top of it. My goal with this post was to briefly touch on the top five principles of Linear UX, something I have been intending to document for sometime. I hope you find it helpful in your process of building great products. I will expand more on each principle (with examples) in a follow-up post. Let me know what you think in the comments or at @m_mozafarian on Twitter. #LinearUX If you find this post useful, please 💚 it so it can reach others as well. [Special thanks to Sunil Kanderi, Noel Cunningham, and Tricina Elliker for reviewing the early drafts and providing feedback.] ", "title": "Linear UX", "sentences": [{"7de9": "Linear UX"}, {"6852": "How to build a truly intuitive experience every time"}, {"7cca": "At its most simple, Linear UX is a set of methods for creating user-centred, goal-oriented experiences. The core principle revolves around creating a guided experience that allows users to achieve a goal or solve a problem by walking through a path in a frictionless journey."}, {"8f66": "This way of thinking is used widely in game design: Create an environment, provide a path to a goal, and leave clues for the character/user to help walk them through a sequence of tasks on the way toward achieving that ultimate goal."}, {"d458": "This approach is not unique to digital or interactive experiences only. Most of these principles can also be used in offline environments. If you study the history of art in Gothic and Renaissance eras, you can see how this type of guided experience was implemented in paintings mainly by Da Vinci and Rembrandt; There’s always an entry point for the eye, a storyline, and an invisible path that takes you through the entire painting."}, {"ceae": "Virgin of the rocks — Da Vinci"}, {"fdac": "Backstory"}, {"2e13": "“Linear UX” and its principles are something I have been drawing up for sometime now, with a goal to formulate methods universally applicable to product design. I have refined the approach over time to five core principles that can be used as a cheat sheet to create user-centered experiences."}, {"1c52": "I originally referred to this approach as “linear” because the approach, at its core, is sequential. It progresses from one stage to another in a single series of steps."}, {"c9e1": "Linear UX is naturally progressive and fits in perfectly in an Agile product development environment. It shines brightest when creating an MVP or the very first iteration of a product. I find it very useful, not just to evaluate ideas, but also to streamline the decision-making process."}, {"2cd9": "Another key benefit of Linear UX is its minimalistic approach to UX design, which removes a lot of unnecessary complications from the user experience. This allows for a better understanding of user behaviours, better measurement of user journeys, and more precise identification of critical touch-points."}, {"d81e": "Objective driven experience"}, {"72e2": "The core of Linear UX is about providing a way for users to complete a desired task and achieve a goal in a quick, easy, and friction free environment. Like any great experience, users are at the centre of this approach and helping them reach their goals should be the main objective of your product. The ability to clearly define the main objectives is key in creating intuitive experiences."}, {"9861": "One technique I often use to design a goal-driven experience is to reverse engineer the tasks needed to accomplish a goal. I start by considering the task done, then go backwards and identify all the steps in between. This way you can see the entire journey from a bird’s eye view. This helps to re-evaluate the steps and take actions to remove/exchange them to make the journey shorter."}, {"5d19": "Once all the steps are defined, then I start finding ways to stitch different steps together and begin to build a consistent and clear path for users to walk through."}, {"7733": "Remove as many steps as possible. Identify key actions and stitch steps together to create a clear user story. Your goal should be to allow users complete the task in the fewest steps."}, {"5c10": "When using the Linear approach, you think of your product as an enabler to take your users from Point A to point B. So it’s essential to know what the Point A and Point B are beforehand."}, {"32f4": "It’s a problem-first approach"}, {"6b6c": "Many designers fall in love with a solution before completely comprehending the problem."}, {"d283": "In the Linear UX approach, being able to state the problem clearly is everything. The better you can connect the the dots between the problem and a human condition or a basic need, the closer you are to identifying the core of the problem you are trying to solve."}, {"a61f": "Something I often tell less experienced designers: You should spend more time identifying the problem and trying to get to the core of it than trying to come up with solutions. Most of the time the real problem is completely different than what is stated. The problem-first approach helps prevent getting too attached to a solution too early. This way, you are putting yourself in a position where you can change approaches to achieve your goal."}, {"98b0": "Charles Kettering said it best: “A problem well stated is a problem half solved.”"}, {"487d": "“Get obsessed with the problem not the solution.”"}, {"0c82": "Light to Heavy, Easy to Hard"}, {"6951": "In Linear UX the experience is designed layer by layer. And more often than not, step by step. Every layer or step starts with a simple, lightweight task and it gets more complex as the journey progresses. For example to get users to grant you access to their photo library you’d explain why you need that permission before throwing an action card/screen for them to act on."}, {"d97b": "“If you need users to perform a complex or doubtable task put an easy task or step right before it. This will ease users to complete the task with a better mindset.”"}, {"f988": "Fewer options, Fewer actions"}, {"3b7d": "This is may be a bit more controversial than other principles in Linear UX (since there are different schools of thought on this subject matter), but a lot of people think your value to a user/customer is directly tied to the number of options or features you can provide. That’s not the case."}, {"5794": "Study after study have shown that people provided with fewer options are happier with their decisions when compared to those who had more options to choose from. This phenomena is so well documented, in fact, the TED Blog dedicated a roundup to the subject of happiness and choice."}, {"35ea": "In the Linear UX approach, we remove as many options and actions as possible from the experience and stick with the core actions that are critical to solving the problem. For less critical decisions, you can simplify the process by making the decisions on behalf of the user, automating the process as much as you can. This approach brings a lot of simplicity to the experience you are designing, and makes the journey more consistent throughout."}, {"3f2a": "You have probably heard some version of this before: “Make that button bigger so we will get more clicks on it.” I disagree with that advice. I say remove all the other buttons and only have one action on the screen. See how it increases your clicks, no matter where it is or what size it is."}, {"2e3f": "In short: Keep the number of actions and options to a minimum and keep to the essentials. Make those small decisions on behalf of the user and smooth out the journey. Don’t force your users to work hard just to use your product."}, {"ba10": "“Don’t make me think.” — Steve Krug"}, {"fa8c": "Moment of Delight"}, {"5fb3": "The Moment of Delight (MOD) is when you reward users for doing or accomplishing a task. It can appear in the form of an encouraging message like, “You have reached inbox zero”, or in the form of a delightful animation. This is a small detail, but small details are what turn a good experience into a great experience."}, {"3449": "MOD is not necessarily for critical touch points, although it is more predominate in those moments. MOD can also come in the form of micro animations that provide feedback on basic interactions."}, {"e698": "“Acknowledge, give feedback, and reward users for tasks done within the user journey.”"}, {"3fe5": "Linear UX is extremely functional and solution driven. Therefore sometimes, you have to forgo creativity over functionality. This doesn’t mean you can’t introduce new creative experiences or try out new things, it means by using this approach you can put the right foundations first, and build creative experiences on top of it."}, {"4f52": "My goal with this post was to briefly touch on the top five principles of Linear UX, something I have been intending to document for sometime. I hope you find it helpful in your process of building great products. I will expand more on each principle (with examples) in a follow-up post."}, {"fd3e": "Let me know what you think in the comments or at @m_mozafarian on Twitter. #LinearUX"}, {"a503": "If you find this post useful, please 💚 it so it can reach others as well."}, {"eadf": "[Special thanks to Sunil Kanderi, Noel Cunningham, and Tricina Elliker for reviewing the early drafts and providing feedback.]"}], "child": "718_1\t718_2\t718_3\t718_4718_1\t718_2\t718_3\t718_4"}