{"name": "719", "parent": "", "content": "Why no one should be called a UX Designer If you are even remotely associated to the web or technology industry in any way, chances are, you might have come across the most popular design role in technology these days - UX Designer. You may have even heard of the double-decker — UI/UX Designer (don’t even get me started on that). User experience (UX) is a critical, no-compromise area for every product’s success, and UX Designer may seem like a logical title for the person responsible for designing it. However, after having worked as one, it has hit me more than once, that it might be an immature term, coined in the blurring-fast, ever-evolving world of today’s technology. A year and half ago, I got my title changed. Here are the 2 main reasons why it has bugged me for so-long: 1. Every designer is (if not.. should be) a UX designer. This is the most obvious one. Think of the basic things you use everyday — the shoes you wear, the car you drive or even the chair you’re sitting on right now. Every product in your life has a unique user experience which you might like or hate. And get this — the person who designed it was most definitely not called a UX Designer. These designers designed the product with the user in mind, because it is their JOB to do so. Wouldn’t it sound stupid to call all of them user experience designers? An architect designs buildings, and every second you’re inside a building or near one, you are experiencing it. Did the Architect design the user experience for it? YES. Lets call him a user experience designer? NO. I am a Hindu by birth, (not a very religious one though) and we have the concept of ‘Dharma’ in the culture. Dharma, in crude terms, translates to ‘moral duty’ and everyone has a dharma to uphold. A Kshatriya (warrior) is meant to fight wars for his lord, but it is also his dharma to protect the weak. If he refuses to do so or shies away from it, he is deemed unfit to be called a Kshatriya. Sorry, for getting emotional. Bottomline - All designers must design the functional aspect of the product, but it is their moral duty to always be aware of the appropriate user experience for it. 2. Everyone working on the product contributes to the UX. Now, think of a web product that you use frequently: Facebook, Instagram, Uber, Yelp, Snapchat… anything. They’re all designed amazingly well, but would the user experience be same if … You guessed it. This is Boromir, not Ned Stark. User experience results from the combined efforts of everyone involved in building it. Front-end developers, dev-ops, product mangers, copywriters, support executives & all other people contributing to the product are responsible for the UX. Sometimes, more so than the designers. Thinking that a designer or a specific person/team designs the user experience, is setting the wrong expectations in the first place. No, you’re not. If you are a creature they call a UX designer, keep calm. You now know that one designer (or even a team) cannot be responsible for the UX unless they are the only contributing member(s) in the team. Also, UX is far too broad a term to define somebody’s job. It’s like calling an aeronautical engineer — a ‘sky specialist’. Take a deep breath, and ask yourself this profound question. “What do you do at work?” Please don’t. No really, what is it that you actually do? If 80% of the time, you’re doing (x), then you are an (x) designer. If you come in at early stage and ideate on the user flows, you can call yourself an Interaction designer. If you design early-mid stage wireframes or prototypes, call yourself a Prototype designer. If you design the final interface, call yourself a User Interface(UI) designer. If you design icons, illustrations, you can be known as a Visual designer. Animations? Motion designer. If you don’t design anything, but come up with strategies & recommendations to make the product more usable, you might be a usability analyst, or a maybe a UX researcher. If you fill in more than 3 of the above mentioned roles, you can call yourself a digital product designer, or simply - Product Designer. This golden title has already been embraced by companies like Facebook, Uber, Airbnb and many others. I’ve noticed Google is slowly moving towards it. But sadly many, including some giants like Adobe & Microsoft, still use the inexact title (I’m not even typing it again). UX has the most noticeable connection to design, which misleads everyone into thinking that its the designer’s responsibility. Many other confusing terms and theories follow. Referring to someone as a UX designer is just cementing this confusion even more. The root cause for confusion here is that people take UX as a subset of design. In truth, UX is the outcome of not only design, but many other disciplines, factors & circumstances. Here’s hoping that the world bids farewell to this title soon. ", "title": "Why no one should be called a UX Designer", "sentences": [{"4e72": "Why no one should be called a UX Designer"}, {"1784": "If you are even remotely associated to the web or technology industry in any way, chances are, you might have come across the most popular design role in technology these days - UX Designer. You may have even heard of the double-decker — UI/UX Designer (don’t even get me started on that). User experience (UX) is a critical, no-compromise area for every product’s success, and UX Designer may seem like a logical title for the person responsible for designing it."}, {"b45d": "However, after having worked as one, it has hit me more than once, that it might be an immature term, coined in the blurring-fast, ever-evolving world of today’s technology. A year and half ago, I got my title changed. Here are the 2 main reasons why it has bugged me for so-long:"}, {"0d93": "1. Every designer is (if not.. should be) a UX designer."}, {"5cb1": "This is the most obvious one. Think of the basic things you use everyday — the shoes you wear, the car you drive or even the chair you’re sitting on right now. Every product in your life has a unique user experience which you might like or hate. And get this — the person who designed it was most definitely not called a UX Designer."}, {"1483": "These designers designed the product with the user in mind, because it is their JOB to do so. Wouldn’t it sound stupid to call all of them user experience designers? An architect designs buildings, and every second you’re inside a building or near one, you are experiencing it. Did the Architect design the user experience for it? YES. Lets call him a user experience designer? NO."}, {"0929": "I am a Hindu by birth, (not a very religious one though) and we have the concept of ‘Dharma’ in the culture. Dharma, in crude terms, translates to ‘moral duty’ and everyone has a dharma to uphold. A Kshatriya (warrior) is meant to fight wars for his lord, but it is also his dharma to protect the weak. If he refuses to do so or shies away from it, he is deemed unfit to be called a Kshatriya."}, {"abec": "Sorry, for getting emotional."}, {"a98f": "Bottomline - All designers must design the functional aspect of the product, but it is their moral duty to always be aware of the appropriate user experience for it."}, {"8831": "2. Everyone working on the product contributes to the UX."}, {"07d7": "Now, think of a web product that you use frequently: Facebook, Instagram, Uber, Yelp, Snapchat… anything. They’re all designed amazingly well, but would the user experience be same if …"}, {"2d5e": "You guessed it."}, {"6f03": "This is Boromir, not Ned Stark."}, {"92e6": "User experience results from the combined efforts of everyone involved in building it. Front-end developers, dev-ops, product mangers, copywriters, support executives & all other people contributing to the product are responsible for the UX. Sometimes, more so than the designers."}, {"591a": "Thinking that a designer or a specific person/team designs the user experience, is setting the wrong expectations in the first place."}, {"11ee": "No, you’re not."}, {"c774": "If you are a creature they call a UX designer, keep calm. You now know that one designer (or even a team) cannot be responsible for the UX unless they are the only contributing member(s) in the team. Also, UX is far too broad a term to define somebody’s job. It’s like calling an aeronautical engineer — a ‘sky specialist’."}, {"a93b": "Take a deep breath, and ask yourself this profound question."}, {"a9c6": "“What do you do at work?”"}, {"3fcf": "Please don’t."}, {"4da8": "No really, what is it that you actually do? If 80% of the time, you’re doing (x), then you are an (x) designer. If you come in at early stage and ideate on the user flows, you can call yourself an Interaction designer. If you design early-mid stage wireframes or prototypes, call yourself a Prototype designer. If you design the final interface, call yourself a User Interface(UI) designer. If you design icons, illustrations, you can be known as a Visual designer. Animations? Motion designer."}, {"90f6": "If you don’t design anything, but come up with strategies & recommendations to make the product more usable, you might be a usability analyst, or a maybe a UX researcher."}, {"d079": "If you fill in more than 3 of the above mentioned roles, you can call yourself a digital product designer, or simply - Product Designer. This golden title has already been embraced by companies like Facebook, Uber, Airbnb and many others. I’ve noticed Google is slowly moving towards it. But sadly many, including some giants like Adobe & Microsoft, still use the inexact title (I’m not even typing it again)."}, {"12ce": "UX has the most noticeable connection to design, which misleads everyone into thinking that its the designer’s responsibility. Many other confusing terms and theories follow. Referring to someone as a UX designer is just cementing this confusion even more."}, {"a404": "The root cause for confusion here is that people take UX as a subset of design. In truth, UX is the outcome of not only design, but many other disciplines, factors & circumstances."}, {"495b": "Here’s hoping that the world bids farewell to this title soon."}], "child": "719_1\t719_2\t719_3\t719_4\t719_5\t719_6\t719_7\t719_8\t719_9\t719_10\t719_11\t719_12\t719_13\t719_14\t719_15\t719_16\t719_17\t719_18\t719_19"}