{"name": "721", "parent": "", "content": "For the Love of Food, People, and UX A usability case study on food delivery app Eat24 Objective My goals for this UX study were to: Why Eat24? Food delivery is arguably the most breakthrough idea anyone’s ever had. It’s even better now with smartphones. Not having to talk to anyone to order food? The dream. Eat24 has the power to leverage Yelp reviews and ratings to help hungry users pick the best place to order delivery from. I thought this was a great chance for me to flex my design muscles and explore how I can improve the experience of the app (but most importantly, stare at pictures of food). This is all of us. (Source: Yelp Eat24 Twitter) User Research On a rainy day, I approached strangers to run usability tests on Eat24 (see Goal #5). Using a GoPro to record their voice, fingers, and the screen, I interviewed 7 people and later compiled the insights drawn from the interactions. I approached users with the prompt: Imagine a night where you’d more likely order delivery than go out to eat. Show me how you would order delivery using Eat24. Throughout the process, I encouraged participants to express general thoughts, many of which were laments about how freakin’ good a side of garlic bread sounded. User Demographic Six users I interviewed were 20–30 years old and one user was in his 40s. Four of them didn’t regularly use food delivery apps, but had ordered delivery using other methods. Three users had used the services Postmates and GrubHub. UX Tools I Used To organize my findings and pick out resounding pain points, I categorized each separate insight in an affinity map and analyzed each one across Importance to User vs. Importance to Business in a 2x2 diagram. I plotted points based off of what I knew about Yelp’s business model and the main functions of the main Yelp app and Eat24. My assumptions were: 1) the user uses food delivery apps like Eat24 to get food quickly and easily and, 2) Yelp wants to facilitate the interaction between the user and the restaurant in ordering delivery. To help me better associate the issues around a single user, I sketched up a persona to represent the users I interviewed. I also created scenarios that my persona might go through, based on the situations the users I interviewed would usually order delivery. No, not all users had grass for hair. In case you were curious, Josh is currently binge-watching Jane the Virgin. Defining the Problem While none of the users had trouble successfully placing an order, most of their interactions indicated that they were confused by or did not expect something while searching for a restaurant. I narrowed these points down to: Pain Point 1: Users are confused about how search results are ordered and presented. Pain Point 2: Users did not find the current sort bar helpful. Pain Point 3: Users expressed that they were most interested in reviews and rating but did not navigate to the “restaurant information” page. Restaurants further away and lower-rated often showed first, leaving users confused and frustrated. One user was even shown 3 different 3-starred restaurants before being shown a 4-starred restaurant. They were still unsatisfied with the results presented to them even after using a sort function. Finally, of the users that made it to the “restaurant information” tucked behind a small button, most of them were less than pleased when tapping to see more reviews took them out of Eat24. I identified the main problem: The search experience does not match the mental models of users. Below are the specific user interactions that helped me identify my pain points, listed in a table I created to help quantify the results of my design changes. I created a task flow to show the current user flow and highlighted the area, which represents the restaurant selection process, I hope to alleviate with my solution. I realized that users seemed to be expecting a “Yelp-like” experience. The main Yelp app has already handled a lot of the Eat24 issues users brought up, such as pulling out commonly used filters and labeling searches. Almost all users referenced their Yelp browsing habits while searching through Eat24. Confusion and unexpected interactions while browsing and can cause users to be frustrated and spend more time viewing options that they are unlikely to pick. My solution: pull elements from the main Yelp app to eliminate confusion and make it faster to get food from the restaurant to user’s hungry belly. I’d react like this too, if the speed of food arriving at my door was on the line. Ideation Drawing on features of the main Yelp app, I came up with the proposed solutions below: Pain Point 1: Users are confused about how search results are ordered and displayed.Proposed Design Change 1: Highlight a sort label by default to make search results more explicit. Pain Point 2: Users did not find the current sort bar helpful.Proposed Design Change 2: Highlight a sort label and pull out useful filter options. Pain Point 3: Users expressed that they were most interested in reviews and rating but did not navigate to the “restaurant information” page.Proposed Design Change 3: Show restaurant information with reviews first before menu. I sketched several different options of including the Yelp filter bar, as well as a new navigation bar that combined both sort and filter functions. I also sketched new layouts for the restaurant information page and how it could be navigated to and from the menu page. Choosing the best option that took into account technical and business constraints, I tested my prototype on 7 new users. The Solution and Impact After my changes, all 7 users of the prototype had no trouble making sense of the ranking order of the search results that were presented and none expressed any sort of confusion. Most users even actively engaged with the new filter and sort bar in their search and found them helpful. Given these results, I can assume that their overall browsing and ordering experience will be faster and more streamlined. Conclusion TL;DR Many people expressed confusion and frustration while searching for a restaurant to order from Eat24. I learned that the root of the mismatch between the app’s experience and the mental models of a lot of users was that users were expecting a “Yelp-like” experience. Because all of them have used Yelp, they were expecting robust search results and restaurant information before seeing menu options. Although Eat24 is geared towards delivery only, I believe that molding the experience of Eat24 to be consistent with the popular main Yelp app will encourage many more people to adopt Eat24 as their primary delivery method. It was my love for food, people, and UX that motivated me to critically analyze the experience of Eat24. But alas, I can’t lie to myself: Just kidding. People are great, too. Note: I do not work for, nor am I affiliated with Yelp or Eat24. This UX study was done to help make me a better designer. Thanks for sticking it out to the end! If you’d like to talk food, people, or UX, hit me up at katiesychen@gmail.com or LinkedIn, and please check out more of my work at katieschen.com! (I’m also looking for exciting full-time design opportunities!) Special thanks to ma fave peeps Cynthia Lo, Keenan Murphy, Tracy Tsu, Marjan Soleimanieh, Justin Jiang, and Quinn Z Shen! ", "title": "For the Love of Food, People, and UX", "sentences": [{"2aa2": "For the Love of Food, People, and UX"}, {"60a5": "A usability case study on food delivery app Eat24"}, {"4991": "Objective"}, {"dd57": "My goals for this UX study were to:"}, {"5992": "Why Eat24?"}, {"08a8": "Food delivery is arguably the most breakthrough idea anyone’s ever had. It’s even better now with smartphones. Not having to talk to anyone to order food? The dream."}, {"8069": "Eat24 has the power to leverage Yelp reviews and ratings to help hungry users pick the best place to order delivery from. I thought this was a great chance for me to flex my design muscles and explore how I can improve the experience of the app (but most importantly, stare at pictures of food)."}, {"324f": "This is all of us. (Source: Yelp Eat24 Twitter)"}, {"a267": "User Research"}, {"2717": "On a rainy day, I approached strangers to run usability tests on Eat24 (see Goal #5). Using a GoPro to record their voice, fingers, and the screen, I interviewed 7 people and later compiled the insights drawn from the interactions. I approached users with the prompt:"}, {"f514": "Imagine a night where you’d more likely order delivery than go out to eat. Show me how you would order delivery using Eat24."}, {"525c": "Throughout the process, I encouraged participants to express general thoughts, many of which were laments about how freakin’ good a side of garlic bread sounded."}, {"fa47": "User Demographic"}, {"a6ad": "Six users I interviewed were 20–30 years old and one user was in his 40s. Four of them didn’t regularly use food delivery apps, but had ordered delivery using other methods. Three users had used the services Postmates and GrubHub."}, {"87c5": "UX Tools I Used"}, {"e9d8": "To organize my findings and pick out resounding pain points, I categorized each separate insight in an affinity map and analyzed each one across Importance to User vs. Importance to Business in a 2x2 diagram. I plotted points based off of what I knew about Yelp’s business model and the main functions of the main Yelp app and Eat24. My assumptions were: 1) the user uses food delivery apps like Eat24 to get food quickly and easily and, 2) Yelp wants to facilitate the interaction between the user and the restaurant in ordering delivery."}, {"4b6f": "To help me better associate the issues around a single user, I sketched up a persona to represent the users I interviewed. I also created scenarios that my persona might go through, based on the situations the users I interviewed would usually order delivery."}, {"da6e": "No, not all users had grass for hair."}, {"b9b7": "In case you were curious, Josh is currently binge-watching Jane the Virgin."}, {"5599": "Defining the Problem"}, {"18e6": "While none of the users had trouble successfully placing an order, most of their interactions indicated that they were confused by or did not expect something while searching for a restaurant. I narrowed these points down to:"}, {"09d5": "Pain Point 1: Users are confused about how search results are ordered and presented."}, {"cf6d": "Pain Point 2: Users did not find the current sort bar helpful."}, {"079f": "Pain Point 3: Users expressed that they were most interested in reviews and rating but did not navigate to the “restaurant information” page."}, {"2aab": "Restaurants further away and lower-rated often showed first, leaving users confused and frustrated. One user was even shown 3 different 3-starred restaurants before being shown a 4-starred restaurant. They were still unsatisfied with the results presented to them even after using a sort function. Finally, of the users that made it to the “restaurant information” tucked behind a small button, most of them were less than pleased when tapping to see more reviews took them out of Eat24."}, {"f69e": "I identified the main problem:"}, {"d62c": "The search experience does not match the mental models of users."}, {"f37c": "Below are the specific user interactions that helped me identify my pain points, listed in a table I created to help quantify the results of my design changes."}, {"4c55": "I created a task flow to show the current user flow and highlighted the area, which represents the restaurant selection process, I hope to alleviate with my solution."}, {"5f2a": "I realized that users seemed to be expecting a “Yelp-like” experience. The main Yelp app has already handled a lot of the Eat24 issues users brought up, such as pulling out commonly used filters and labeling searches. Almost all users referenced their Yelp browsing habits while searching through Eat24."}, {"5ff7": "Confusion and unexpected interactions while browsing and can cause users to be frustrated and spend more time viewing options that they are unlikely to pick. My solution: pull elements from the main Yelp app to eliminate confusion and make it faster to get food from the restaurant to user’s hungry belly."}, {"0ce8": "I’d react like this too, if the speed of food arriving at my door was on the line."}, {"8956": "Ideation"}, {"7c8b": "Drawing on features of the main Yelp app, I came up with the proposed solutions below:"}, {"6b3d": "Pain Point 1: Users are confused about how search results are ordered and displayed.Proposed Design Change 1: Highlight a sort label by default to make search results more explicit."}, {"983a": "Pain Point 2: Users did not find the current sort bar helpful.Proposed Design Change 2: Highlight a sort label and pull out useful filter options."}, {"b9bf": "Pain Point 3: Users expressed that they were most interested in reviews and rating but did not navigate to the “restaurant information” page.Proposed Design Change 3: Show restaurant information with reviews first before menu."}, {"34e6": "I sketched several different options of including the Yelp filter bar, as well as a new navigation bar that combined both sort and filter functions. I also sketched new layouts for the restaurant information page and how it could be navigated to and from the menu page. Choosing the best option that took into account technical and business constraints, I tested my prototype on 7 new users."}, {"0437": "The Solution and Impact"}, {"1f2f": "After my changes, all 7 users of the prototype had no trouble making sense of the ranking order of the search results that were presented and none expressed any sort of confusion. Most users even actively engaged with the new filter and sort bar in their search and found them helpful. Given these results, I can assume that their overall browsing and ordering experience will be faster and more streamlined."}, {"566b": "Conclusion"}, {"407f": "TL;DR Many people expressed confusion and frustration while searching for a restaurant to order from Eat24. I learned that the root of the mismatch between the app’s experience and the mental models of a lot of users was that users were expecting a “Yelp-like” experience. Because all of them have used Yelp, they were expecting robust search results and restaurant information before seeing menu options."}, {"ecef": "Although Eat24 is geared towards delivery only, I believe that molding the experience of Eat24 to be consistent with the popular main Yelp app will encourage many more people to adopt Eat24 as their primary delivery method."}, {"1765": "It was my love for food, people, and UX that motivated me to critically analyze the experience of Eat24. But alas, I can’t lie to myself:"}, {"44d2": "Just kidding. People are great, too."}, {"4199": "Note: I do not work for, nor am I affiliated with Yelp or Eat24. This UX study was done to help make me a better designer."}, {"79d1": "Thanks for sticking it out to the end! If you’d like to talk food, people, or UX, hit me up at katiesychen@gmail.com or LinkedIn, and please check out more of my work at katieschen.com! (I’m also looking for exciting full-time design opportunities!)"}, {"36aa": "Special thanks to ma fave peeps Cynthia Lo, Keenan Murphy, Tracy Tsu, Marjan Soleimanieh, Justin Jiang, and Quinn Z Shen!"}], "child": "721_1\t721_2\t721_3\t721_4\t721_5\t721_6\t721_7\t721_8\t721_9\t721_10\t721_11\t721_12721_1\t721_2\t721_3\t721_4\t721_5\t721_6\t721_7\t721_8\t721_9\t721_10\t721_11\t721_12721_1\t721_2\t721_3\t721_4\t721_5\t721_6\t721_7\t721_8\t721_9\t721_10\t721_11\t721_12"}