{"name": "723", "parent": "", "content": "VSCO, More Than Just Filters A UX Case Study on VSCO’s iOS App It all started when I noticed my friend jumping between different apps making edits and applying filters, until finally switching to Instagram to post the final photo of our dinner. It seemed he really like the filters from an app called VSCO, but could not be bothered to use the app’s other features that would’ve saved him from having to switch to different apps. This got me thinking: Why is he bringing the photo to another app when he can do all the same edits on the VSCO app? Identifying the Problem There are even more icons in the edit menu in addition to the ones above After browsing through the app, I could start to see why my friend was hesitant to use the app’s full features. A pain point I discovered was the lack of labels for icons especially during the photo taking and editing process. There are some icons that are recognizable without a label, however, most of the icons that VSCO decided to use were confusing and required a lot of guesswork that left me quitting out of the app before getting to any meaningful results. Multiple icons without labels lead to confusion, frustration, and ultimately poor user experience. It turns out that I’m not the only user out there suffering from this problem. Here are some reviews from the app store: “This app is stressful to use.” — Alovesd “Unmatched film presets plagued by poor UI/UX…Everything is so minimal to the point where it isn’t intuitive, and it ruins the experience.” — David_Burns_Red “Tremendous potential, but continuously lacks usability.” — rik.venture What are those?! Persona and Task Flow In order to help me find problems with the app, I created a persona named Charles based off my assumptions of what a typical user of VSCO looks like. Charles is 19 years old, a casual photographer, and is currently a student in college. He wants to take a photo, add some cool edits and filters, then share it with his friends. Below is the ideal scenario for Charles: Using the ideal scenario above which encompasses the journey of a user wanting to apply cool edits to his photo before sharing with friends, I created a task flow to help me see how a user gets to a positive outcome with his or her initial goal/motivation. Using the task flow, it was clear to me that I needed to emphasize making the core features; taking a photo, editing, and sharing it as smooth as possible by fixing any pain points in that process. As the core features, they should be delivering an optimal user experience in order for the app to succeed and increase user engagement. Guerilla Usability Testing I had an assumption of what some of the pain points were, but it wasn’t enough. I went out to a local park with beautiful scenery in hopes to find photographers similar to the persona I created. Using the task flow I was able to set up some tests for these users in order to find specific pain points in the app. Each user was provided a scenario that closely represented the task flow above. Here is an example scenario: Affinity Map After reviewing the videos of each testing session, I took down notes that included observations on user actions, comments, and thoughts. Then using affinity mapping, I grouped each pain-point into its respective category which helped me get an overall picture of the problem. Notes from Usability Testing VSCO Pain Points Using the results of the affinity map and usability tests, I identified specific pain points in the following areas: Camera Some users were unable to find the camera quickly at first, especially if they were pointing to a dark spot. Camera also has a lot of features with no labels leading to confusion. Users were unaware of additional options available if they swiped on the menu. Edit photo tools and workflow Too many icons in the photo edit menu without a label, leads to a lot of guesswork and frustration. Lack of a redo button led to some frustration in users, while other features like undo and save were hidden away in a subtle navigation menu. Social Sharing When asked to share the final photo on social media, every user ended up clicking the same wrong button that led to an unexpected result. The share button was tucked away in another menu and users had a difficult time getting to it. Crafting the Solution Lo-Fi Sketches After identifying the problems and pain-points, I set out to create some basic lo-fi sketches for some quick creative ideation. After multiple sketches, I was able to get a rough idea of what I assumed to work. Hi-Fi Mockups Home Screen Some users had difficulty finding the camera during the usability test and also expressed confusion at the bottom nav icons. Below is my proposed solution for the home screen: Proposed solution changes: Camera In its current state, casual photographers and newcomers to the app find it difficult to use the camera to its fullest function. One unique aspect of VSCO’s camera was the sheer amount of control you have over the camera settings, but it means very little if most users find it difficult to use. Let’s look at the camera: Proposed solution changes: Photo Editing Abstract icons with no labels and unclear or poor navigation, two major problems with the app, could be found in the photo editing process. My goal for this screen was to make editing a fun and enjoyable process that could be done quickly and efficiently by users of all levels. Let’s look at the photo editing screens: Proposed solution changes: Social Sharing For the problem with social sharing, no heavy UI changes were needed. It turned out that all the users during the usability tests mistook the “Publish to VSCO” button as the share button. I took out the share option that was hidden away in a different menu and brought its options to a new menu that included a shortcut for publishing to VSCO. Here is my proposed solution for social sharing: Results After completing the prototype, I found another group of six different users for my final usability test. The tasks were similar to the ones I assigned before my redesigns, but the results were immensely different. Frustrating and confusing moments that were dominant before were suddenly replaced with confidence and AHA moments. Here are the test results: Camera Photo Edit Social Sharing Overall Users were able to complete all the tasks under a minute, which is a significant decrease in time from the previous test where users took on average 3 minutes to complete the task. All testers expressed confidence during the tasks and did not express any frustration. Conclusion Before the redesigns, the process to take a photo, edit it, and share it on social networks took longer and was harder than it should’ve been due to a lot of guess work. Hopefully with my proposed solutions, users will no longer use VSCO just for the filters, but feel empowered to use the app for all their photography needs. Prototype To see how this all comes together in a working fashion, please check the prototype out: Thank you for reading! If you have any questions or just want to chat, feel free to send me a message via email, kkwon@tradecrafted.com or Linked-In. I would love feedback! I am not affiliated with VSCO. I was just interested to see if I could help boost the user experience of this cool photography app! ", "title": "VSCO, More Than Just Filters", "sentences": [{"27e4": "VSCO, More Than Just Filters"}, {"12e7": "A UX Case Study on VSCO’s iOS App"}, {"ff78": "It all started when I noticed my friend jumping between different apps making edits and applying filters, until finally switching to Instagram to post the final photo of our dinner. It seemed he really like the filters from an app called VSCO, but could not be bothered to use the app’s other features that would’ve saved him from having to switch to different apps. This got me thinking: Why is he bringing the photo to another app when he can do all the same edits on the VSCO app?"}, {"56de": "Identifying the Problem"}, {"e9af": "There are even more icons in the edit menu in addition to the ones above"}, {"2d10": "After browsing through the app, I could start to see why my friend was hesitant to use the app’s full features. A pain point I discovered was the lack of labels for icons especially during the photo taking and editing process. There are some icons that are recognizable without a label, however, most of the icons that VSCO decided to use were confusing and required a lot of guesswork that left me quitting out of the app before getting to any meaningful results. Multiple icons without labels lead to confusion, frustration, and ultimately poor user experience. It turns out that I’m not the only user out there suffering from this problem."}, {"4b3d": "Here are some reviews from the app store:"}, {"2216": "“This app is stressful to use.” — Alovesd"}, {"ad4e": "“Unmatched film presets plagued by poor UI/UX…Everything is so minimal to the point where it isn’t intuitive, and it ruins the experience.” — David_Burns_Red"}, {"c512": "“Tremendous potential, but continuously lacks usability.” — rik.venture"}, {"da10": "What are those?!"}, {"d3d9": "Persona and Task Flow"}, {"adaa": "In order to help me find problems with the app, I created a persona named Charles based off my assumptions of what a typical user of VSCO looks like. Charles is 19 years old, a casual photographer, and is currently a student in college. He wants to take a photo, add some cool edits and filters, then share it with his friends. Below is the ideal scenario for Charles:"}, {"a882": "Using the ideal scenario above which encompasses the journey of a user wanting to apply cool edits to his photo before sharing with friends, I created a task flow to help me see how a user gets to a positive outcome with his or her initial goal/motivation."}, {"aeb0": "Using the task flow, it was clear to me that I needed to emphasize making the core features; taking a photo, editing, and sharing it as smooth as possible by fixing any pain points in that process. As the core features, they should be delivering an optimal user experience in order for the app to succeed and increase user engagement."}, {"3ab7": "Guerilla Usability Testing"}, {"ab14": "I had an assumption of what some of the pain points were, but it wasn’t enough. I went out to a local park with beautiful scenery in hopes to find photographers similar to the persona I created. Using the task flow I was able to set up some tests for these users in order to find specific pain points in the app. Each user was provided a scenario that closely represented the task flow above. Here is an example scenario:"}, {"c03e": "Affinity Map"}, {"3ccd": "After reviewing the videos of each testing session, I took down notes that included observations on user actions, comments, and thoughts. Then using affinity mapping, I grouped each pain-point into its respective category which helped me get an overall picture of the problem."}, {"bef3": "Notes from Usability Testing"}, {"97fd": "VSCO Pain Points"}, {"47f5": "Using the results of the affinity map and usability tests, I identified specific pain points in the following areas:"}, {"cf0d": "Camera"}, {"fc55": "Some users were unable to find the camera quickly at first, especially if they were pointing to a dark spot. Camera also has a lot of features with no labels leading to confusion. Users were unaware of additional options available if they swiped on the menu."}, {"b426": "Edit photo tools and workflow"}, {"1b68": "Too many icons in the photo edit menu without a label, leads to a lot of guesswork and frustration. Lack of a redo button led to some frustration in users, while other features like undo and save were hidden away in a subtle navigation menu."}, {"5820": "Social Sharing"}, {"4c2c": "When asked to share the final photo on social media, every user ended up clicking the same wrong button that led to an unexpected result. The share button was tucked away in another menu and users had a difficult time getting to it."}, {"7b76": "Crafting the Solution"}, {"a2f5": "Lo-Fi Sketches"}, {"b0d0": "After identifying the problems and pain-points, I set out to create some basic lo-fi sketches for some quick creative ideation. After multiple sketches, I was able to get a rough idea of what I assumed to work."}, {"129c": "Hi-Fi Mockups"}, {"85f0": "Home Screen"}, {"1eea": "Some users had difficulty finding the camera during the usability test and also expressed confusion at the bottom nav icons."}, {"9f83": "Below is my proposed solution for the home screen:"}, {"f0b1": "Proposed solution changes:"}, {"9974": "Camera"}, {"de4c": "In its current state, casual photographers and newcomers to the app find it difficult to use the camera to its fullest function. One unique aspect of VSCO’s camera was the sheer amount of control you have over the camera settings, but it means very little if most users find it difficult to use."}, {"6ae9": "Let’s look at the camera:"}, {"265e": "Proposed solution changes:"}, {"c4a9": "Photo Editing"}, {"d501": "Abstract icons with no labels and unclear or poor navigation, two major problems with the app, could be found in the photo editing process. My goal for this screen was to make editing a fun and enjoyable process that could be done quickly and efficiently by users of all levels."}, {"48d7": "Let’s look at the photo editing screens:"}, {"6546": "Proposed solution changes:"}, {"b6da": "Social Sharing"}, {"f9d5": "For the problem with social sharing, no heavy UI changes were needed. It turned out that all the users during the usability tests mistook the “Publish to VSCO” button as the share button. I took out the share option that was hidden away in a different menu and brought its options to a new menu that included a shortcut for publishing to VSCO."}, {"3f13": "Here is my proposed solution for social sharing:"}, {"bd77": "Results"}, {"e5ae": "After completing the prototype, I found another group of six different users for my final usability test."}, {"f0cb": "The tasks were similar to the ones I assigned before my redesigns, but the results were immensely different. Frustrating and confusing moments that were dominant before were suddenly replaced with confidence and AHA moments."}, {"528d": "Here are the test results:"}, {"dddd": "Camera"}, {"9113": "Photo Edit"}, {"e73e": "Social Sharing"}, {"58ec": "Overall"}, {"0805": "Users were able to complete all the tasks under a minute, which is a significant decrease in time from the previous test where users took on average 3 minutes to complete the task. All testers expressed confidence during the tasks and did not express any frustration."}, {"0115": "Conclusion"}, {"8773": "Before the redesigns, the process to take a photo, edit it, and share it on social networks took longer and was harder than it should’ve been due to a lot of guess work. Hopefully with my proposed solutions, users will no longer use VSCO just for the filters, but feel empowered to use the app for all their photography needs."}, {"a04b": "Prototype"}, {"a4cd": "To see how this all comes together in a working fashion, please check the prototype out:"}, {"5c62": "Thank you for reading! If you have any questions or just want to chat, feel free to send me a message via email, kkwon@tradecrafted.com or Linked-In. I would love feedback!"}, {"6cde": "I am not affiliated with VSCO. I was just interested to see if I could help boost the user experience of this cool photography app!"}], "child": "723_1\t723_2\t723_3\t723_4\t723_5\t723_6\t723_7\t723_8\t723_9\t723_10\t723_11\t723_12\t723_13\t723_14\t723_15\t723_16\t723_17\t723_18\t723_19\t723_20\t723_21\t723_22\t723_23\t723_24\t723_25723_1\t723_2\t723_3\t723_4\t723_5\t723_6\t723_7\t723_8\t723_9\t723_10\t723_11\t723_12\t723_13\t723_14\t723_15\t723_16\t723_17\t723_18\t723_19\t723_20\t723_21\t723_22\t723_23\t723_24\t723_25"}