{"name": "726", "parent": "", "content": "User research: Airbnb for the Chinese market Photo illustration by Lisa Larson-Walker. Photo by Sean Pavone/Shutterstock. I talked about how design helps Airbnb’s cross-culture business in my last article. As a Chinese person living in the US, I thought it would be interesting to go further and study the Airbnb users in the Chinese market. “At Airbnb, our mission is to help create a world where anyone can belong anywhere, and with nearly 1.5 billion people living in China, it’s clear that this country is an important part of our global community.” — Airbnb According to the Airbnb blog, “China is one of the biggest and fastest growing outbound travel markets in the world. In just the past year alone, outbound travel from Chinese guests through Airbnb has grown 700%, making it our fastest growing outbound market. Last year in 2015, Airbnb brought on two strategic partners — China Broadband Capital (CBC) and Sequoia China — to help them continue to navigate the China market and create a truly localized presence for the company.” Market Research Due to culture differences, it’s not easy for the majority of Chinese people to accept the concept of accommodation-sharing. China’s culture of guanxi (networks of acquaintances) very much relies on human relationships. Trust and security issues have been the biggest obstacle to the sharing economy in China. Because of land ownership restrictions in China, most people do not have vacant rooms or houses available to rent. Most Chinese do not live in single-family homes as in the US; instead, they live in apartment complexes that severely restrict their ability to sub-lease. What does the short-term rental market look like in China? 1. High demand in the first and second tier citiesIn addition to attracting international tourists, vibrant economies in first-tier cities like Beijing, Shanghai and Shenzhen attract many domestic visitors. These visitors from throughout China seek better jobs, better education, and better medical care. While they stay in these top-tier cities, they need short and medium-term housing.2. Good demand in lower tier touristy citiesA good example would be Sanya (China’s Hawaii) or Chengdu (where the pandas are). The market is heating up because of its well-known landmarks and a lower cost of living makes it more affordable when traveling.3. The market in the rest China, the third-tier cities and the rural areas without any tourism, is a bit bleak. User Personas When expanding a business into a different country, it’s important to understand how users differ, what their goals are, what their needs are, and how they think and feel. In order to create a realistic representation of Airbnb’s Chinese user segment, I conducted user research on some friends living in China. Below I summarize the 5 personas I created based on this research. Persona #1 (guest) Unmarried young generation, live with the parents They have experiences studying abroad and have a more western mindset, enabling them to easily adopt the Airbnb concept. They would love to become an Airbnb host in their local cities, but the reality of not actually owning a house or an apartment has made it extremely difficult, especially when their parents are reluctant to let strangers live in the house. On the bright side, they enjoy traveling and often use Airbnb instead of hotels. Persona #2 (host and guest) Westernized, own a house/apartment They have a stable job with good income and are able to afford a house or an apartment in a first or second tier city in China. They have a western mindset and are willing to rent out their own house/apartment to strangers. They are both Airbnb hosts in their local cities, and Airbnb guests when they travel. Persona #3 (host and guest) American born Chinese, foreigners, rent a house/apartment They are not native Chinese but love Chinese culture, they live and work in China. They are very fond of the Airbnb concept, absolutely willing to rent out the house or rooms to strangers. They also enjoy the experience of staying at Airbnb homes when they travel. Similar to persona #2, they are both Airbnb hosts and guests. Natasia Guo is one of the early Airbnb hosts in China since 2011. With her experience using Airbnb as both a host and guest, I interviewed her with a few questions through email where she shared some great insights about Airbnb. Q1: Why are you a host of Airbnb? “Airbnb is a great way to meet likeminded people while making some cash. In 2011, I became a host on Airbnb to help fund/feed my life as a scrappy entrepreneur. Through the years, it has continued to be a meaningful experience to connect with likeminded people from around the world.” Q2: Who are your guests? Are they local Chinese, foreigners or both? “When I first started Airbnb-ing, the guests were almost 100% foreigners from mainly the US and Europe, with the majority having some connection with the tech industry. Over the years as Airbnb set up operations and efforts in the region, the ratio has changed to about 50% domestic Chinese and 50% foreigners. The domestic Chinese almost always are students on holiday from studying abroad in the US, Australia or Europe.” Q3: As an Airbnb guest, have you ever been rejected by hosts, and what do you think the reasons are? “I have never been rejected. Since hosting and traveling on Airbnb for over 5 years, I have accumulated over 150+ positive reviews and a comprehensive profile. There’s a badge on my profile that says Superhost. From the standpoint of a host, security and safety are absolutely #1 (for the guest and the for host). Reviews and recommendations are integral to verifying a person’s credibility on Airbnb. In my experience, if a guest does not have a complete profile, I remind them to complete their profiles and then reject them. It is required information on my listing and inquiring without one means the guest did not read my listing comprehensively.” Q4: Can you share your experience at the Airbnb Open 2014? “It was a great honor to be invited for the inaugural Airbnb Open in 2014 in San Francisco. It was an inspiring experience to be in the company of so many different people connected by Airbnb. There was a strong contingent from all over the world (many flew for just a couple days), but the majority were still hosts from California. The conference had interesting panels and workshops run by hosts and VIPs that provided tips, best practices, and some inspiration to hosting. Airbnb Open is open to all hosts and will be held in Los Angeles this November 2016 with even more speakers than before.” To learn more about Natasia Guo and Yetang.com, please visit forbes.com. If you’re ever visiting Beijing, China and need a place to stay, don’t hesitate to look up her place on Airbnb. Persona #4 (potential guest) Young professionals, never heard of Airbnb, rent a place to liveThey have never heard of Airbnb, and never used the website. This group of users go to 3rd party travel platforms such as Ctrip and Yilong to book hotels. They don’t own a house or apartment, making it difficult to become an Airbnb host. Even after learning about Airbnb, they don’t seem to trust strangers whom they might rent out the house/rooms to. However, they are willing to try out Airbnb when travel outside of China. If you’re interested in industrial design, check out Ivan’s website with many great sketch resource at www.designsketchskill.com, and its weibo. Persona #5 (potential guest) Young professionals with a family, own a house/apartmentSimilar to persona #5, they have never heard of Airbnb and never used its website. However, they own a house/apartment and have the flexibility to rent it out. After learning about Airbnb, they seem to be willing to become an Airbnb host with strict requirements on the guests; they are also willing to use Airbnb when they travel with families. Research Key Findings Image from nga.org Website User Interface If you are in China and visit Airbnb’s website, you’ll be directed to its Chinese version (you still have the option to change the language back to English). When you search for homes in Beijing for instance, you will find that the user interface is nearly the same as the English site. Airbnb Chinese version home page What I learned is that the homepage does not recommend any local Chinese cities for weekend destinations. I had friends in different cities in China visit Airbnb, and they all saw suggestions for Japan, Thailand or Korea. For the screenshot below, I specifically asked friends to switch the language back to English to show this finding. weekend destination suggestion while in China I’m not sure what Airbnb’s business strategies are for the Chinese market, but it certainly confuses me that Airbnb doesn’t give any local city recommendations. It leads me to wonder whether they are not encouraging Chinese users to use Airbnb for domestic stays. The only reason I can think of is that they are currently focusing on outbound trips. Login Methods In the US, Airbnb users can login via Facebook. What about in China? You won’t be able to login with Facebook as it is banned. Instead, WeChat and Weibo (the largest social media platforms in China) are the primary login methods. Login page screenshot Very handy login tool built within WeChat WeChat provides an extremely convenient yet secure way to login on desktop by using its build-in scanning barcode feature — open your WeChat app and scan the barcode, you’ll be able to login once you confirm the authorization. Check out why QR code is important and does so well in China, written by Yibo Dai. Airbnb Stories Airbnb stories are consistently used across countries. You can find stories from Airbnb Chinese users, which encourages non-Airbnb users to join and become one of the story tellers. Localization Airbnb clearly did their homework on localization. On the bottom of home page, the 3 columns grabbed my attention: Payment page screenshot Competitors The majority of Airbnb competitors are nicely summarized by this business insider article. There are multiple local imitators in China that are currently the strongest challengers to Airbnb in China. Xiaozhu.com, which went online in 2012, is Airbnb’s truest imitator and the player most similar to Airbnb in China. If you take a look at the UI on Xiaozhu.com, it very much just looks like Airbnb, though it distinct from Airbnb on commission fee — it’s included within the offer price. Aside from Xiaozhu.com, Tujia is another player that is hard to ignore. Tujia, a provider of vacation accommodation booking services that borrows from the business models of both Airbnb and HomeAway. Fast growth and capital flowing in mean that the short-term rental market is approaching maturity. For Airbnb this is a double-edged sword. Thoughts This user research helps me understand how the Airbnb users in the mainland Chinese market live their lives, and what restrictions they have before they become hosts or guests or both. The thing with research is the more you put in, the more you get out of it. I’m in a situation where I don’t have a budget or enormous amount of time to do both quantitative and qualitative research, so I focused on qualitative research in small samples. Putting a little bit of effort into talking to the right users has helped me identify and prove my assumptions, and recognize their needs and mental models. It really does require time and planning, especially when I had to do it remotely. I’m sure that Airbnb teams have done more than enough research on their users and that they might have already found a huge amount of information that can be applied directly to the product. This is a fun side project for me to do outside of work, it didn’t just help me stretch my interests in user research, it also pushed me to learn deeper. If you like this research study, please kindly tap the ❤ button below! :) Sign up for our weekly newsletterUX-related links (like this one) every week in your inboxuxdesign.us5.list-manage1.com ", "title": "User research: Airbnb for the Chinese market", "sentences": [{"a57f": "User research: Airbnb for the Chinese market"}, {"f3cf": "Photo illustration by Lisa Larson-Walker. Photo by Sean Pavone/Shutterstock."}, {"c408": "I talked about how design helps Airbnb’s cross-culture business in my last article. As a Chinese person living in the US, I thought it would be interesting to go further and study the Airbnb users in the Chinese market."}, {"b8c2": "“At Airbnb, our mission is to help create a world where anyone can belong anywhere, and with nearly 1.5 billion people living in China, it’s clear that this country is an important part of our global community.” — Airbnb"}, {"fae5": "According to the Airbnb blog, “China is one of the biggest and fastest growing outbound travel markets in the world. In just the past year alone, outbound travel from Chinese guests through Airbnb has grown 700%, making it our fastest growing outbound market. Last year in 2015, Airbnb brought on two strategic partners — China Broadband Capital (CBC) and Sequoia China — to help them continue to navigate the China market and create a truly localized presence for the company.”"}, {"4999": "Market Research"}, {"9718": "Due to culture differences, it’s not easy for the majority of Chinese people to accept the concept of accommodation-sharing. China’s culture of guanxi (networks of acquaintances) very much relies on human relationships. Trust and security issues have been the biggest obstacle to the sharing economy in China."}, {"2b9c": "Because of land ownership restrictions in China, most people do not have vacant rooms or houses available to rent. Most Chinese do not live in single-family homes as in the US; instead, they live in apartment complexes that severely restrict their ability to sub-lease."}, {"930c": "What does the short-term rental market look like in China? 1. High demand in the first and second tier citiesIn addition to attracting international tourists, vibrant economies in first-tier cities like Beijing, Shanghai and Shenzhen attract many domestic visitors. These visitors from throughout China seek better jobs, better education, and better medical care. While they stay in these top-tier cities, they need short and medium-term housing.2. Good demand in lower tier touristy citiesA good example would be Sanya (China’s Hawaii) or Chengdu (where the pandas are). The market is heating up because of its well-known landmarks and a lower cost of living makes it more affordable when traveling.3. The market in the rest China, the third-tier cities and the rural areas without any tourism, is a bit bleak."}, {"a39e": "User Personas"}, {"30d4": "When expanding a business into a different country, it’s important to understand how users differ, what their goals are, what their needs are, and how they think and feel. In order to create a realistic representation of Airbnb’s Chinese user segment, I conducted user research on some friends living in China. Below I summarize the 5 personas I created based on this research."}, {"d94c": "Persona #1 (guest)"}, {"bfaa": "Unmarried young generation, live with the parents They have experiences studying abroad and have a more western mindset, enabling them to easily adopt the Airbnb concept. They would love to become an Airbnb host in their local cities, but the reality of not actually owning a house or an apartment has made it extremely difficult, especially when their parents are reluctant to let strangers live in the house. On the bright side, they enjoy traveling and often use Airbnb instead of hotels."}, {"7519": "Persona #2 (host and guest)"}, {"a516": "Westernized, own a house/apartment They have a stable job with good income and are able to afford a house or an apartment in a first or second tier city in China. They have a western mindset and are willing to rent out their own house/apartment to strangers. They are both Airbnb hosts in their local cities, and Airbnb guests when they travel."}, {"13d8": "Persona #3 (host and guest)"}, {"a9fd": "American born Chinese, foreigners, rent a house/apartment They are not native Chinese but love Chinese culture, they live and work in China. They are very fond of the Airbnb concept, absolutely willing to rent out the house or rooms to strangers. They also enjoy the experience of staying at Airbnb homes when they travel. Similar to persona #2, they are both Airbnb hosts and guests."}, {"4bb1": "Natasia Guo is one of the early Airbnb hosts in China since 2011. With her experience using Airbnb as both a host and guest, I interviewed her with a few questions through email where she shared some great insights about Airbnb."}, {"9399": "Q1: Why are you a host of Airbnb?"}, {"d3b7": "“Airbnb is a great way to meet likeminded people while making some cash. In 2011, I became a host on Airbnb to help fund/feed my life as a scrappy entrepreneur. Through the years, it has continued to be a meaningful experience to connect with likeminded people from around the world.”"}, {"18b4": "Q2: Who are your guests? Are they local Chinese, foreigners or both?"}, {"33c0": "“When I first started Airbnb-ing, the guests were almost 100% foreigners from mainly the US and Europe, with the majority having some connection with the tech industry. Over the years as Airbnb set up operations and efforts in the region, the ratio has changed to about 50% domestic Chinese and 50% foreigners. The domestic Chinese almost always are students on holiday from studying abroad in the US, Australia or Europe.”"}, {"9ff8": "Q3: As an Airbnb guest, have you ever been rejected by hosts, and what do you think the reasons are?"}, {"b3a7": "“I have never been rejected. Since hosting and traveling on Airbnb for over 5 years, I have accumulated over 150+ positive reviews and a comprehensive profile. There’s a badge on my profile that says Superhost. From the standpoint of a host, security and safety are absolutely #1 (for the guest and the for host). Reviews and recommendations are integral to verifying a person’s credibility on Airbnb. In my experience, if a guest does not have a complete profile, I remind them to complete their profiles and then reject them. It is required information on my listing and inquiring without one means the guest did not read my listing comprehensively.”"}, {"afea": "Q4: Can you share your experience at the Airbnb Open 2014?"}, {"f37c": "“It was a great honor to be invited for the inaugural Airbnb Open in 2014 in San Francisco. It was an inspiring experience to be in the company of so many different people connected by Airbnb. There was a strong contingent from all over the world (many flew for just a couple days), but the majority were still hosts from California. The conference had interesting panels and workshops run by hosts and VIPs that provided tips, best practices, and some inspiration to hosting. Airbnb Open is open to all hosts and will be held in Los Angeles this November 2016 with even more speakers than before.”"}, {"6b67": "To learn more about Natasia Guo and Yetang.com, please visit forbes.com. If you’re ever visiting Beijing, China and need a place to stay, don’t hesitate to look up her place on Airbnb."}, {"d6a9": "Persona #4 (potential guest)"}, {"7b2d": "Young professionals, never heard of Airbnb, rent a place to liveThey have never heard of Airbnb, and never used the website. This group of users go to 3rd party travel platforms such as Ctrip and Yilong to book hotels. They don’t own a house or apartment, making it difficult to become an Airbnb host. Even after learning about Airbnb, they don’t seem to trust strangers whom they might rent out the house/rooms to. However, they are willing to try out Airbnb when travel outside of China."}, {"197e": "If you’re interested in industrial design, check out Ivan’s website with many great sketch resource at www.designsketchskill.com, and its weibo."}, {"6284": "Persona #5 (potential guest)"}, {"3284": "Young professionals with a family, own a house/apartmentSimilar to persona #5, they have never heard of Airbnb and never used its website. However, they own a house/apartment and have the flexibility to rent it out. After learning about Airbnb, they seem to be willing to become an Airbnb host with strict requirements on the guests; they are also willing to use Airbnb when they travel with families."}, {"0278": "Research Key Findings"}, {"6f0b": "Image from nga.org"}, {"623b": "Website User Interface"}, {"f4d1": "If you are in China and visit Airbnb’s website, you’ll be directed to its Chinese version (you still have the option to change the language back to English). When you search for homes in Beijing for instance, you will find that the user interface is nearly the same as the English site."}, {"6839": "Airbnb Chinese version home page"}, {"a88d": "What I learned is that the homepage does not recommend any local Chinese cities for weekend destinations. I had friends in different cities in China visit Airbnb, and they all saw suggestions for Japan, Thailand or Korea. For the screenshot below, I specifically asked friends to switch the language back to English to show this finding."}, {"3156": "weekend destination suggestion while in China"}, {"7f4b": "I’m not sure what Airbnb’s business strategies are for the Chinese market, but it certainly confuses me that Airbnb doesn’t give any local city recommendations. It leads me to wonder whether they are not encouraging Chinese users to use Airbnb for domestic stays. The only reason I can think of is that they are currently focusing on outbound trips."}, {"3e5e": "Login Methods"}, {"533e": "In the US, Airbnb users can login via Facebook. What about in China? You won’t be able to login with Facebook as it is banned. Instead, WeChat and Weibo (the largest social media platforms in China) are the primary login methods."}, {"5cbc": "Login page screenshot"}, {"50a2": "Very handy login tool built within WeChat"}, {"5b7a": "WeChat provides an extremely convenient yet secure way to login on desktop by using its build-in scanning barcode feature — open your WeChat app and scan the barcode, you’ll be able to login once you confirm the authorization. Check out why QR code is important and does so well in China, written by Yibo Dai."}, {"789c": "Airbnb Stories"}, {"8773": "Airbnb stories are consistently used across countries. You can find stories from Airbnb Chinese users, which encourages non-Airbnb users to join and become one of the story tellers."}, {"ae73": "Localization"}, {"ed59": "Airbnb clearly did their homework on localization. On the bottom of home page, the 3 columns grabbed my attention:"}, {"3a91": "Payment page screenshot"}, {"8985": "Competitors"}, {"4dba": "The majority of Airbnb competitors are nicely summarized by this business insider article."}, {"a5ad": "There are multiple local imitators in China that are currently the strongest challengers to Airbnb in China. Xiaozhu.com, which went online in 2012, is Airbnb’s truest imitator and the player most similar to Airbnb in China."}, {"7c94": "If you take a look at the UI on Xiaozhu.com, it very much just looks like Airbnb, though it distinct from Airbnb on commission fee — it’s included within the offer price."}, {"4775": "Aside from Xiaozhu.com, Tujia is another player that is hard to ignore. Tujia, a provider of vacation accommodation booking services that borrows from the business models of both Airbnb and HomeAway. Fast growth and capital flowing in mean that the short-term rental market is approaching maturity. For Airbnb this is a double-edged sword."}, {"7073": "Thoughts"}, {"b687": "This user research helps me understand how the Airbnb users in the mainland Chinese market live their lives, and what restrictions they have before they become hosts or guests or both. The thing with research is the more you put in, the more you get out of it. I’m in a situation where I don’t have a budget or enormous amount of time to do both quantitative and qualitative research, so I focused on qualitative research in small samples. Putting a little bit of effort into talking to the right users has helped me identify and prove my assumptions, and recognize their needs and mental models. It really does require time and planning, especially when I had to do it remotely."}, {"fe37": "I’m sure that Airbnb teams have done more than enough research on their users and that they might have already found a huge amount of information that can be applied directly to the product. This is a fun side project for me to do outside of work, it didn’t just help me stretch my interests in user research, it also pushed me to learn deeper."}, {"5910": "If you like this research study, please kindly tap the ❤ button below! :)"}, {"c5fe": "Sign up for our weekly newsletterUX-related links (like this one) every week in your inboxuxdesign.us5.list-manage1.com"}], "child": "726_1\t726_2\t726_3\t726_4\t726_5\t726_6\t726_7726_1\t726_2\t726_3\t726_4\t726_5\t726_6\t726_7726_1\t726_2\t726_3\t726_4\t726_5\t726_6\t726_7726_1\t726_2\t726_3\t726_4\t726_5\t726_6\t726_7726_1\t726_2\t726_3\t726_4\t726_5\t726_6\t726_7"}