{"name": "728", "parent": "", "content": "I designed the single-border feature for Sketch I started using Sketch two years ago when one of my professors introduced the new software to our class. Since then, I spent more than eight hours a day working with Sketch, and I can only describe myself as a power user. Sketch improves version after version, making designing easier and faster. But there is one feature that I started looking for right from the beginning and that I am still looking for: the one side border. Me adding a border to one side of a rectangle Is it just me? While trying to understand how to set a border on one side of a shape, I felt stupid and when I feel stupid I search on Google. So I found two things: that it’s not possible to add a border to a single side, and that I was not alone. Back in 2013 Diógenes Brito tweeted this question to Sketch: It didn’t take them long to answer: After two long years of silence on this question, Daniel Schwartz asked to Sketch the same question: … and nope, nothing changed in two years: When Ruben Nine asked this: Sketch seemed to leave the door open to adding this feature in the near future: And Sketch, you know what, it was time in 2016, and it’s definitely time now that it’s 2017! Shadows and their dark side There actually is a way to work around the problem: inner shadows. To explain how it works I made a video: I found that many designers are using this trick, the fastest way to avoid the missing one side border feature. But there are some problems with this approach that are hard to ignore: CSS on Zeplin 2. When you create two borders with a common corner, one of them will show as being on top of the other: Corners with inner shadows on Sketch While with CSS you get this kind of corner: Corners with borders with CSS When I need to add a single side border, I use this trick because it gets the job done and it gets it done quick. But it would be amazing to have a specific feature to handle every different border of a shape. How I split borders on Sketch My mission as a designer is to make life easier for people and that’s why I designed a new borders panel for Sketch allowing users to manage borders in whichever way they prefer the most. “normal” borders panel In my experience, it is difficult to handle normal and split borders at the same time, so with this solution you can switch from a state to the other using the toggle in the top-right corner. By default the toggle is set to “normal”, which is the way things are handled on Sketch nowadays. “split” borders panel Switching state from “normal” to “split” takes you to a brand new panel with four layers, one for each side of the shape (top, right, bottom and left). Here, every side is independent from the others. Corners are now handled like through CSS, and when exporting the code, it will reflect this design. With this new borders feature, you can create outstanding fake 3D shapes that work great. TL;DR What do you think of this project? Which other feature you would like to see on Sketch? You can also find this project on Dribbble ! If you liked this article feel free to comment and share! Daje!Davide Pisauri ", "title": "I designed the single-border feature for ", "sentences": [{"b484": "I designed the single-border feature for Sketch"}, {"8901": "I started using Sketch two years ago when one of my professors introduced the new software to our class. Since then, I spent more than eight hours a day working with Sketch, and I can only describe myself as a power user."}, {"9f7a": "Sketch improves version after version, making designing easier and faster. But there is one feature that I started looking for right from the beginning and that I am still looking for: the one side border."}, {"2e44": "Me adding a border to one side of a rectangle"}, {"6755": "Is it just me?"}, {"021f": "While trying to understand how to set a border on one side of a shape, I felt stupid and when I feel stupid I search on Google."}, {"7717": "So I found two things: that it’s not possible to add a border to a single side, and that I was not alone."}, {"46b5": "Back in 2013 Diógenes Brito tweeted this question to Sketch:"}, {"62bd": "It didn’t take them long to answer:"}, {"75a6": "After two long years of silence on this question, Daniel Schwartz asked to Sketch the same question:"}, {"46c2": "… and nope, nothing changed in two years:"}, {"cd72": "When Ruben Nine asked this:"}, {"ba0a": "Sketch seemed to leave the door open to adding this feature in the near future:"}, {"358b": "And Sketch, you know what, it was time in 2016, and it’s definitely time now that it’s 2017!"}, {"d173": "Shadows and their dark side"}, {"4e03": "There actually is a way to work around the problem: inner shadows."}, {"c09a": "To explain how it works I made a video:"}, {"a6fb": "I found that many designers are using this trick, the fastest way to avoid the missing one side border feature. But there are some problems with this approach that are hard to ignore:"}, {"495e": "CSS on Zeplin"}, {"ac85": "2. When you create two borders with a common corner, one of them will show as being on top of the other:"}, {"6482": "Corners with inner shadows on Sketch"}, {"29c3": "While with CSS you get this kind of corner:"}, {"5935": "Corners with borders with CSS"}, {"4b55": "When I need to add a single side border, I use this trick because it gets the job done and it gets it done quick. But it would be amazing to have a specific feature to handle every different border of a shape."}, {"5c21": "How I split borders on Sketch"}, {"32ca": "My mission as a designer is to make life easier for people and that’s why I designed a new borders panel for Sketch allowing users to manage borders in whichever way they prefer the most."}, {"9092": "“normal” borders panel"}, {"3985": "In my experience, it is difficult to handle normal and split borders at the same time, so with this solution you can switch from a state to the other using the toggle in the top-right corner."}, {"559c": "By default the toggle is set to “normal”, which is the way things are handled on Sketch nowadays."}, {"7547": "“split” borders panel"}, {"8cb8": "Switching state from “normal” to “split” takes you to a brand new panel with four layers, one for each side of the shape (top, right, bottom and left)."}, {"45b8": "Here, every side is independent from the others."}, {"39f8": "Corners are now handled like through CSS, and when exporting the code, it will reflect this design."}, {"ebab": "With this new borders feature, you can create outstanding fake 3D shapes that work great."}, {"c1a6": "TL;DR"}, {"3171": "What do you think of this project? Which other feature you would like to see on Sketch?"}, {"15e8": "You can also find this project on Dribbble !"}, {"9fda": "If you liked this article feel free to comment and share!"}, {"7900": "Daje!Davide Pisauri"}], "child": "728_1\t728_2\t728_3\t728_4\t728_5\t728_6\t728_7\t728_8\t728_9\t728_10\t728_11\t728_12\t728_13\t728_14\t728_15\t728_16\t728_17\t728_18\t728_19\t728_20\t728_21\t728_22\t728_23\t728_24728_1\t728_2\t728_3\t728_4\t728_5\t728_6\t728_7\t728_8\t728_9\t728_10\t728_11\t728_12\t728_13\t728_14\t728_15\t728_16\t728_17\t728_18\t728_19\t728_20\t728_21\t728_22\t728_23\t728_24"}