{"name": "73", "parent": "", "content": "LeBron James Killed the Dinosaurs And we’re not just talking about Phil Jackson Welcome to King of the Court, our daily celebration of the best players in basketball from the night that was. We’ll be keeping track of the best player of every night of the NBA season, and tallying the results as we go along. King of the Court: LeBron James On Tuesday, LeBron James fended off the past and the present. Prior to the night’s stress test with the Raptors (Cleveland’s toughest Eastern Conference competition this season), the Cavs star addressed an interview Phil Jackson gave to ESPN’s Jackie MacMullan, in which the Knicks president gossiped a bit about James’s departure from Miami and issues Pat Riley may have had with him: “When LeBron was playing with the Heat, they went to Cleveland, and he wanted to spend the night. They don’t do overnights. … You can’t hold up the whole team because you and your mom and your posse want to spend an extra night in Cleveland.” James specifically objected to the use of the word posse: “If you go and read the definition of what the word posse is, it’s not what I’ve built over my career. … It’s not what I stand for, it’s not what my family stands for. I believe the only reason he used that word is because he sees young African Americans trying to make a difference.” The posse comment wasn’t the only stupid, candid, or strange thing Jackson said to MacMullan. He opined on how Mike Conley Jr. was New York’s main offseason free-agent target (why mention it now?), how Conley’s contract is “almost insane” (it’s not your money?), his feelings about running the triangle (“[W]hen they run it I want them to run it the right way”), his ambivalence about running the triangle (“I don’t care about the triangle”) (STOP TALKING ABOUT THE TRIANGLE), Carmelo Anthony’s need for attention (“I was never the guy who said, ‘Let’s go out to dinner.’ But with Melo, I do that”), and how he satisfies Melo’s needs with stories about Snoop Dogg. But the “posse” jibe stuck because it was tone-deaf, condescending, and — even if it was part of some mind game — nasty. The paternalistic reading lists and Zen Buddhism don’t play the way they used to. Maybe it was always bullshit and we just got better detectors. There is a certain mysticism we ascribe to Jackson’s teachings, and that can sometimes obscure the lengths he will go to in order to publicly manipulate people or denigrate their achievements. “I’m not going to be that guy that ever downplays somebody or tries to knock someone off just [to] feel better about myself,” said James. This is true. He will just take on the next poor opponents and throw them down a well. You don’t want to see LeBron James motivated. LeBron’s line in Cleveland’s 121–117 victory was 28 points, 14 assists, and nine boards, which is right around the 23.4 points, 9.6 assists, and 8.9 boards per game averages that he has put up in this ruthlessly efficient season. On Tuesday, he played and guarded every position. He did stuff like this in the post: And stuff like this, while running the offense: Because of the various dramas surrounding his career — those written by him or by others — James’s heroism and “villainy” (remember when LeBron James was considered a villain in this country?) has sometimes overshadowed his unprecedented consistency. He is nearly averaging a triple-double this season. We paint murals for Russell Westbrook over similar achievements. LeBron? We take him for granted. The Cavaliers are defending champions — a fact I don’t think we talk about enough — and have tied their franchise-best start, at 9–1. He is doing what he does best: lifting other people up. Cleveland had championship swagger against Toronto on Tuesday night. The Raptors came into the game with a 7–2 record, the NBA scoring leader (DeMar DeRozan), the third-best offense in the league, and some scattered chatter that they were ready to make the leap and challenge Cleveland for Eastern Conference supremacy. And none of that changes. Their offense was diverse, DeRozan scored 26, they competed to the very end of the game, and Cleveland still runs this shit. The Cavs look better right now than they did in June. Ty Lue is wearing his Brad Stevens out-of-timeout-wizard hat well (ESPN’s Dave McMenamin referred to Lue as “A-Ty-O”), Richard Jefferson doesn’t look a day older than 30, Kyrie Irving is playing with “I won the NBA Finals” swagger, and Kevin Love looks like an All-Star. They are playing like their leader: consistent and ruthless. “I get a thrill out of bringing a group together and helping them reach a place they didn’t know they could go,” James told Lee Jenkins when he returned to Cleveland. We can see that almost every night. It’s a shame Phil Jackson can’t. Runner-up: Frank Kaminsky Are we sure Frank Kaminsky wasn’t playing H-O-R-S-E with a ghost on Tuesday? In Charlotte’s 115–108 victory over Minnesota, the second-year big man was letting off Steve Nash runners and pulling up from Steph Curry’s zip code. The Tank scored 20 points, 12 of which came in the fourth quarter. I am going to need a period of decompression after seeing this. ", "title": "LeBron James Killed the Dinosaurs", "sentences": [{"4c34": "LeBron James Killed the Dinosaurs"}, {"709f": "And we’re not just talking about Phil Jackson"}, {"bb13": "Welcome to King of the Court, our daily celebration of the best players in basketball from the night that was. We’ll be keeping track of the best player of every night of the NBA season, and tallying the results as we go along."}, {"9b02": "King of the Court: LeBron James"}, {"f4ac": "On Tuesday, LeBron James fended off the past and the present. Prior to the night’s stress test with the Raptors (Cleveland’s toughest Eastern Conference competition this season), the Cavs star addressed an interview Phil Jackson gave to ESPN’s Jackie MacMullan, in which the Knicks president gossiped a bit about James’s departure from Miami and issues Pat Riley may have had with him: “When LeBron was playing with the Heat, they went to Cleveland, and he wanted to spend the night. They don’t do overnights. … You can’t hold up the whole team because you and your mom and your posse want to spend an extra night in Cleveland.”"}, {"beb3": "James specifically objected to the use of the word posse: “If you go and read the definition of what the word posse is, it’s not what I’ve built over my career. … It’s not what I stand for, it’s not what my family stands for. I believe the only reason he used that word is because he sees young African Americans trying to make a difference.”"}, {"5c14": "The posse comment wasn’t the only stupid, candid, or strange thing Jackson said to MacMullan. He opined on how Mike Conley Jr. was New York’s main offseason free-agent target (why mention it now?), how Conley’s contract is “almost insane” (it’s not your money?), his feelings about running the triangle (“[W]hen they run it I want them to run it the right way”), his ambivalence about running the triangle (“I don’t care about the triangle”) (STOP TALKING ABOUT THE TRIANGLE), Carmelo Anthony’s need for attention (“I was never the guy who said, ‘Let’s go out to dinner.’ But with Melo, I do that”), and how he satisfies Melo’s needs with stories about Snoop Dogg."}, {"6079": "But the “posse” jibe stuck because it was tone-deaf, condescending, and — even if it was part of some mind game — nasty. The paternalistic reading lists and Zen Buddhism don’t play the way they used to. Maybe it was always bullshit and we just got better detectors. There is a certain mysticism we ascribe to Jackson’s teachings, and that can sometimes obscure the lengths he will go to in order to publicly manipulate people or denigrate their achievements."}, {"fb5a": "“I’m not going to be that guy that ever downplays somebody or tries to knock someone off just [to] feel better about myself,” said James. This is true. He will just take on the next poor opponents and throw them down a well."}, {"1304": "You don’t want to see LeBron James motivated. LeBron’s line in Cleveland’s 121–117 victory was 28 points, 14 assists, and nine boards, which is right around the 23.4 points, 9.6 assists, and 8.9 boards per game averages that he has put up in this ruthlessly efficient season. On Tuesday, he played and guarded every position. He did stuff like this in the post:"}, {"0e03": "And stuff like this, while running the offense:"}, {"0675": "Because of the various dramas surrounding his career — those written by him or by others — James’s heroism and “villainy” (remember when LeBron James was considered a villain in this country?) has sometimes overshadowed his unprecedented consistency. He is nearly averaging a triple-double this season. We paint murals for Russell Westbrook over similar achievements. LeBron? We take him for granted. The Cavaliers are defending champions — a fact I don’t think we talk about enough — and have tied their franchise-best start, at 9–1. He is doing what he does best: lifting other people up."}, {"10b4": "Cleveland had championship swagger against Toronto on Tuesday night. The Raptors came into the game with a 7–2 record, the NBA scoring leader (DeMar DeRozan), the third-best offense in the league, and some scattered chatter that they were ready to make the leap and challenge Cleveland for Eastern Conference supremacy. And none of that changes. Their offense was diverse, DeRozan scored 26, they competed to the very end of the game, and Cleveland still runs this shit."}, {"687b": "The Cavs look better right now than they did in June. Ty Lue is wearing his Brad Stevens out-of-timeout-wizard hat well (ESPN’s Dave McMenamin referred to Lue as “A-Ty-O”), Richard Jefferson doesn’t look a day older than 30, Kyrie Irving is playing with “I won the NBA Finals” swagger, and Kevin Love looks like an All-Star. They are playing like their leader: consistent and ruthless."}, {"be02": "“I get a thrill out of bringing a group together and helping them reach a place they didn’t know they could go,” James told Lee Jenkins when he returned to Cleveland. We can see that almost every night. It’s a shame Phil Jackson can’t."}, {"4f12": "Runner-up: Frank Kaminsky"}, {"f2d4": "Are we sure Frank Kaminsky wasn’t playing H-O-R-S-E with a ghost on Tuesday? In Charlotte’s 115–108 victory over Minnesota, the second-year big man was letting off Steve Nash runners and pulling up from Steph Curry’s zip code. The Tank scored 20 points, 12 of which came in the fourth quarter. I am going to need a period of decompression after seeing this."}], "child": "73_1\t73_2\t73_3\t73_4\t73_5\t73_6\t73_7\t73_8\t73_9\t73_10\t73_11\t73_12\t73_13\t73_14\t73_15\t73_16\t73_17\t73_18\t73_19\t73_20"}