{"name": "730", "parent": "", "content": "Why I HATE your FAKE redesign! I’m tired of seeing new and frankly stupid redesigns of Facebook, Skype, and Twitter pop up on my newsfeed. Why not make something useful? Stop supporting these redesigns with likes, re-posts, and articles at Muzli, Medium, Designer News, etc. You’re aiding and abetting this brainless work. These designers may start to think that they are true professionals, and that they know more about how popular services should look than their creators. Disclaimer: I don’t think that all redesigns have silly and unattractive UI, but I think that 99% of them do. If you read this article to the end, your redesign might just end up in the 1%. From my perspective, people do redesigns of popular services because they: UI/UX work is not just about creating a beautiful picture. It’s about addressing your clients’ needs by providing new experiences for users and inspiring them to take action. It’s vital to do your research, discuss ideas with product managers, understand business needs, and check your assumptions. Only after all of that can you begin drawing. Let me explain why lazy redesigns are not good PR for you, how to compile an impressive portfolio without doing silly work, and where to find real-world experience on projects that make the world a better place. Why redesigns are not good PR If you are at the beginning of your career and lack a portfolio, coming up with a Facebook redesign concept may seem tempting. But, more likely than not, you will make a lot of mistakes that professional UI designers will spot immediately. Just take a look at these redesigns: Google redesign For some reason, this designer decided to forget about branding and use a bold background color that looks pretty good but splits focus. They also moved the Account Settings to the left corner, when there is an established practice of placing it at the top right corner. Skype redesign This is a Skype concept from Muzli. Again, we see that the designer forgot about branding and made Skype look too similar to Viber. I have no idea why there is a bold, purple and pink left panel. With this design, users are encouraged to focus more on the list of conversations than on their current chat. The designer probably used these colors because they thought it looked cool. Stop it. Make it because it’s right, because it has meaning, because it will help users solve a problem, or because it will help sell your product. Don’t do it just because it looks cool! Facebook redesign Another Facebook concept. These guys made tons of work, but I can’t imagine Facebook implementing these changes anytime soon. Dark colors, grid view, Apple-style gradient button, and no ads? Really? But after you make it, you can post it on your website and trick potential clients into believing that you worked with Facebook or other big companies. It’s a very common trick. A great example of how can you suffer from this is the guys at http://flatstudio.co/. They created a redesign of the New York Times, started a special website for it, and posted it on Behance, Dribbble, and their own site. They probably wasted a few months on that work, but after just a few weeks, it was scrubbed from the internet. I guess someone at the New York Times sent them a warning. Now, you can only find their concept here. These guys are very tricky, because on their website you can find Google, Microsoft, and Tesla logos, and make the (incorrect) assumption that they really worked with these companies. In reality, they only have redesign concepts. If you decide to redesign a popular service anyway: Take a look at this woman’s approach: https://medium.freecodecamp.com/i-wanted-to-see-how-far-i-could-push-myself-creatively-so-i-redesigned-instagram-1ff99f28fa8b#.72jj409ck She did a lot of research and suggested really good UX improvements. She’s a great example of what you should do in a redesign. How do you make the world a better place and get real experience? Charitable foundations all over the world are trying to help people, but very often have terrible websites. I would guess that they’d love free design help, so offer your services! This is also a great way to improve your karma. :) http://www.nastenka.ru/ http://www.cancersurvivorsfund.org/ https://paradisecharity.org/ http://rachelfriends.org/previews/rachelplus-en/ Don’t like that approach? You can also pick the websites of famous attractions and offer to help them. They have a lot of visitors every day, but often don’t have great sites. http://www.galleriaborghese.it/en http://www.stage-entertainment.fr/theatre-mogador http://www.patrimonionacional.es/ Want to try designing for ecommerce sites? Let’s Google “flower delivery Paris” and pick a few poorly designed examples: http://www.parisfloristandgifts.com/ https://www.arenaflowers.com/international/france http://www.interflora.fr/ Don’t hesitate to message site owners or ask your friends, maybe they need your help. You will find a real project and get real experience. With this method, you will improve your communication skills, get valuable new contacts, and learn about analytics and client preferences firsthand. Tap the ❤ button if you found this article useful! Any questions or Feedback? Connect via Pixel Point ", "title": "Why I HATE your FAKE redesign!", "sentences": [{"4fb2": "Why I HATE your FAKE redesign!"}, {"ee79": "I’m tired of seeing new and frankly stupid redesigns of Facebook, Skype, and Twitter pop up on my newsfeed. Why not make something useful? Stop supporting these redesigns with likes, re-posts, and articles at Muzli, Medium, Designer News, etc. You’re aiding and abetting this brainless work. These designers may start to think that they are true professionals, and that they know more about how popular services should look than their creators."}, {"5a78": "Disclaimer: I don’t think that all redesigns have silly and unattractive UI, but I think that 99% of them do. If you read this article to the end, your redesign might just end up in the 1%."}, {"7c8c": "From my perspective, people do redesigns of popular services because they:"}, {"f01c": "UI/UX work is not just about creating a beautiful picture. It’s about addressing your clients’ needs by providing new experiences for users and inspiring them to take action. It’s vital to do your research, discuss ideas with product managers, understand business needs, and check your assumptions. Only after all of that can you begin drawing."}, {"ee28": "Let me explain why lazy redesigns are not good PR for you, how to compile an impressive portfolio without doing silly work, and where to find real-world experience on projects that make the world a better place."}, {"e2e3": "Why redesigns are not good PR"}, {"633f": "If you are at the beginning of your career and lack a portfolio, coming up with a Facebook redesign concept may seem tempting. But, more likely than not, you will make a lot of mistakes that professional UI designers will spot immediately. Just take a look at these redesigns:"}, {"309b": "Google redesign"}, {"b4ed": "For some reason, this designer decided to forget about branding and use a bold background color that looks pretty good but splits focus. They also moved the Account Settings to the left corner, when there is an established practice of placing it at the top right corner."}, {"4d60": "Skype redesign"}, {"f5a2": "This is a Skype concept from Muzli. Again, we see that the designer forgot about branding and made Skype look too similar to Viber. I have no idea why there is a bold, purple and pink left panel. With this design, users are encouraged to focus more on the list of conversations than on their current chat."}, {"59c6": "The designer probably used these colors because they thought it looked cool. Stop it. Make it because it’s right, because it has meaning, because it will help users solve a problem, or because it will help sell your product. Don’t do it just because it looks cool!"}, {"d664": "Facebook redesign"}, {"7d44": "Another Facebook concept. These guys made tons of work, but I can’t imagine Facebook implementing these changes anytime soon. Dark colors, grid view, Apple-style gradient button, and no ads? Really?"}, {"9f15": "But after you make it, you can post it on your website and trick potential clients into believing that you worked with Facebook or other big companies. It’s a very common trick."}, {"9e2c": "A great example of how can you suffer from this is the guys at http://flatstudio.co/. They created a redesign of the New York Times, started a special website for it, and posted it on Behance, Dribbble, and their own site. They probably wasted a few months on that work, but after just a few weeks, it was scrubbed from the internet. I guess someone at the New York Times sent them a warning. Now, you can only find their concept here."}, {"ea3b": "These guys are very tricky, because on their website you can find Google, Microsoft, and Tesla logos, and make the (incorrect) assumption that they really worked with these companies. In reality, they only have redesign concepts."}, {"ad85": "If you decide to redesign a popular service anyway:"}, {"a626": "Take a look at this woman’s approach: https://medium.freecodecamp.com/i-wanted-to-see-how-far-i-could-push-myself-creatively-so-i-redesigned-instagram-1ff99f28fa8b#.72jj409ck"}, {"7318": "She did a lot of research and suggested really good UX improvements. She’s a great example of what you should do in a redesign."}, {"3e9c": "How do you make the world a better place and get real experience?"}, {"ed64": "Charitable foundations all over the world are trying to help people, but very often have terrible websites. I would guess that they’d love free design help, so offer your services! This is also a great way to improve your karma. :)"}, {"feb5": "http://www.nastenka.ru/"}, {"0090": "http://www.cancersurvivorsfund.org/"}, {"d613": "https://paradisecharity.org/"}, {"adef": "http://rachelfriends.org/previews/rachelplus-en/"}, {"9bd8": "Don’t like that approach? You can also pick the websites of famous attractions and offer to help them. They have a lot of visitors every day, but often don’t have great sites."}, {"b9a9": "http://www.galleriaborghese.it/en"}, {"0f55": "http://www.stage-entertainment.fr/theatre-mogador"}, {"e975": "http://www.patrimonionacional.es/"}, {"7f57": "Want to try designing for ecommerce sites? Let’s Google “flower delivery Paris” and pick a few poorly designed examples:"}, {"d863": "http://www.parisfloristandgifts.com/"}, {"2965": "https://www.arenaflowers.com/international/france"}, {"4c25": "http://www.interflora.fr/"}, {"0976": "Don’t hesitate to message site owners or ask your friends, maybe they need your help. You will find a real project and get real experience. With this method, you will improve your communication skills, get valuable new contacts, and learn about analytics and client preferences firsthand."}, {"dbb0": "Tap the ❤ button if you found this article useful!"}, {"6364": "Any questions or Feedback? Connect via Pixel Point"}], "child": "730_1\t730_2\t730_3\t730_4\t730_5\t730_6\t730_7\t730_8\t730_9\t730_10\t730_11\t730_12\t730_13\t730_14\t730_15\t730_16\t730_17\t730_18\t730_19\t730_20\t730_21\t730_22\t730_23\t730_24\t730_25"}