{"name": "738", "parent": "", "content": "53 Tech Terms You Need to Know as a UX Designer Your A-Z list of tech terms in plain English When I started working as a Junior UX Designer, I was a fish out of water. My knowledge about technology was limited. In meetings I would keep hearing these words, but had no clue what they meant. I’d get back to my desk and google what I’d heard, hoping no one would spot me! Overtime, I found there were lots of people new in tech having the same issues. I decided to compile an A-Z list of tech words with explanations in plain English. “If you can’t explain it simply, you don’t understand it well enough” (Albert Einstein) A/B testing A/B testing is a when you test two different versions of online content with users to see which one they prefer. Agile Agile development is a technique for incremental software development. It is an umbrella term for several different types of methodologies. It focuses on keeping code simple, testing often, and delivering functional parts of the application as soon as they’re ready. Android Android is a mobile operating system developed by Google. It comes installed on a range of mobile phone and tablets. API This stands for Application Programming Interface. An API is how computers and web applications share information with each other. An example: an app finds the current weather in Sydney by sending a message to the weather.com API. The weather.com API then replies with a structured response. Automation Testing Automation Testing is when a QA uses an automation tool to do tests on a software application. Avatar 👨‍🎤 An avatar is the embodiment of a person or idea. In the computer world, an avatar refers to a character that represents an online user. Avatars are used in gaming and online communities. Back End (Development) The back end is the engine room of a website, software or IT system. Back end developers deal with with what powers the site and its core functionality. The front end is what you see and interact with. Backlog A backlog is a buildup of work that is due to be completed. The agile product backlog is a prioritised features list. Beacon Beacon technology allows mobile apps to understand their position on a micro-local scale. It can send relevant contextual content to users based on their location. It uses Bluetooth Technology. Branch (development branch) A development branch allows for parts of software to be developed in parallel. This is so that code they are writing and code that is completed can be kept seperate. Article with more detail Breadcrumb (navigation) This is a secondary type of navigation that reveals your location in a website or app. Breadcrumbs trace the path back to your original starting point. Smashing Magazine explains more Bug 🐜 A software bug is a problem causing a program to crash or produce an invalid output. Most bugs are due to human error. Cache A cache is a place to store something temporarily in a computing environment. For example, a username could be stored in your computers cache and is remembered the next time you login. Chatbot A chatbot is a service that you interact with via a chat interface. The end result is like to texting with a friend, except the friend is the computer. Chatbot article CMS CMS stands for Content Management System. It’s a computer application that creates and manages digital content. CRM Software CRM stands for Customer Relationship Management. It’s software that stores customer contact information (such as names, addresses etc). Salesforce explanation Commits Developers create commits. Jake Boxer gave a great explanation: “A commit is a snapshot of your files. Imagine you’re building a model airplane. Every time you reach a good stopping point, you pull out your camera and take a picture. Once the airplane is complete, you can go back through your photos, and see how it looked at various stages. Your software project is like the model airplane. Each photo you took of the model airplane is a commit. CSS CSS stands for Cascading Style Sheets. CSS describes how HTML elements are to be displayed on screen. HTML is the structure, CSS is the style and Javascript is the behaviour. Dev Ops Dev Ops focuses on fast technology delivery through the use of agile development. Dev Ops focuses on people and culture. It seeks to improve collaboration between operations and development teams. Data Science This is the art of uncovering trends and insights within data. With these insights a business can explore ideas and make strategic choices. Emoticons This is a typographic display of a facial representation used to convey emotion :-) Front End (development) A front-end developer creates the visual front end of an app or website. They create features that are viewable by the user. Github GitHub is a web-based service used by developers. It is a way of using a central hub to work on collaborative coding projects. Blog Post by Red Badger GIF GIF stands for Graphics Interchange Format. A GIF is a never ending loop of images or video clips. Hack A hack is a quick solution that solves a problem, but not particularly well, or in a particularly good way. Hack Day/Hackathon This is when the digital team take a day or more out, to come up with innovative ideas. The aim of a hack day is to encourage creativity to get people to think outside the box. HTML HTML stands for Hypertext Markup Language. HTML is the set of markup codes inserted in a file intended for display on a the web. The markup tells the Web browser how to display a Web page’s words and images for the user. HTML is the structure (the words), CSS is the style and Javascript is the behaviour. Hybrid App A hybrid app is one that combines elements of both native and web applications. IP Address Internet Protocol Address is a unique address that identifies a device on the internet or local network. iOS 📱 This is a mobile operating system created and developed by Apple. It is the operating system that powers the iPhone, iPad, and iPod’s. Iteration / Iterative Development Iterative development is a way of breaking down software development into smaller pieces. An iteration in the context of agile development is as set period of time (usually between 1–4 weeks). Image from www.rafaecheve.com Javascript JavaScript is a programming language used to make web pages interactive. HTML is the structure, CSS is the style and Javascript is the behaviour. Mobile Web The mobile web refers to accessing the internet from smartphones. Modem A modem is a device that enables a computer to transfer data over telephone or cable lines. MVP MVP means Minimal Viable Product. It’s a way of developing a new product (e.g. a website) with acceptable features to suit the users. More features are only developed after considering feedback from the initial users. NFC NFC means Near Field Communication. It’s a way of transferring data wirelessly to a mobile device from another device. Tap and pay services like Apple pay work this way. Open Source Open source software is software that is available to anyone. Pairing / Pair Programming 👫 Pair programming is when two programmers work together. One writes code, while the other reviews it. The two programmers often switch roles. Pull Requests (PR) This lets developers tell others about code changes they’ve pushed to GitHub. Refactoring / Code Refactoring This is the process of tidying up existing code without changing how it works. For example to improve code readability or to simplify the code structure. Responsive (Website) Responsive design allows your website to adapt to the device your users are viewing it on. Retro / Retrospective A retro in software development is when the team looks back on an iteration to improve the process for the next iteration. SAAS Software as a Service is a way to deliver applications over the internet. Instead of installing and maintaining software, you access it via the internet. This frees you from complex software and hardware management. Scrum (Software Development) Scrum is an iterative agile software development framework for managing product development. SDK This stands for Software Development Kit. An SDK is software used for developing apps for a specific device or operating system. SEO This stands for search engine optimisation. It’s the process of getting people to your website from search engines. Slack This is a team collaboration tool that allows teams to communicate. It is effectively an internal online messaging service. Sprints 🏃 In agile software development a sprint is a set period of time which set work has to be completed. A sprint can last between 1–3 weeks depending on the business. A sprint is normally scrum specific. Image from Think Interactive Spike A spike is development work that cannot be estimated until a development team runs a trial. The result of a spike is an estimate of the time it will take to do the work. Tech Debt An example of technical debt: You have a piece of functionality that you need to add to your system. You see two ways to do it, one is quick to do but messy. It’ll make further changes harder in the future. The other results in a cleaner design, but will take longer to put in place. (example from Agile Web Operations). Tech Debt is the extra time it will take to do the better option, having done the messy option. Unit Testing Unit testing is where parts of an application are tested to find out if they are good to use. Unit testing can be done manually but is often automated. VPN Virtual Private Network. A VPN allows you to create a secure connection to another network over the Internet. Waterfall In software development the Waterfall Model is when each phase must be completed before the next phase can begin. Unlike agile which is a technique for incremental software development. “There is no greater impediment to the advancement of knowledge than the ambiguity of words” Thomas Reid Bookmark this A-Z ☆ and use it as a reference. If you have any words you think should be added to the list then please message me below. The list will be iterated on, so please let me know additions or anything you think I have wrong. If you enjoyed this, have a read of my article on getting into UX Design at 40 with no digital or design experience Thanks to Nick, Julio and Alana for their feedback. Thanks to Techopedia & Wikipedia for parts of my research. → If you found it useful, please click the 💚️ below to help others find it and leave a comment, thanks! 👍 ", "title": "53 Tech Terms You Need to Know as a UX Designer", "sentences": [{"7515": "53 Tech Terms You Need to Know as a UX Designer"}, {"177f": "Your A-Z list of tech terms in plain English"}, {"3f3c": "When I started working as a Junior UX Designer, I was a fish out of water. My knowledge about technology was limited. In meetings I would keep hearing these words, but had no clue what they meant. I’d get back to my desk and google what I’d heard, hoping no one would spot me!"}, {"766d": "Overtime, I found there were lots of people new in tech having the same issues. I decided to compile an A-Z list of tech words with explanations in plain English."}, {"f337": "“If you can’t explain it simply, you don’t understand it well enough” (Albert Einstein)"}, {"b883": "A/B testing"}, {"482d": "A/B testing is a when you test two different versions of online content with users to see which one they prefer."}, {"ce42": "Agile"}, {"955e": "Agile development is a technique for incremental software development. It is an umbrella term for several different types of methodologies. It focuses on keeping code simple, testing often, and delivering functional parts of the application as soon as they’re ready."}, {"aab4": "Android"}, {"c32f": "Android is a mobile operating system developed by Google. It comes installed on a range of mobile phone and tablets."}, {"571e": "API"}, {"46f4": "This stands for Application Programming Interface. An API is how computers and web applications share information with each other. An example: an app finds the current weather in Sydney by sending a message to the weather.com API. The weather.com API then replies with a structured response."}, {"ed0f": "Automation Testing"}, {"c4af": "Automation Testing is when a QA uses an automation tool to do tests on a software application."}, {"ca1e": "Avatar 👨‍🎤"}, {"edd6": "An avatar is the embodiment of a person or idea. In the computer world, an avatar refers to a character that represents an online user. Avatars are used in gaming and online communities."}, {"c900": "Back End (Development)"}, {"304f": "The back end is the engine room of a website, software or IT system. Back end developers deal with with what powers the site and its core functionality. The front end is what you see and interact with."}, {"8d13": "Backlog"}, {"eb13": "A backlog is a buildup of work that is due to be completed. The agile product backlog is a prioritised features list."}, {"c994": "Beacon"}, {"48b5": "Beacon technology allows mobile apps to understand their position on a micro-local scale. It can send relevant contextual content to users based on their location. It uses Bluetooth Technology."}, {"b3d1": "Branch (development branch)"}, {"2d91": "A development branch allows for parts of software to be developed in parallel. This is so that code they are writing and code that is completed can be kept seperate."}, {"6900": "Article with more detail"}, {"b8d2": "Breadcrumb (navigation)"}, {"b5a9": "This is a secondary type of navigation that reveals your location in a website or app. Breadcrumbs trace the path back to your original starting point."}, {"6b35": "Smashing Magazine explains more"}, {"8673": "Bug 🐜"}, {"86ac": "A software bug is a problem causing a program to crash or produce an invalid output. Most bugs are due to human error."}, {"a6e5": "Cache"}, {"c9fe": "A cache is a place to store something temporarily in a computing environment. For example, a username could be stored in your computers cache and is remembered the next time you login."}, {"9327": "Chatbot"}, {"d47e": "A chatbot is a service that you interact with via a chat interface. The end result is like to texting with a friend, except the friend is the computer."}, {"67d6": "Chatbot article"}, {"e217": "CMS"}, {"7fd9": "CMS stands for Content Management System. It’s a computer application that creates and manages digital content."}, {"5e1e": "CRM Software"}, {"eee4": "CRM stands for Customer Relationship Management. It’s software that stores customer contact information (such as names, addresses etc)."}, {"8da6": "Salesforce explanation"}, {"f85e": "Commits"}, {"52ae": "Developers create commits. Jake Boxer gave a great explanation: “A commit is a snapshot of your files. Imagine you’re building a model airplane. Every time you reach a good stopping point, you pull out your camera and take a picture. Once the airplane is complete, you can go back through your photos, and see how it looked at various stages. Your software project is like the model airplane. Each photo you took of the model airplane is a commit."}, {"72b6": "CSS"}, {"1a4b": "CSS stands for Cascading Style Sheets. CSS describes how HTML elements are to be displayed on screen. HTML is the structure, CSS is the style and Javascript is the behaviour."}, {"b408": "Dev Ops"}, {"4427": "Dev Ops focuses on fast technology delivery through the use of agile development. Dev Ops focuses on people and culture. It seeks to improve collaboration between operations and development teams."}, {"ed57": "Data Science"}, {"f6cd": "This is the art of uncovering trends and insights within data. With these insights a business can explore ideas and make strategic choices."}, {"7110": "Emoticons"}, {"9c7a": "This is a typographic display of a facial representation used to convey emotion :-)"}, {"b4db": "Front End (development)"}, {"fd6c": "A front-end developer creates the visual front end of an app or website. They create features that are viewable by the user."}, {"d5b2": "Github"}, {"250d": "GitHub is a web-based service used by developers. It is a way of using a central hub to work on collaborative coding projects."}, {"7bf5": "Blog Post by Red Badger"}, {"c4de": "GIF"}, {"4de8": "GIF stands for Graphics Interchange Format. A GIF is a never ending loop of images or video clips."}, {"627f": "Hack"}, {"f12d": "A hack is a quick solution that solves a problem, but not particularly well, or in a particularly good way."}, {"1dc2": "Hack Day/Hackathon"}, {"2e08": "This is when the digital team take a day or more out, to come up with innovative ideas. The aim of a hack day is to encourage creativity to get people to think outside the box."}, {"62b4": "HTML"}, {"18ab": "HTML stands for Hypertext Markup Language. HTML is the set of markup codes inserted in a file intended for display on a the web. The markup tells the Web browser how to display a Web page’s words and images for the user."}, {"2fd3": "HTML is the structure (the words), CSS is the style and Javascript is the behaviour."}, {"0476": "Hybrid App"}, {"bdbd": "A hybrid app is one that combines elements of both native and web applications."}, {"e87c": "IP Address"}, {"ee0c": "Internet Protocol Address is a unique address that identifies a device on the internet or local network."}, {"c6d8": "iOS 📱"}, {"5fee": "This is a mobile operating system created and developed by Apple. It is the operating system that powers the iPhone, iPad, and iPod’s."}, {"0955": "Iteration / Iterative Development"}, {"2de0": "Iterative development is a way of breaking down software development into smaller pieces. An iteration in the context of agile development is as set period of time (usually between 1–4 weeks)."}, {"7fed": "Image from www.rafaecheve.com"}, {"4f70": "Javascript"}, {"c5dc": "JavaScript is a programming language used to make web pages interactive. HTML is the structure, CSS is the style and Javascript is the behaviour."}, {"5f6d": "Mobile Web"}, {"06dd": "The mobile web refers to accessing the internet from smartphones."}, {"de13": "Modem"}, {"be57": "A modem is a device that enables a computer to transfer data over telephone or cable lines."}, {"0217": "MVP"}, {"bcf8": "MVP means Minimal Viable Product. It’s a way of developing a new product (e.g. a website) with acceptable features to suit the users. More features are only developed after considering feedback from the initial users."}, {"1770": "NFC"}, {"4742": "NFC means Near Field Communication. It’s a way of transferring data wirelessly to a mobile device from another device. Tap and pay services like Apple pay work this way."}, {"8a5d": "Open Source"}, {"6c3f": "Open source software is software that is available to anyone."}, {"ae66": "Pairing / Pair Programming 👫"}, {"b227": "Pair programming is when two programmers work together. One writes code, while the other reviews it. The two programmers often switch roles."}, {"50fa": "Pull Requests (PR)"}, {"993f": "This lets developers tell others about code changes they’ve pushed to GitHub."}, {"e6c6": "Refactoring / Code Refactoring"}, {"53fb": "This is the process of tidying up existing code without changing how it works. For example to improve code readability or to simplify the code structure."}, {"cd75": "Responsive (Website)"}, {"ca0e": "Responsive design allows your website to adapt to the device your users are viewing it on."}, {"dd9e": "Retro / Retrospective"}, {"bf18": "A retro in software development is when the team looks back on an iteration to improve the process for the next iteration."}, {"8af2": "SAAS"}, {"96bf": "Software as a Service is a way to deliver applications over the internet. Instead of installing and maintaining software, you access it via the internet. This frees you from complex software and hardware management."}, {"bf76": "Scrum (Software Development)"}, {"9616": "Scrum is an iterative agile software development framework for managing product development."}, {"96fe": "SDK"}, {"0532": "This stands for Software Development Kit. An SDK is software used for developing apps for a specific device or operating system."}, {"24cf": "SEO"}, {"8c31": "This stands for search engine optimisation. It’s the process of getting people to your website from search engines."}, {"a0bb": "Slack"}, {"1e1c": "This is a team collaboration tool that allows teams to communicate. It is effectively an internal online messaging service."}, {"18fa": "Sprints 🏃"}, {"2f62": "In agile software development a sprint is a set period of time which set work has to be completed. A sprint can last between 1–3 weeks depending on the business. A sprint is normally scrum specific."}, {"ec2a": "Image from Think Interactive"}, {"d082": "Spike"}, {"a4ec": "A spike is development work that cannot be estimated until a development team runs a trial. The result of a spike is an estimate of the time it will take to do the work."}, {"873a": "Tech Debt"}, {"cdd8": "An example of technical debt: You have a piece of functionality that you need to add to your system. You see two ways to do it, one is quick to do but messy. It’ll make further changes harder in the future. The other results in a cleaner design, but will take longer to put in place. (example from Agile Web Operations). Tech Debt is the extra time it will take to do the better option, having done the messy option."}, {"dd2b": "Unit Testing"}, {"4bb5": "Unit testing is where parts of an application are tested to find out if they are good to use. Unit testing can be done manually but is often automated."}, {"09b0": "VPN"}, {"2ac5": "Virtual Private Network. A VPN allows you to create a secure connection to another network over the Internet."}, {"e29e": "Waterfall"}, {"e4a0": "In software development the Waterfall Model is when each phase must be completed before the next phase can begin. Unlike agile which is a technique for incremental software development."}, {"d6f0": "“There is no greater impediment to the advancement of knowledge than the ambiguity of words” Thomas Reid"}, {"2103": "Bookmark this A-Z ☆ and use it as a reference. If you have any words you think should be added to the list then please message me below. The list will be iterated on, so please let me know additions or anything you think I have wrong."}, {"b6bc": "If you enjoyed this, have a read of my article on getting into UX Design at 40 with no digital or design experience"}, {"1e93": "Thanks to Nick, Julio and Alana for their feedback. Thanks to Techopedia & Wikipedia for parts of my research."}, {"794f": "→ If you found it useful, please click the 💚️ below to help others find it and leave a comment, thanks! 👍"}], "child": "738_1\t738_2\t738_3\t738_4\t738_5\t738_6\t738_7\t738_8\t738_9\t738_10\t738_11\t738_12\t738_13\t738_14\t738_15\t738_16\t738_17\t738_18\t738_19\t738_20\t738_21\t738_22\t738_23\t738_24\t738_25738_1\t738_2\t738_3\t738_4\t738_5\t738_6\t738_7\t738_8\t738_9\t738_10\t738_11\t738_12\t738_13\t738_14\t738_15\t738_16\t738_17\t738_18\t738_19\t738_20\t738_21\t738_22\t738_23\t738_24\t738_25738_1\t738_2\t738_3\t738_4\t738_5\t738_6\t738_7\t738_8\t738_9\t738_10\t738_11\t738_12\t738_13\t738_14\t738_15\t738_16\t738_17\t738_18\t738_19\t738_20\t738_21\t738_22\t738_23\t738_24\t738_25738_1\t738_2\t738_3\t738_4\t738_5\t738_6\t738_7\t738_8\t738_9\t738_10\t738_11\t738_12\t738_13\t738_14\t738_15\t738_16\t738_17\t738_18\t738_19\t738_20\t738_21\t738_22\t738_23\t738_24\t738_25"}