{"sentences": [{"9208": "The most popular open source projects on GitHub in each country"}, {"5de0": "Here’s 2016’s most popular open source project on GitHub for each country:"}, {"6cb3": "And the second most popular project for each country:"}, {"6f88": "Here are the top projects in each country, after removing the top 75 overall repositories:"}, {"a6e8": "These are based on a naive count of total GitHub stars earned in 2016. All of these images came from Google engineer Felipe Hoffa’s analysis, which you can read in full here."}, {"dfde": "Here are three other links worth your time:"}, {"4870": "Thought of the day:"}, {"d9ff": "“A good programmer is someone who always looks both ways before crossing a one-way street.” — Doug Linder"}, {"0f2d": "Funny of the day:"}, {"0fb3": "How to read an academic paper by Academia Obscura"}, {"3125": "Study group of the day:"}, {"9ade": "freeCodeCamp Houston"}, {"d1f3": "Happy coding!"}, {"ee9d": "– Quincy Larson, teacher at freeCodeCamp"}, {"1ea4": "If you get value out of these emails, you should consider supporting our nonprofit 😊"}], "content": "The most popular open source projects on GitHub in each country Here’s 2016’s most popular open source project on GitHub for each country: And the second most popular project for each country: Here are the top projects in each country, after removing the top 75 overall repositories: These are based on a naive count of total GitHub stars earned in 2016. All of these images came from Google engineer Felipe Hoffa’s analysis, which you can read in full here. Here are three other links worth your time: Thought of the day: “A good programmer is someone who always looks both ways before crossing a one-way street.” — Doug Linder Funny of the day: How to read an academic paper by Academia Obscura Study group of the day: freeCodeCamp Houston Happy coding! – Quincy Larson, teacher at freeCodeCamp If you get value out of these emails, you should consider supporting our nonprofit 😊 ", "parent": "", "title": "The most popular open source projects on GitHub in each country", "child": "75_1\t75_2\t75_3\t75_4\t75_5\t75_6\t75_7\t75_8\t75_9\t75_10\t75_11", "name": "75"}