{"name": "75", "parent": "", "content": "Phil Jackson and LeBron Beef Over ‘Posse’ Comment Jackson’s comments about LeBron James in a recent interview have stirred up internet and Knicks’ players attention Tuesday Photo: Brad Barket/Getty Images; Paul Sancya/AP A comment Phil Jackson made about LeBron James in a Q&A interview with Jackie MacMullan was done in Jackson’s notoriously transparent fashion, and earlier today the internet became ablaze not due to the negative comment about LeBron, but more so the word choice in the statement. MacMullan: It all started when LeBron left, right? Could you have ever imagined Earvin Johnson leaving Riley, or Michael Jordan leaving you? Jackson: It had to hurt when they lost LeBron. That was definitely a slap in the face. But there were a lot of little things that came out of that. When LeBron was playing with the Heat, they went to Cleveland and he wanted to spend the night. They don’t do overnights. Teams just don’t. So now [coach Erik] Spoelstra has to text Riley and say, ‘What do I do in this situation?’ And Pat, who has iron-fist rules, answers, ‘You are on the plane, you are with this team.’ You can’t hold up the whole team because you and your mom and your posse want to spend an extra night in Cleveland. Maverick Carter, a member of James’ so called “posse” explained the issues with the word choice: Carter: “I don’t care that he talks about LeBron,” Maverick Carter told ESPN.com. “He could say he’s not that good or the greatest in the world as a basketball player. I wouldn’t care. It’s the word ‘posse’ and the characterization I take offense to. If he would have said LeBron and his agent, LeBron and his business partners or LeBron and his friends, that’s one thing. Yet because you’re young and black, he can use that word. We’re grown men.” The word posse, to many, has a negative connotation. One that implies the people surrounding James are not useful and necessary members of James’ business, but rather a group of freeloading men who are riding James’ coattails. James himself, commented on the matter as well. It is completely plausible that Jackson had no idea of the fact that this word would be viewed as derogatory. With this being said, it doesn’t mean that it is OK. Jackson is known for his extreme transparency in interviews and lack of hesitation when talking about guys still playing in the league, especially James (Jackson once said LeBron travels every time he touches the ball). If this was the case, it is necessary for Jackson to realize that while transparency with the media is as commendable as it is rare, precautions still need to be taken as to not to offend others as an expense. Carmelo Anthony, who has been a very strong social presence and black rights advocate, also made a comment this afternoon on the word choice and interview. Anthony didn’t say anything worthy of creating more controversy but certainly showed he wasn’t thrilled either. Phil: Step 1: Take foot Step 2: Remove from mouth — Bailey Carlin, site writer Follow The Knicks Wall on Facebook and Twitter for more breaking news and coverage of the ‘Bockers. Have a Knicks-related question? Our social media editor, trey, is answering questions for this month’s mailbag. Send your Qs by Friday! ", "title": "Phil Jackson and LeBron Beef Over ‘Posse’ Comment", "sentences": [{"fb0a": "Phil Jackson and LeBron Beef Over ‘Posse’ Comment"}, {"9c73": "Jackson’s comments about LeBron James in a recent interview have stirred up internet and Knicks’ players attention Tuesday"}, {"7b1b": "Photo: Brad Barket/Getty Images; Paul Sancya/AP"}, {"dafe": "A comment Phil Jackson made about LeBron James in a Q&A interview with Jackie MacMullan was done in Jackson’s notoriously transparent fashion, and earlier today the internet became ablaze not due to the negative comment about LeBron, but more so the word choice in the statement."}, {"f74c": "MacMullan: It all started when LeBron left, right? Could you have ever imagined Earvin Johnson leaving Riley, or Michael Jordan leaving you?"}, {"1802": "Jackson: It had to hurt when they lost LeBron. That was definitely a slap in the face. But there were a lot of little things that came out of that. When LeBron was playing with the Heat, they went to Cleveland and he wanted to spend the night. They don’t do overnights. Teams just don’t. So now [coach Erik] Spoelstra has to text Riley and say, ‘What do I do in this situation?’ And Pat, who has iron-fist rules, answers, ‘You are on the plane, you are with this team.’ You can’t hold up the whole team because you and your mom and your posse want to spend an extra night in Cleveland."}, {"6415": "Maverick Carter, a member of James’ so called “posse” explained the issues with the word choice:"}, {"4cad": "Carter: “I don’t care that he talks about LeBron,” Maverick Carter told ESPN.com. “He could say he’s not that good or the greatest in the world as a basketball player. I wouldn’t care. It’s the word ‘posse’ and the characterization I take offense to. If he would have said LeBron and his agent, LeBron and his business partners or LeBron and his friends, that’s one thing. Yet because you’re young and black, he can use that word. We’re grown men.”"}, {"4871": "The word posse, to many, has a negative connotation. One that implies the people surrounding James are not useful and necessary members of James’ business, but rather a group of freeloading men who are riding James’ coattails."}, {"9ad7": "James himself, commented on the matter as well."}, {"32a4": "It is completely plausible that Jackson had no idea of the fact that this word would be viewed as derogatory. With this being said, it doesn’t mean that it is OK. Jackson is known for his extreme transparency in interviews and lack of hesitation when talking about guys still playing in the league, especially James (Jackson once said LeBron travels every time he touches the ball)."}, {"b1ff": "If this was the case, it is necessary for Jackson to realize that while transparency with the media is as commendable as it is rare, precautions still need to be taken as to not to offend others as an expense."}, {"193d": "Carmelo Anthony, who has been a very strong social presence and black rights advocate, also made a comment this afternoon on the word choice and interview. Anthony didn’t say anything worthy of creating more controversy but certainly showed he wasn’t thrilled either."}, {"dd8b": "Phil:"}, {"0fad": "Step 1: Take foot"}, {"f1c7": "Step 2: Remove from mouth"}, {"33af": "— Bailey Carlin, site writer"}, {"c338": "Follow The Knicks Wall on Facebook and Twitter for more breaking news and coverage of the ‘Bockers."}, {"400d": "Have a Knicks-related question? Our social media editor, trey, is answering questions for this month’s mailbag. Send your Qs by Friday!"}], "child": "75_1"}