{"name": "750", "parent": "", "content": "Twitter just launched Stories and I was the first one to try it out Wow, what a week! After writing about how WhatsApp introduced Status and the whole Facebook / Snapchat dispute, then the launch of Medium’s Series, now it’s Twitter! In a long-awaited move from the underdog of social networks, much to the rejoice of its user-base, Twitter finally does the powerplay by introducing Stories. It’s as exciting as you would’ve imagined, check out how it looks: Stories on Twitter is very similar to the feature’s older brothers from Snapchat and Medium, the only difference being that the text that goes on one screen needs to fit into the famous 140 character limit. Needless to say, it integrates into the platform better than anywhere else. Short, witty sentences, glimpses into celebrities’ lives, reactions from sports events combined into an endless carousel of fan reactions, it makes a lot of sense! And the best part is … Long gone are the days where you had to start tweets with 1/6, 2/6, …, then carefully nest them in order to create a series of tweets. You don’t have to improvise like that anymore. They say that the best features are the ones that are based on user patterns, building on top of a workaround that several users do. Well done! Joke aside Alright, alright. You guessed it. The story isn’t real. And while I intended this post to be a joke, what’s not funny is how Twitter is missing (again) the whole buzz. What’s your guess? Will Twitter launch Stories too? ", "title": "Twitter just launched Stories and I was the first one to try it out", "sentences": [{"567b": "Twitter just launched Stories and I was the first one to try it out"}, {"f843": "Wow, what a week! After writing about how WhatsApp introduced Status and the whole Facebook / Snapchat dispute, then the launch of Medium’s Series, now it’s Twitter!"}, {"5069": "In a long-awaited move from the underdog of social networks, much to the rejoice of its user-base, Twitter finally does the powerplay by introducing Stories."}, {"28bc": "It’s as exciting as you would’ve imagined, check out how it looks:"}, {"04c0": "Stories on Twitter is very similar to the feature’s older brothers from Snapchat and Medium, the only difference being that the text that goes on one screen needs to fit into the famous 140 character limit."}, {"e346": "Needless to say, it integrates into the platform better than anywhere else. Short, witty sentences, glimpses into celebrities’ lives, reactions from sports events combined into an endless carousel of fan reactions, it makes a lot of sense!"}, {"923a": "And the best part is …"}, {"474a": "Long gone are the days where you had to start tweets with 1/6, 2/6, …, then carefully nest them in order to create a series of tweets."}, {"3ab3": "You don’t have to improvise like that anymore."}, {"e381": "They say that the best features are the ones that are based on user patterns, building on top of a workaround that several users do. Well done!"}, {"5ce5": "Joke aside"}, {"85b5": "Alright, alright. You guessed it. The story isn’t real."}, {"5a25": "And while I intended this post to be a joke, what’s not funny is how Twitter is missing (again) the whole buzz."}, {"e535": "What’s your guess? Will Twitter launch Stories too?"}], "child": "750_1\t750_2\t750_3"}