{"name": "767", "parent": "", "content": "America, the beautiful Pepsi unites with United as Flag Bearers of Corporate Destruction Including the ongoing erosion of social etiquette Geez! That title sucks! It’s just a ridiculously fancy way for me to acknowledge that we are now knee deep in an era that gives us permission to lazily and disgustingly refute the vices that held us down not too long ago. The other day, I was walking into the Apple Store at the Beverly Center in Los Angeles and after a short wait, a young guy approached me — armed with the solution to my problem. I calmly explained my frustration at that fact that despite my iPhone 6 not quite achieving the two-year mark, and escaping the fate of its predecessors by remaining fastened in its case at all times — I was battling a battalion of issues, including and most importantly the unreliable battery, which was basically terminal. After a quick examination, the Apple worker concluded that my battery was indeed beyond recovery and the only solution would be to replace it. And of course my one year warranty had run out so I was required to cough up $89 + tax if I wanted to use my phone without chaining to my weathered charger. I felt the heat of exhaustion overwhelm me as he dutifully recited my options. Either pay or deal with a gadget that is dying way before its time. I took a deep breath and proceeded to charge him with the task of explaining how it is possible that I would spend the kind of money that is usually delegated to rent for a phone that is obviously not capable of living up to the expectations — that one would assume based on the revered reputation of the brand name associated with it. He quickly dismissed my inquiry and assured me that it was more than fair that my iPhone would begin to fail me even if I purchased it just a year and a half ago. His demeanor was stony and robotic as I watched him convince me that despite my past history with iPhones that lasted long enough to entice an upgrade — what I was experiencing was standard procedure. I did pay to get a new battery, and while I waited for it to be installed, I walked around the store, cursing every product on display. I recalled how my ex-boyfriend had insisted that I get an iPhone instead of the sub par version I was carrying around. He ended up buying me one for my birthday and I was elated. It was the iPhone 4 and it was simply the best phone I have ever had to date. It worked like a charm and gave me no qualms. Unfortunately it died a brutal and sudden death when I dropped it while trying to get my stuff out of my gym locker at Equinox. The iPhone 5 replaced my beloved and proved to be a disaster. It went through an internal and physical shutdown, which forced me to get my current nightmare. Apple is just one of many tags in the corporate realm that is struggling to maintain the dotted lines on the print that was signed on behalf of loyalists all over the world — that keep swearing that they are getting what they pay for when the signature white box stamped with black letters and the formidable logo is delivered with care. The disease of corporate infamy is spreading like a virus across the aisles of airliners and into the streets of badly staged commercials with worn-out execs and CEOs dismally tallying their losses — as their PR lackeys draft up horribly strewn responses that only amplify the depth of our rotting souls. The Pepsi fiasco was dumb as fuck. I wrote about it because the apology that was offered seemed to be aimed at the willing participant who got paid tons of money — and is probably being fussed over in order to secure her permission to allow the behind the scenes footage to appear in the next season of her family’s reality show. You will watch that much-hyped episode and ensure that the ratings will be the highest on record. United Airlines is a godsend in this scenario. Here is the true example of what Trump’s America has bequeathed us and why this country is better off being separated into itsy bitsy pieces so that we can land where we belong and float to safety. As a Nigerian-American who grew up in the sprawling metropolis of Lagos, a vast landscape that had once served as the epicenter of British Imperialism, I was exposed to the gangster offerings of the eighties in the form of military coups, endorsed lawlessness and the miserly access to basic amenities. It was all going to change once I made my triumphant return to the land of my birth — the place where modern civilization isn’t a myth but rather a comfortable way of life. Nowhere is perfect and humans are ultimately fallible, but the saving grace is the adherence to the promise of “justice for all” and the assurance that under no circumstances will you be denied your basic human rights. As I watched the highly distraught passenger being violently removed from the seat that he paid for by a group of burly men as fellow passengers angled their phones in the hopes that their shot would be the shot — the image of the American flag obeying the wind suddenly flooded my mind. Fuck me! This is America. The days of old that demanded our swollen pride to override our preferred settings when they threatened to demolish the spirit of respect for our fellow citizens has been vanquished like the firecrackers that alight the sky after a meteor vanishes. Back then, things were way harder than they are now. You had to earn your keep, which meant that there was no reliance on clicks and likes to help propel your generic agenda. You couldn’t use your growing number of groupies as a shield against the consequences of your wrongdoings. Companies actually cared about their clients, customers, and employees and went above and beyond to guarantee that no matter the outcome — all parties would formally submit to the ethical script that could never be callously manipulated. But, the rules have changed. The erosion of social etiquette started with the conformity to a media that makes everyone a critic, lawmaker and judge. We are all wearing the badge of authority and if we have to use it to fuck up an innocent man who just wanted to get home so he could report to work to save lives — then so be it. We are running wild and getting soiled with the blood of our destructiveness. The man you elected to calm us won’t succeed because he is too busy tearing up the carcasses of souls that relented to the infection he caused when you were pathetically seduced to the dark side. The sun will shine brighter, the days will be hotter — and the nights tormented by the lightening of the disarray wrought from a system that employs suited henchman and regularly clothed gangsters — to hunt for blood that is essential to feed the beast of our mental demise. AT&T will continue to charge you hundreds of dollars under the guise of “insufficient data” — and Disney will continue to treat contractors like slaves with invisible digits pinned to the evidence of why hard work doesn’t always lead to the big reward. Hashtags will live forever and your platforms of choice will flourish without your input as each refresh directs to the next victim that needs to be devoured — or the captives that you watch in awe as they mercilessly hit the ground and splatter your screen with fluids of tragedy and misconduct. We are not humans. We are Americans. ", "title": "Pepsi unites with United as Flag Bearers of Corporate Destruction", "sentences": [{"7bf0": "America, the beautiful"}, {"db53": "Pepsi unites with United as Flag Bearers of Corporate Destruction"}, {"33f7": "Including the ongoing erosion of social etiquette"}, {"f02a": "Geez! That title sucks! It’s just a ridiculously fancy way for me to acknowledge that we are now knee deep in an era that gives us permission to lazily and disgustingly refute the vices that held us down not too long ago."}, {"ac0a": "The other day, I was walking into the Apple Store at the Beverly Center in Los Angeles and after a short wait, a young guy approached me — armed with the solution to my problem."}, {"71c5": "I calmly explained my frustration at that fact that despite my iPhone 6 not quite achieving the two-year mark, and escaping the fate of its predecessors by remaining fastened in its case at all times — I was battling a battalion of issues, including and most importantly the unreliable battery, which was basically terminal."}, {"21ba": "After a quick examination, the Apple worker concluded that my battery was indeed beyond recovery and the only solution would be to replace it. And of course my one year warranty had run out so I was required to cough up $89 + tax if I wanted to use my phone without chaining to my weathered charger."}, {"20fc": "I felt the heat of exhaustion overwhelm me as he dutifully recited my options. Either pay or deal with a gadget that is dying way before its time."}, {"5de5": "I took a deep breath and proceeded to charge him with the task of explaining how it is possible that I would spend the kind of money that is usually delegated to rent for a phone that is obviously not capable of living up to the expectations — that one would assume based on the revered reputation of the brand name associated with it."}, {"7172": "He quickly dismissed my inquiry and assured me that it was more than fair that my iPhone would begin to fail me even if I purchased it just a year and a half ago. His demeanor was stony and robotic as I watched him convince me that despite my past history with iPhones that lasted long enough to entice an upgrade — what I was experiencing was standard procedure."}, {"f4e6": "I did pay to get a new battery, and while I waited for it to be installed, I walked around the store, cursing every product on display."}, {"a751": "I recalled how my ex-boyfriend had insisted that I get an iPhone instead of the sub par version I was carrying around. He ended up buying me one for my birthday and I was elated. It was the iPhone 4 and it was simply the best phone I have ever had to date. It worked like a charm and gave me no qualms. Unfortunately it died a brutal and sudden death when I dropped it while trying to get my stuff out of my gym locker at Equinox."}, {"29a1": "The iPhone 5 replaced my beloved and proved to be a disaster. It went through an internal and physical shutdown, which forced me to get my current nightmare."}, {"abf3": "Apple is just one of many tags in the corporate realm that is struggling to maintain the dotted lines on the print that was signed on behalf of loyalists all over the world — that keep swearing that they are getting what they pay for when the signature white box stamped with black letters and the formidable logo is delivered with care."}, {"745d": "The disease of corporate infamy is spreading like a virus across the aisles of airliners and into the streets of badly staged commercials with worn-out execs and CEOs dismally tallying their losses — as their PR lackeys draft up horribly strewn responses that only amplify the depth of our rotting souls."}, {"8f08": "The Pepsi fiasco was dumb as fuck. I wrote about it because the apology that was offered seemed to be aimed at the willing participant who got paid tons of money — and is probably being fussed over in order to secure her permission to allow the behind the scenes footage to appear in the next season of her family’s reality show."}, {"5568": "You will watch that much-hyped episode and ensure that the ratings will be the highest on record."}, {"0f69": "United Airlines is a godsend in this scenario."}, {"ac40": "Here is the true example of what Trump’s America has bequeathed us and why this country is better off being separated into itsy bitsy pieces so that we can land where we belong and float to safety."}, {"3676": "As a Nigerian-American who grew up in the sprawling metropolis of Lagos, a vast landscape that had once served as the epicenter of British Imperialism, I was exposed to the gangster offerings of the eighties in the form of military coups, endorsed lawlessness and the miserly access to basic amenities."}, {"7495": "It was all going to change once I made my triumphant return to the land of my birth — the place where modern civilization isn’t a myth but rather a comfortable way of life. Nowhere is perfect and humans are ultimately fallible, but the saving grace is the adherence to the promise of “justice for all” and the assurance that under no circumstances will you be denied your basic human rights."}, {"05ca": "As I watched the highly distraught passenger being violently removed from the seat that he paid for by a group of burly men as fellow passengers angled their phones in the hopes that their shot would be the shot — the image of the American flag obeying the wind suddenly flooded my mind."}, {"8026": "Fuck me! This is America."}, {"c071": "The days of old that demanded our swollen pride to override our preferred settings when they threatened to demolish the spirit of respect for our fellow citizens has been vanquished like the firecrackers that alight the sky after a meteor vanishes."}, {"8c60": "Back then, things were way harder than they are now. You had to earn your keep, which meant that there was no reliance on clicks and likes to help propel your generic agenda."}, {"0e3d": "You couldn’t use your growing number of groupies as a shield against the consequences of your wrongdoings."}, {"ccdc": "Companies actually cared about their clients, customers, and employees and went above and beyond to guarantee that no matter the outcome — all parties would formally submit to the ethical script that could never be callously manipulated."}, {"df21": "But, the rules have changed."}, {"4ecc": "The erosion of social etiquette started with the conformity to a media that makes everyone a critic, lawmaker and judge. We are all wearing the badge of authority and if we have to use it to fuck up an innocent man who just wanted to get home so he could report to work to save lives — then so be it."}, {"462c": "We are running wild and getting soiled with the blood of our destructiveness. The man you elected to calm us won’t succeed because he is too busy tearing up the carcasses of souls that relented to the infection he caused when you were pathetically seduced to the dark side."}, {"9a55": "The sun will shine brighter, the days will be hotter — and the nights tormented by the lightening of the disarray wrought from a system that employs suited henchman and regularly clothed gangsters — to hunt for blood that is essential to feed the beast of our mental demise."}, {"3c8b": "AT&T will continue to charge you hundreds of dollars under the guise of “insufficient data” — and Disney will continue to treat contractors like slaves with invisible digits pinned to the evidence of why hard work doesn’t always lead to the big reward."}, {"82c3": "Hashtags will live forever and your platforms of choice will flourish without your input as each refresh directs to the next victim that needs to be devoured — or the captives that you watch in awe as they mercilessly hit the ground and splatter your screen with fluids of tragedy and misconduct."}, {"c5e1": "We are not humans. We are Americans."}], "child": "767_1\t767_2\t767_3\t767_4\t767_5\t767_6\t767_7"}