{"name": "768", "parent": "", "content": "Introducing BIF’s Design Methodology for Next Practices and New Business Models A successful business model is like a shark that has to keep moving to stay alive. But how do you make sure you’re not stuck in a crowded swim lane with declining margins, swimming upstream against disruptive currents, or even worse, find your organization dead in the water? A growing number of institutional leaders tell us that their current approach to innovation isn’t working. Inertia and culture are getting in the way of what’s next. The job-to-be-done for institutional leaders is to explore, test, and commercialize next practices and new business models. R&D for new business models is the new strategic imperative. A next practice is a new and improved version of a capability or group of capabilities. It has the potential to transform customer experience promising a better way to deliver value. A market-tested next practice can either be integrated into today’s business model or be leveraged independently to enable entire new business models. Since its inception twelve years ago, Business Innovation Factory (BIF) has been developing and integrating the next practices of human-centered design, rapid prototyping, and storytelling/engagement into all of our client project work. These lynchpin capabilities now enable us to deliver on our value proposition: BIF helps institutional leaders make transformation safer and easier to manage. I am beyond proud today, on behalf of our entire BIF team, to introduce: BIF’s Design Methodology includes detailed inputs, key activities, and outputs for each of the four phases of the process. It’s the result of a 12-year labor of love. Here are ten things our team has learned along the way: Everyone on Team BIF has contributed to our Design Methodology in countless ways over the years. We wouldn’t be able to share it today without each team member’s amazing effort and without collectively living our BIF value of collaborative innovation. Innovation is a team sport. Special thanks to BIF Experience Designers Crystal June Rome and Kay Zagrodny, who did the hard project work. They immersed themselves into herding passionate inno-cats at BIF, spent countless hours listening to me drone on about the underlying idea, and stayed true to their most recent project experience. Crystal and Kay had just wrapped up an amazing project, working with BIF’s Chief Market Maker, Elizabeth MacLaren. They worked with the Population Health team at Children’s Health in Dallas, prototyping and testing a transformational next practice centered on family well-being. The next practice we helped them develop was then stitched together with the capabilities to deliver an insurance product. A brand new business model is being launched by Children’s Health now in Dallas. Imagine that, a hospital commercializing a new business model that is on the hook to economically improve family well-being. Team BIF rocks! “At BIF, we believe that social system transformation becomes more possible when we all open source our new approaches, platforms, and tools. That’s how we get better faster together.” We have also benefited enormously from a growing and engaged community of innovation junkies from around the world who inspire us and help us to get better faster every day. At BIF we believe in enabling random collisions of unusual suspects or making a RCUS! It’s key to finding opportunities between our silos, disciplines, and sectors. I’m grateful for a random collision with XPLANE Co-Founder Dave Gray, and their crazy cool and talented team. XPlane’s superpower is using visualization to help teams align around a shared purpose and story. We leaned heavily on XPlane’s superpower to create this visualization of our BIF Design Methodology, and it won’t be the last time we collaborate. We share our BIF Design Methodology today to more clearly describe how we help institutional leaders explore and test what’s next. We also share it because at BIF, we believe that social system transformation becomes more possible when we all open source our new approaches, platforms, and tools. That’s how we get better faster together. The 12-month process depicted in BIF’s Design Methodology is intended as a guideline. We always customize it to meet the specific needs and requirements of each client project. We live in a time that screams for transformation yet too many institutions are only capable of tweaks. We developed BIF’s Design Methodology because a growing number of institutional leaders know they need a better approach to innovation. Together, we can make transformation safer and easier to manage. ", "title": "Introducing BIF’s Design Methodology for Next Practices and New Business Models", "sentences": [{"3720": "Introducing BIF’s Design Methodology for Next Practices and New Business Models"}, {"1f46": "A successful business model is like a shark that has to keep moving to stay alive. But how do you make sure you’re not stuck in a crowded swim lane with declining margins, swimming upstream against disruptive currents, or even worse, find your organization dead in the water? A growing number of institutional leaders tell us that their current approach to innovation isn’t working. Inertia and culture are getting in the way of what’s next. The job-to-be-done for institutional leaders is to explore, test, and commercialize next practices and new business models. R&D for new business models is the new strategic imperative."}, {"6a7b": "A next practice is a new and improved version of a capability or group of capabilities. It has the potential to transform customer experience promising a better way to deliver value. A market-tested next practice can either be integrated into today’s business model or be leveraged independently to enable entire new business models. Since its inception twelve years ago, Business Innovation Factory (BIF) has been developing and integrating the next practices of human-centered design, rapid prototyping, and storytelling/engagement into all of our client project work. These lynchpin capabilities now enable us to deliver on our value proposition: BIF helps institutional leaders make transformation safer and easier to manage."}, {"63cf": "I am beyond proud today, on behalf of our entire BIF team, to introduce:"}, {"b8f4": "BIF’s Design Methodology includes detailed inputs, key activities, and outputs for each of the four phases of the process."}, {"2b8e": "It’s the result of a 12-year labor of love. Here are ten things our team has learned along the way:"}, {"c511": "Everyone on Team BIF has contributed to our Design Methodology in countless ways over the years. We wouldn’t be able to share it today without each team member’s amazing effort and without collectively living our BIF value of collaborative innovation. Innovation is a team sport. Special thanks to BIF Experience Designers Crystal June Rome and Kay Zagrodny, who did the hard project work. They immersed themselves into herding passionate inno-cats at BIF, spent countless hours listening to me drone on about the underlying idea, and stayed true to their most recent project experience. Crystal and Kay had just wrapped up an amazing project, working with BIF’s Chief Market Maker, Elizabeth MacLaren. They worked with the Population Health team at Children’s Health in Dallas, prototyping and testing a transformational next practice centered on family well-being. The next practice we helped them develop was then stitched together with the capabilities to deliver an insurance product. A brand new business model is being launched by Children’s Health now in Dallas. Imagine that, a hospital commercializing a new business model that is on the hook to economically improve family well-being. Team BIF rocks!"}, {"6494": "“At BIF, we believe that social system transformation becomes more possible when we all open source our new approaches, platforms, and tools. That’s how we get better faster together.”"}, {"0310": "We have also benefited enormously from a growing and engaged community of innovation junkies from around the world who inspire us and help us to get better faster every day. At BIF we believe in enabling random collisions of unusual suspects or making a RCUS! It’s key to finding opportunities between our silos, disciplines, and sectors. I’m grateful for a random collision with XPLANE Co-Founder Dave Gray, and their crazy cool and talented team. XPlane’s superpower is using visualization to help teams align around a shared purpose and story. We leaned heavily on XPlane’s superpower to create this visualization of our BIF Design Methodology, and it won’t be the last time we collaborate."}, {"4fba": "We share our BIF Design Methodology today to more clearly describe how we help institutional leaders explore and test what’s next. We also share it because at BIF, we believe that social system transformation becomes more possible when we all open source our new approaches, platforms, and tools. That’s how we get better faster together. The 12-month process depicted in BIF’s Design Methodology is intended as a guideline. We always customize it to meet the specific needs and requirements of each client project."}, {"149b": "We live in a time that screams for transformation yet too many institutions are only capable of tweaks. We developed BIF’s Design Methodology because a growing number of institutional leaders know they need a better approach to innovation. Together, we can make transformation safer and easier to manage."}], "child": "768_1\t768_2"}