{"name": "769", "parent": "", "content": "Can We Please Talk About HR? Stop cringing. Someone needs to say it. I’m running a steep trail up Mt. Tam just north of the Golden Gate Bridge. It’s a warm post-winter day. Painfully bright blue sky. Perfect. I’m blasting a mix of Ryan Adams, Jackson Browne, The Thrills. Old school with a shallow mix of pop from Bruno Mars and Ariana Grande. Don’t judge. And now interrupted by commercials because my premium subscription isn’t paid. Damn. One particular spot is getting to me. Its an advertisement for some sort of HR platform. “For HR leaders who lead their business.” It’s playing to a type of HR person. A self view. “You are the leader. You need the tools to lead. It’s all about you.” I’ve now heard this spot four times. This along with a commercial about opioid addiction. They seem related. The Conversation “No. I’m not going to talk to him,” she says vehemently as I again suggest she talk with her HR Talent Partner. I suggest this regularly. Sadly, this is the response I get. Always. Later that same day, I bump into a middle manager. Out of the blue she asks, “Why does my Talent Partner insist on attending my leadership meetings? She undermines my ability to lead.” In my role as advisor and coach, employees often reach out to me. Mostly to be heard. A rare thing in most corporations. I can’t do much other than practice conversations, develop strategies, and tell them a truth. Clarity is my only skill. This listening role gets me into trouble with HR. We try to get along, but often don’t. I’m forced to adopt the lesson from the 1980s movie War Games. “A strange game,” says the supercomputer Joshua when referring to our nuclear gamesmanship. “The only winning move is not to play.” And that’s where I often land. Sadly, this is where most employees land too. The Ugly Truth In its current form, HR doesn’t help employees. It doesn’t create a caring or empowering culture. It’s efforts to teach, to develop, or to create opportunity is overshadowed by its real job. Protect the corporate structure and extract value from their aptly named “human resource.” Every employee knows this. The unspoken truth. HR hates it. Denies it. And clouds it with comfort words like partner, people, human, even family in an attempt to hide it. It’s not their fault. They are mostly good people dedicated to helping. They truly want to make this work experience good for people. But in the end, the structure, the corporate requirements, win out. They become the guardians of greed. Overstated of course. But the alliteration is too fun not to say. It Used To Work There was a time when the current structure worked. Employees were different. They were compliant. They didn’t push back. They didn’t know they could. But this current generation of “knowledge workers” don’t comply. They ask tough questions. They push back. They demand truth from their corporate overlords. If the corporation claims to care about them, they demand proof. If leaders say they want employees to grow, to be better, today’s employees hold them to account. This is uncomfortable. But HR and corporate leaders need to buck up. Listen to them. Engage them. Trust them. The benefit in performance and production far outweighs the cost. It’s why startups are so innovative. They give employees the freedom to create. To build dreams. To be inspired. To be. The Issue The issue is the structure and logic of HR, not the people who are put into this uncomfortable position. The current logic makes HR leaders create a rules-based culture versus creating trust. They are forced to choose fairness over doing what’s right. There is a difference. The result is a group of good people in a permanently confused state. Caring but forced to be enforcers. Knowing they are distrusted but not sure why. It isn’t fair to them. Nor it is a useful investment of resources for the corporation. (Side note. I recommend the book The Righteous Mind by Jonathan Haidt. His work on what he calls the moral foundation theory is too good and relevant to miss. And it oddly applies to HR. Homework.) Is This HR Dilemma Fixable? I believe it is. But it requires truth and humility. Tough stuff for a group of people who spend their lives in a structural lie. I know, another overstatement, but maybe not. So here’s the humble opinion of a powerless coach: What Problem Are We Solving? My engineering friends are no doubt asking a fundamental question about now. “What problem are you trying to solve?” My answer: I believe the current HR structure and logics are crippling innovation. Destroying the power of this generation of workers. Killing the dream. Sucking capital from the corporate balance sheet. How about that for drama? What If? What if we focused on the benefits? Wouldn’t it be great if employees eagerly sought out their HR team for help? What if they felt protected, comforted, understood? What if HR heard the candid truths? And what if they could do something about it? No longer limited to the corporate requirements of risk mitigation and protection of the corporate structure? And wouldn’t the balance sheet look a whole lot better? You bet. Then when I ask, “Have you talked with HR?”, they respond, “Yes and they gave me some great advice.” Wouldn’t that be nice? Cue the Beach Boys now. ", "title": "Can We Please Talk About HR?", "sentences": [{"82f5": "Can We Please Talk About HR?"}, {"c5f8": "Stop cringing. Someone needs to say it."}, {"4b48": "I’m running a steep trail up Mt. Tam just north of the Golden Gate Bridge. It’s a warm post-winter day. Painfully bright blue sky. Perfect. I’m blasting a mix of Ryan Adams, Jackson Browne, The Thrills. Old school with a shallow mix of pop from Bruno Mars and Ariana Grande. Don’t judge. And now interrupted by commercials because my premium subscription isn’t paid. Damn."}, {"0e3a": "One particular spot is getting to me. Its an advertisement for some sort of HR platform. “For HR leaders who lead their business.” It’s playing to a type of HR person. A self view. “You are the leader. You need the tools to lead. It’s all about you.” I’ve now heard this spot four times. This along with a commercial about opioid addiction. They seem related."}, {"7f0d": "The Conversation"}, {"34e4": "“No. I’m not going to talk to him,” she says vehemently as I again suggest she talk with her HR Talent Partner. I suggest this regularly. Sadly, this is the response I get. Always. Later that same day, I bump into a middle manager. Out of the blue she asks, “Why does my Talent Partner insist on attending my leadership meetings? She undermines my ability to lead.”"}, {"bdd6": "In my role as advisor and coach, employees often reach out to me. Mostly to be heard. A rare thing in most corporations. I can’t do much other than practice conversations, develop strategies, and tell them a truth. Clarity is my only skill."}, {"6eb9": "This listening role gets me into trouble with HR. We try to get along, but often don’t. I’m forced to adopt the lesson from the 1980s movie War Games. “A strange game,” says the supercomputer Joshua when referring to our nuclear gamesmanship. “The only winning move is not to play.” And that’s where I often land. Sadly, this is where most employees land too."}, {"505e": "The Ugly Truth"}, {"c8a9": "In its current form, HR doesn’t help employees. It doesn’t create a caring or empowering culture. It’s efforts to teach, to develop, or to create opportunity is overshadowed by its real job. Protect the corporate structure and extract value from their aptly named “human resource.”"}, {"2e93": "Every employee knows this. The unspoken truth. HR hates it. Denies it. And clouds it with comfort words like partner, people, human, even family in an attempt to hide it."}, {"0b6f": "It’s not their fault. They are mostly good people dedicated to helping. They truly want to make this work experience good for people. But in the end, the structure, the corporate requirements, win out. They become the guardians of greed. Overstated of course. But the alliteration is too fun not to say."}, {"3895": "It Used To Work"}, {"e4bd": "There was a time when the current structure worked. Employees were different. They were compliant. They didn’t push back. They didn’t know they could. But this current generation of “knowledge workers” don’t comply. They ask tough questions. They push back. They demand truth from their corporate overlords. If the corporation claims to care about them, they demand proof. If leaders say they want employees to grow, to be better, today’s employees hold them to account. This is uncomfortable."}, {"efb2": "But HR and corporate leaders need to buck up. Listen to them. Engage them. Trust them. The benefit in performance and production far outweighs the cost. It’s why startups are so innovative. They give employees the freedom to create. To build dreams. To be inspired. To be."}, {"4cd5": "The Issue"}, {"7fe5": "The issue is the structure and logic of HR, not the people who are put into this uncomfortable position. The current logic makes HR leaders create a rules-based culture versus creating trust. They are forced to choose fairness over doing what’s right. There is a difference."}, {"5688": "The result is a group of good people in a permanently confused state. Caring but forced to be enforcers. Knowing they are distrusted but not sure why. It isn’t fair to them. Nor it is a useful investment of resources for the corporation."}, {"12c1": "(Side note. I recommend the book The Righteous Mind by Jonathan Haidt. His work on what he calls the moral foundation theory is too good and relevant to miss. And it oddly applies to HR. Homework.)"}, {"816f": "Is This HR Dilemma Fixable?"}, {"868f": "I believe it is. But it requires truth and humility. Tough stuff for a group of people who spend their lives in a structural lie. I know, another overstatement, but maybe not."}, {"4495": "So here’s the humble opinion of a powerless coach:"}, {"e66c": "What Problem Are We Solving?"}, {"89e9": "My engineering friends are no doubt asking a fundamental question about now. “What problem are you trying to solve?” My answer: I believe the current HR structure and logics are crippling innovation. Destroying the power of this generation of workers. Killing the dream. Sucking capital from the corporate balance sheet. How about that for drama?"}, {"4f92": "What If?"}, {"6da5": "What if we focused on the benefits? Wouldn’t it be great if employees eagerly sought out their HR team for help? What if they felt protected, comforted, understood? What if HR heard the candid truths? And what if they could do something about it? No longer limited to the corporate requirements of risk mitigation and protection of the corporate structure? And wouldn’t the balance sheet look a whole lot better? You bet."}, {"a6a3": "Then when I ask, “Have you talked with HR?”, they respond, “Yes and they gave me some great advice.” Wouldn’t that be nice? Cue the Beach Boys now."}], "child": "769_1\t769_2"}