{"name": "770", "parent": "", "content": "Sobre ser você mesmo Era 2011, e minha agenda indicava que eu estava cada vez mais próxima de uma das reuniões mais importantes de negócio que eu faria até ali. Do outro lado da mesa eu almoçaria com uma pessoa responsável por um uma companhia gigante da indústria da internet, até IPO em NASDAQ já fizeram. Uma companhia que você respeita. Teríamos uma hora no relógio para um almoço que levei quase um ano para fazer virar. Para mim, um momento tão importante que a preocupação em não exibir uma das minhas 7 tatuagens, ou de falar o que não devo e pior, de fazer perguntas poucos inteligentes estavam me confundindo e tirando o foco do que eu realmente queria com aquele almoço. Após uma semana nesse dilema resolvi escrever para uma dos meus mentores e perguntar como deveria me apresentar nessa reunião. A resposta foi direta e na carne: \"Seja você Bru! Independente de qualquer coisa, seja você!” Essa resposta breve e direta veio como um alívio, e me levou a reavaliar minha jornada até ali. Sempre muito convicta das minhas escolhas, nunca concordei com muitas coisas impostas pelo mundo corporativo, e começando pelo dress code apenas para citar um exemplo, fica muito claro que esse é mais um dos movimentos desse mundo para colocar todas as pessoas na mesma caixa, ignorando assim sinais, indicativos e mensagens profundas sobre indivíduos. Indicativos esses que jamais deveriam ser ignorados se considerarmos que o aprendizado é um ciclo que não termina em nós mesmos, e de que estamos sempre aprendendo, com tudo e com todos. Respeitando claro os diferentes ambientes, de fato, um dress code é carregado de mensagens sobre quem as pessoas são, independente de todo pre conceito estabelecido. Acredito de verdade que não exista uma fórmula única a ser seguida por todo e qualquer indivíduo no mundo dos negócios, ou em qualquer outro ambiente. Um dos livros que li ano passado me trouxe a intrigante reflexão quando o autor afirma que somos a média dos 5 hábitos que cultivamos, das 5 pessoas com as quais mais estamos juntos, das 5 coisas que mais comemos, dos 5 tipos de conteúdo que mais consumimos, etc. Questionei muito a profundidade dessa afirmação, mas fiz uma longa análise das minhas experiências pessoais e de fato fez todo sentido para mim. Vivo uma incansante busca por aprender com todos, independente de padrões ou situações. Pratico constantemente estar em contato e encontrando pessoas que respeito para aprender com elas, e vejam só, hoje tenho mentores mais novos do que eu, dos 20 e poucos aos 70 e poucos anos. Faço disso tudo um infinito aprendizado, o que me assegura a cada dia a não negociar ser eu mesma, não investir no que não existe em mim, e a acreditar que o melhor material que temos é a construção de nós mesmos. Afinal, “qual a sua formação?”, se não um somatório de experiências e aprendizados que construímos na vida, e que não estão nos diplomas!? O almoço correu bem, eu me vesti como de costume, agi com transparência e fiz meu dever de casa, estudando tudo sobre o que precisava, além de ter levado umas perguntas na cabeça (fica a dica). E o meu convidado? Estava até mais despojado do que eu imaginei, vestia calça jeans, tênis e camiseta. Ao fim do almoço trocou comigo um abracinho e aquele famoso \"aperto de mãos contratual\", que nos transformaria de desconhecidos a sócios. Dahora a vida.Cheers :) ", "title": "Sobre ser você mesmo", "sentences": [{"d336": "Sobre ser você mesmo"}, {"43d0": "Era 2011, e minha agenda indicava que eu estava cada vez mais próxima de uma das reuniões mais importantes de negócio que eu faria até ali. Do outro lado da mesa eu almoçaria com uma pessoa responsável por um uma companhia gigante da indústria da internet, até IPO em NASDAQ já fizeram. Uma companhia que você respeita."}, {"5920": "Teríamos uma hora no relógio para um almoço que levei quase um ano para fazer virar. Para mim, um momento tão importante que a preocupação em não exibir uma das minhas 7 tatuagens, ou de falar o que não devo e pior, de fazer perguntas poucos inteligentes estavam me confundindo e tirando o foco do que eu realmente queria com aquele almoço."}, {"021f": "Após uma semana nesse dilema resolvi escrever para uma dos meus mentores e perguntar como deveria me apresentar nessa reunião. A resposta foi direta e na carne:"}, {"5ee4": "\"Seja você Bru! Independente de qualquer coisa, seja você!”"}, {"d879": "Essa resposta breve e direta veio como um alívio, e me levou a reavaliar minha jornada até ali."}, {"9a4d": "Sempre muito convicta das minhas escolhas, nunca concordei com muitas coisas impostas pelo mundo corporativo, e começando pelo dress code apenas para citar um exemplo, fica muito claro que esse é mais um dos movimentos desse mundo para colocar todas as pessoas na mesma caixa, ignorando assim sinais, indicativos e mensagens profundas sobre indivíduos. Indicativos esses que jamais deveriam ser ignorados se considerarmos que o aprendizado é um ciclo que não termina em nós mesmos, e de que estamos sempre aprendendo, com tudo e com todos. Respeitando claro os diferentes ambientes, de fato, um dress code é carregado de mensagens sobre quem as pessoas são, independente de todo pre conceito estabelecido."}, {"92ea": "Acredito de verdade que não exista uma fórmula única a ser seguida por todo e qualquer indivíduo no mundo dos negócios, ou em qualquer outro ambiente."}, {"82e5": "Um dos livros que li ano passado me trouxe a intrigante reflexão quando o autor afirma que somos a média dos 5 hábitos que cultivamos, das 5 pessoas com as quais mais estamos juntos, das 5 coisas que mais comemos, dos 5 tipos de conteúdo que mais consumimos, etc. Questionei muito a profundidade dessa afirmação, mas fiz uma longa análise das minhas experiências pessoais e de fato fez todo sentido para mim."}, {"8dfe": "Vivo uma incansante busca por aprender com todos, independente de padrões ou situações. Pratico constantemente estar em contato e encontrando pessoas que respeito para aprender com elas, e vejam só, hoje tenho mentores mais novos do que eu, dos 20 e poucos aos 70 e poucos anos."}, {"697f": "Faço disso tudo um infinito aprendizado, o que me assegura a cada dia a não negociar ser eu mesma, não investir no que não existe em mim, e a acreditar que o melhor material que temos é a construção de nós mesmos."}, {"1c7c": "Afinal, “qual a sua formação?”, se não um somatório de experiências e aprendizados que construímos na vida, e que não estão nos diplomas!?"}, {"3716": "O almoço correu bem, eu me vesti como de costume, agi com transparência e fiz meu dever de casa, estudando tudo sobre o que precisava, além de ter levado umas perguntas na cabeça (fica a dica)."}, {"7868": "E o meu convidado? Estava até mais despojado do que eu imaginei, vestia calça jeans, tênis e camiseta. Ao fim do almoço trocou comigo um abracinho e aquele famoso \"aperto de mãos contratual\", que nos transformaria de desconhecidos a sócios."}, {"ece0": "Dahora a vida.Cheers :)"}], "child": "770_1\t770_2"}