{"name": "772", "parent": "", "content": "Why entrepreneurs make the best startup employees You can tell a lot about a person by their side hustle. When I’m looking for candidates to join our growing startup, it’s pretty much mandatory they have at least one. I used to be a side hustler myself. A few years ago, I was working hard at getting my first book published. I worked on the manuscript at home in the daytime before going into the newsroom for my evening shift as a web reporter. People take on side hustles for a variety of reasons. There’s the extra cash. But most of the time, it’s because they’re motivated to do something more than what their day (or night) job allows. Many feel unfulfilled at work, stuck in a job that offers them little freedom and creativity. But if you pull the entrepreneur out of the employee, there you’ll find a leader. It’s no surprise that all four co-founders at my company (including myself) came from corporate jobs. And man, were we happy when we decided to leave. Get ‘corporate’ out of your system There’s a reason a lot of us went the corporate route before we found our way to the startup world. Growing up, we were encouraged to seek out traditional jobs and be employed by large companies that were regarded as more stable and prestigious. A career Mom and Dad could brag about. I almost feel like going corporate is sort of like a rite of passage. For some of us, though, the corporate, ‘prestigious’ jobs don’t always live up to expectations. Are we sacrificing our own personal happiness and fulfillment by settling for a day job? My husband and co-founder, Marc, was a fresh grad when he did his time as an algorithmic trader at an investment bank. From the outside, it looked like the coolest job ever. Every day, he rode the shiny elevators up to the 52nd floor where he had an amazing view of the Hong Kong harbour. He wore a slim suit and shiny leather shoes, and his desk looked like something out of the Matrix (minus the grunginess) — seven monitors all lit up so he could keep track of the volatile markets. But the work itself was completely uninspiring. He was moving millions of dollars on the stock exchange and with the touch of a button, he was helping the rich get richer. He and the other traders were assigned a lot of grunt work — essentially inputting data into spreadsheets manually. When he proposed building a script to automate the process, his supervisor shut him down citing too much overhead to get a new process approved. Marc was told to continue doing things the way everyone else had always done. Marc left the bank a year later. Many of his friends and colleagues wanted to leave, too. But the money was good, and they had already been there for years. They were comfortable. Taking the leap to another career — especially entrepreneurship — was risky, scary even. How much of our identities are wrapped up in what society expects of us? Are we pursuing a career path because others expect us to? And are we sacrificing our own personal happiness and fulfillment by settling for a day job? Why we love side hustlers We’re pretty choosy about who we bring on board. Engineers, for example, go through a rather intensive process: a phone screen, an in-person coffee meeting, a hack session, an assignment, and finally, they meet the team over lunch before they’re hired. If you pull the entrepreneur out of the employee, there you’ll find a leader. Culture fit and technical skills are extremely important to us, for sure. But one of the biggest determining factors is whether or not the candidate has a sense of entrepreneurship. We look for candidates who have side hustles. We look for candidates who are entrepreneurs because they know first-hand what it’s like to build a company from the ground up. Some haven’t yet had the opportunity to be an entrepreneur, so we look for those who have the potential to someday be one. Some questions we ask when we look for entrepreneurial traits in a candidate: This has been especially important in the past year, as we’ve been laying the foundations for growth. As a small company, we have the opportunity and the responsibility to get things done — swiftly and without much overhead. You notice something is broken? Fix it! Forget bureaucracy. Take action and do the right thing. Everyone here values autonomy, transparency, and takes ownership of the company in some way. At a recent meeting, I told our team: “Each and every one of you is an entrepreneur at heart. You have the drive, the ability, and the relentless optimism to build something amazing.” Now, doesn’t that sound like fun? Some of our side hustles Here are some of the entrepreneurial ventures our team members have taken on. Some team members are continuing these projects as side hustles: Rennie Haylock Rennie has too many side hustles to name, but one of my favorites is an app called Ferret, which basically helps you find great restaurants in your area by checking out beautifully, curated photos shared via social media by other foodies. Think of it as Instagram + Yelp for finding good food nearby. Soraiya Salemohamed Soraiya might be a new grad, but she’s been hustling for years as a freelance marketing consultant. She’s also done work for PeaceGeeks, a global non-profit organization that uses technology to help grassroots organizations promote peace, accountability and human rights. Philip Chung Philip took his passion for gaming and hacked together a web app that measures performance for online gamers. Gamers can compare their scores, averages, and rankings on XIVDPS. Suzanne Ma (Me!) Prior to joining Routific, I spent 5 years researching, writing and publishing my first book, MEET ME IN VENICE. It’s a work of narrative nonfiction about the Chinese immigrant experience. It was featured in Barnes and Nobles stores across the U.S. and Chapters-Indigo stores across Canada. Like what you’re reading? Hit ❤ below and follow us to read more. ", "title": "Why entrepreneurs make the best startup employees", "sentences": [{"520b": "Why entrepreneurs make the best startup employees"}, {"5e8e": "You can tell a lot about a person by their side hustle."}, {"1f67": "When I’m looking for candidates to join our growing startup, it’s pretty much mandatory they have at least one."}, {"4b47": "I used to be a side hustler myself. A few years ago, I was working hard at getting my first book published. I worked on the manuscript at home in the daytime before going into the newsroom for my evening shift as a web reporter."}, {"c680": "People take on side hustles for a variety of reasons. There’s the extra cash. But most of the time, it’s because they’re motivated to do something more than what their day (or night) job allows. Many feel unfulfilled at work, stuck in a job that offers them little freedom and creativity."}, {"315e": "But if you pull the entrepreneur out of the employee, there you’ll find a leader."}, {"3ff2": "It’s no surprise that all four co-founders at my company (including myself) came from corporate jobs. And man, were we happy when we decided to leave."}, {"8c2a": "Get ‘corporate’ out of your system"}, {"b68a": "There’s a reason a lot of us went the corporate route before we found our way to the startup world. Growing up, we were encouraged to seek out traditional jobs and be employed by large companies that were regarded as more stable and prestigious. A career Mom and Dad could brag about."}, {"8636": "I almost feel like going corporate is sort of like a rite of passage. For some of us, though, the corporate, ‘prestigious’ jobs don’t always live up to expectations."}, {"9773": "Are we sacrificing our own personal happiness and fulfillment by settling for a day job?"}, {"0b92": "My husband and co-founder, Marc, was a fresh grad when he did his time as an algorithmic trader at an investment bank. From the outside, it looked like the coolest job ever. Every day, he rode the shiny elevators up to the 52nd floor where he had an amazing view of the Hong Kong harbour. He wore a slim suit and shiny leather shoes, and his desk looked like something out of the Matrix (minus the grunginess) — seven monitors all lit up so he could keep track of the volatile markets."}, {"4742": "But the work itself was completely uninspiring. He was moving millions of dollars on the stock exchange and with the touch of a button, he was helping the rich get richer."}, {"bbba": "He and the other traders were assigned a lot of grunt work — essentially inputting data into spreadsheets manually. When he proposed building a script to automate the process, his supervisor shut him down citing too much overhead to get a new process approved. Marc was told to continue doing things the way everyone else had always done."}, {"469c": "Marc left the bank a year later. Many of his friends and colleagues wanted to leave, too. But the money was good, and they had already been there for years. They were comfortable. Taking the leap to another career — especially entrepreneurship — was risky, scary even."}, {"bb21": "How much of our identities are wrapped up in what society expects of us? Are we pursuing a career path because others expect us to? And are we sacrificing our own personal happiness and fulfillment by settling for a day job?"}, {"6e74": "Why we love side hustlers"}, {"1574": "We’re pretty choosy about who we bring on board. Engineers, for example, go through a rather intensive process: a phone screen, an in-person coffee meeting, a hack session, an assignment, and finally, they meet the team over lunch before they’re hired."}, {"6d07": "If you pull the entrepreneur out of the employee, there you’ll find a leader."}, {"660c": "Culture fit and technical skills are extremely important to us, for sure. But one of the biggest determining factors is whether or not the candidate has a sense of entrepreneurship."}, {"a914": "We look for candidates who have side hustles. We look for candidates who are entrepreneurs because they know first-hand what it’s like to build a company from the ground up. Some haven’t yet had the opportunity to be an entrepreneur, so we look for those who have the potential to someday be one."}, {"8beb": "Some questions we ask when we look for entrepreneurial traits in a candidate:"}, {"68bb": "This has been especially important in the past year, as we’ve been laying the foundations for growth."}, {"e217": "As a small company, we have the opportunity and the responsibility to get things done — swiftly and without much overhead. You notice something is broken? Fix it! Forget bureaucracy. Take action and do the right thing."}, {"738e": "Everyone here values autonomy, transparency, and takes ownership of the company in some way."}, {"bd13": "At a recent meeting, I told our team: “Each and every one of you is an entrepreneur at heart. You have the drive, the ability, and the relentless optimism to build something amazing.”"}, {"757a": "Now, doesn’t that sound like fun?"}, {"8f06": "Some of our side hustles"}, {"d620": "Here are some of the entrepreneurial ventures our team members have taken on. Some team members are continuing these projects as side hustles:"}, {"e49b": "Rennie Haylock"}, {"a979": "Rennie has too many side hustles to name, but one of my favorites is an app called Ferret, which basically helps you find great restaurants in your area by checking out beautifully, curated photos shared via social media by other foodies. Think of it as Instagram + Yelp for finding good food nearby."}, {"5648": "Soraiya Salemohamed"}, {"2be2": "Soraiya might be a new grad, but she’s been hustling for years as a freelance marketing consultant. She’s also done work for PeaceGeeks, a global non-profit organization that uses technology to help grassroots organizations promote peace, accountability and human rights."}, {"7467": "Philip Chung"}, {"d6e5": "Philip took his passion for gaming and hacked together a web app that measures performance for online gamers. Gamers can compare their scores, averages, and rankings on XIVDPS."}, {"461a": "Suzanne Ma (Me!)"}, {"b3f8": "Prior to joining Routific, I spent 5 years researching, writing and publishing my first book, MEET ME IN VENICE. It’s a work of narrative nonfiction about the Chinese immigrant experience. It was featured in Barnes and Nobles stores across the U.S. and Chapters-Indigo stores across Canada."}, {"c92f": "Like what you’re reading? Hit ❤ below and follow us to read more."}], "child": "772_1\t772_2772_1\t772_2"}