{"name": "776", "parent": "", "content": "Do Not Refuse The Corporate Culture A letter from my dad about how to make my company bigger. My dad was a government auditor for 35 years plus. He never expected me to be an entrepreneur. At the first, he did not support me, but now he is the one who regularly give me advices about running a company. A few days ago, he sent me an email (in Bahasa Indonesia) that I thought it was a very good advice and I would like to share it to another startup founder. Here is the email which I translate into English. Assalamu’alaikum wr. wb., Just for refreshment. Don’t ignore internal control. The startup world tends to neglect the corporate culture, because startup needs to be fast, spontaneous, and less (long) bureaucracy. With bigger (startup) organization size and scalability, there’s no reason for not accepting the corporate culture. For early stage company, especially a technology company, agile concept, fast pace, spontaneous, and risk taking culture should be maintained to release the innovative product faster; get a lot of feedbacks from user and doing next iteration. For product development, it is very good approach. But when the company turns to be a mature company, the company culture should turns to be mature also. When the size of the company is getting bigger and bigger, the line of products or service is getting more, and the number of clients or users is increasing, that’s the moment to adopt the corporate culture into the company. Of course, you’ll get conflicts in every aspect in the company. Moreover if many people are involved in it, e.g. investors and employees, but this is an adjustment that the company need. Corporate culture will help you to control the operation of the company to be more efficient and stay effective, also it can secure your company asset. [David] said, “He has certainly wronged you in demanding your ewe [in addition] to his ewes. And indeed, many associates oppress one another, except for those who believe and do righteous deeds — and few are they.” And David became certain that We had tried him, and he asked forgiveness of his Lord and fell down bowing [in prostration] and turned in repentance [to Allah ]. — Quran surah Saad:24 Usually startup can be very messy when it starts to go into the corporation operational matters such as legal, finance, HR, etc. More time you spend to reject the corporate culture, faster your company will die. Embracing the corporate culture will become an important step to bring your company into higher level. Even though Asep (me) is a CTO and a programmer, but don’t forget you are a guy who had taken accounting major in college, so you won’t forget the element of internal control. Ok? Unless you want to be a startup, forever. Wassalamu’alaikum wr. wb. The last sentence is very bold. You want to be a startup forever or go into higher level. Thanks, my dad. ", "title": "Do Not Refuse The Corporate Culture", "sentences": [{"8e7e": "Do Not Refuse The Corporate Culture"}, {"bd06": "A letter from my dad about how to make my company bigger."}, {"7984": "My dad was a government auditor for 35 years plus. He never expected me to be an entrepreneur. At the first, he did not support me, but now he is the one who regularly give me advices about running a company."}, {"58e8": "A few days ago, he sent me an email (in Bahasa Indonesia) that I thought it was a very good advice and I would like to share it to another startup founder. Here is the email which I translate into English."}, {"a6bd": "Assalamu’alaikum wr. wb.,"}, {"cee5": "Just for refreshment. Don’t ignore internal control."}, {"3d4d": "The startup world tends to neglect the corporate culture, because startup needs to be fast, spontaneous, and less (long) bureaucracy. With bigger (startup) organization size and scalability, there’s no reason for not accepting the corporate culture."}, {"ac4b": "For early stage company, especially a technology company, agile concept, fast pace, spontaneous, and risk taking culture should be maintained to release the innovative product faster; get a lot of feedbacks from user and doing next iteration. For product development, it is very good approach. But when the company turns to be a mature company, the company culture should turns to be mature also. When the size of the company is getting bigger and bigger, the line of products or service is getting more, and the number of clients or users is increasing, that’s the moment to adopt the corporate culture into the company. Of course, you’ll get conflicts in every aspect in the company. Moreover if many people are involved in it, e.g. investors and employees, but this is an adjustment that the company need. Corporate culture will help you to control the operation of the company to be more efficient and stay effective, also it can secure your company asset."}, {"d902": "[David] said, “He has certainly wronged you in demanding your ewe [in addition] to his ewes. And indeed, many associates oppress one another, except for those who believe and do righteous deeds — and few are they.” And David became certain that We had tried him, and he asked forgiveness of his Lord and fell down bowing [in prostration] and turned in repentance [to Allah ]. — Quran surah Saad:24"}, {"1c87": "Usually startup can be very messy when it starts to go into the corporation operational matters such as legal, finance, HR, etc. More time you spend to reject the corporate culture, faster your company will die. Embracing the corporate culture will become an important step to bring your company into higher level."}, {"9e63": "Even though Asep (me) is a CTO and a programmer, but don’t forget you are a guy who had taken accounting major in college, so you won’t forget the element of internal control. Ok?"}, {"151f": "Unless you want to be a startup, forever."}, {"d09d": "Wassalamu’alaikum wr. wb."}, {"62e7": "The last sentence is very bold. You want to be a startup forever or go into higher level. Thanks, my dad."}], "child": "776_1776_1776_1"}