{"name": "795", "parent": "", "content": "Save, dans les coulisses d’une aventure pas comme les autres. J’ai toujours été attiré par l’idée d’entreprendre. Petit, mon cerveau bouillonnait d’idées innovantes. Supermarché bio, basket Nike à suspension hydraulique, plateforme d’immobilier Erasmus, pour moi c’était claire, il fallait que je créé un machin d’innovant. Mais par où commencer ? et quand ? Compliqué pour le doux rêveur que j’étais de me lancer. Save sera mon cas d’école, 4 ans d’aventure qui m’apprendront la vie en entreprise en concentré. Prémices On avait 21 ans quand Damien nous a réunis la première fois pour nous parler de son projet. Ouvrir une boutique de réparation dans Paris sous l’enseigne Save my Smartphone. Je dois avouer qu’on y avait pas cru une seconde à ce moment là mais j’ai tout de même passé un peu de temps avec lui sur son concept marketing, je lui ai notamment présenté le graphiste à l’origine de son identité visuelle. La réalité, c’est qu’on le prenait un peu pour un dingue à cette époque là. Il ouvrira quelques mois plus tard sa boutique, et là, curiosité oblige, je me suis mis à tourner autour du projet. Je finirai par le rejoindre pour un side project avec Valentin Konrad : Lease my Smartphone. Cet été là, j’avais prévu de partir à NY pour y travailler dans des restaurants français, Valentin et Damien me feront plier et annuler tout mon séjour pour rester avec eux dans la pépinière de Boulogne Billancourt. J’ai retrouvé cette semaine un pitch vidéo de Valentin qui m’expliquait pourquoi je devais rester avec lui, en arrière plan Damien au téléphone qui vendait son projet, surement à un journaliste. J’ai beaucoup ri en l’entendant : “Nous avons une boutique dans le 16ème et un siège social à Boulogne Billancourt car nous prévoyons d’ouvrir d’autres boutiques très rapidement ainsi que levée de nouveaux fonds” En 2013 il avait déjà la vision deep :) Le projet de Leasing tombera à l’eau mais nous resterons dans les mois qui suivirent en étroite collaboration sur d’autres projets, dont un qui sera finalement développé par Valentin et qui est toujours en activité aujourd’hui : Flatchr. Keep it on bro ❤ Save my Smartphone Suisse Damien me proposera à plusieurs reprises de le rejoindre dans l’aventure et c’est finalement d’une manière assez originale que je le ferai. Pour moi à cette époque, il était encore impossible de m’imaginer sous l’ombre de mon meilleur ami comme patron. Je partirai donc en Suisse pour ouvrir la première franchise de Save my Smartphone avec un investisseur local. J’ai pris ma petite smart, foutu toute ma vie dans son minuscule coffre et suis parti direction Lausanne. J’y ouvrirai une première boutique en avril 2014.La pire période de ma vie. Loin de ma famille, de mes amis, dans une ville ou je ne connaissais personne, où rien ne me réussira. Mon investisseur me laissera tomber dans la difficulté, je devrai arrêter de me salarier pour vivre dans l’arrière boutique pendant plusieurs mois de plan d’austérité forcé, afin de sauvegarder l’activité. Plus tard, j’ai pris mes salariés la main dans le sac pour vol organisé et j’ai du faire face à des concurrents menaçants, lorsque j’oserai finalement leur prendre quelques parts de marché. Une première page se tournera lorsque Damien viendra me rendre visite avec son nouvel associé, Cyril Montanari, Senior et Expert retail. Je me souviendrais toujours de la tronche qu’il a tiré en voyant l’emplacement de ma boutique du moment. “Tu ne feras jamais un rond dans ta boutique. Tu t’es mis à l’abris du commerce. Tu dois bouger et vite !” Sur ses conseils je quitterai ce local pour lancer des corners éphémères dans des centres commerciaux beaucoup plus fréquentés, et là l’activité a enfin démarré. Quelques corners plus tard, Damien réussira à me convaincre de monter le rejoindre à Paris. Ca devenait sérieux du côté de la pépinière de Boulogne avec la préparation d’un développement important de magasins en IDF. Il n’était plus question pour moi de réfléchir à l’offre. Retour en France, 0 to 1 Je rentre en avril 2015 à Paris, au milieu des premières phases de déploiement de corners Save en France. C’est la période d’euphorie. La belle vie au bureau, musique à fond au milieu des open spaces, batailles de Nerf chroniques et soirées arrosées tout au long de la semaine. Une période d’autant plus heureuse pour moi que je revenais de 12 mois bloqué dans les montagnes suisses à manger du fromage fondu. Les équipes s’étoffaient, on commençait seulement à construire une hiérarchie et à proposer des bribes de process. La vie était encore très simple à cette époque. On avait un contact direct avec le terrain ainsi que tous les autres services de la société et c’était très bien. Puis viendra notre première levée de fonds. Très vite, nous deviendrons l’égérie officielle de TheFamily. Notre déploiement opérationnel laissait tout le monde perplexe, c’était du jamais vue. Je me souviens de Stéphane Soumier qui perdait les pédales sur le plateau BFM à la simple lecture de nos datas du moment. De 1 à 80 points de ventes en 10 mois. De 200.000€ de CA par an, à 200.000€ de CA par jour. On en revenait pas nous même, c’était trop facile. Et c’est la que notre monde a basculé. Les gens se sont mis à nous regarder autrement. D’un seul coup nous n’étions plus seulement de petits jeunes ambitieux à leurs yeux. Nous devenions des demi-dieux. https://www.youtube.com/watch?v=9tcrPyX3nY8 Le meilleur moment du mois, c’était le diner mensuel TheFamily ou nous arrivions fièrement tous avec nos t-shirts Save like rockstars. Les autres startupeurs qui vous demandaient des conseils sur leurs projets, des heures de mentoring alors que fondamentalement, nous n’avions rien fait de sorcier. C’était assez troublant, car bien sur nous n’avions aucune légitimité, nous étions victime de notre succès. Et le problème c’est que ce débordement d’attention vous donne un excès de confiance en vous. Confiance en nous qui viendra à l’encontre de la santé de notre entreprise, puisque nous n’avions plus les pieds sur terre. Crise de croissance Heureusement cette euphorie s’est éteinte très rapidement. Retour à la réalité lorsque l’on décida d’ouvrir nos filiales dans 5 pays d’Europe en même temps entre septembre et novembre 2016. On enchainait pour le bien commun de l’entreprise sprint sur sprint en frôlant les burn-out, mais complètement surboosté par l’exposition médiatique de notre aventure. Durant cette période, l’organisation de l’entreprise se modifiera beaucoup pour supporter l’intégration de nouveaux pays. Nous recruterons seniors experts et assistantes de direction. De nouvelles couches de hiérarchie s’empileront jusqu’au jour, catastrophés, certains se rendront compte de l’impasse dans laquelle nous nous étions engouffrés. La structure était devenue trop lourde, nous étions paralysés. Je pense que j’ai eu personnellement le déclic le jour où j’ai vu nos Country Manager Sweden et UK se battrent pour avoir la meilleure caisse de fonction allemande Nous lancerons alertes sur alertes à notre management en place, seulement nous étions les jeunes ils étaient les vieux, nous les avions embauchés pour leurs compétences, ils nous demandèrent de leur faire confiance… Imaginez la frustration de voir sa société partir au tapis sans avoir la main pour intervenir. C’est le moment que j’ai choisi pour lever le pied, pour le bien de ma santé morale et physique. J’ai commencé à m’aménager du temps pour reprendre une activité sportive, voir des gens en dehors de Save. Je sentais que si je ne le faisais pas, la chute serait trop dure. Et je me félicite de ce choix, il m’a donné de la force dans la difficulté qui suivit. Les problèmes de grands A jouer les demi dieux on oublie parfois de garder les pieds sur terre. Le développement se travail, se prépare, le succès se mérite. La chute sera très lourde. Vous connaissez la version officielle. Dans les coulisses c’était encore pire. Lancer des plans sociaux dans une entreprise de + de 500 collaborateurs, c’est un moment très dur. Si vous n’êtes pas très vigilant, votre société par avec. Dans le meilleur des cas, organiser la sortie de chaque employé pour que son service continue à tourner malgré son départ. Dans le pire des cas, fouiller certains d’entre eux pour être sûr qu’ils ne partent pas les poches pleines. Tentatives de coups d’état, grèves sectorisées, risque de grève générale, ce fût notre quotidien durant toute cette période. Aussi bizarre que cela puisse paraître, vous vous découvrez une énergie supplémentaire dans ces moments. Agrémenté d’adrenaline, vous êtes dans un combat, et votre corps sait que vous ne pouvez pas baisser les bras. Donc vous vous durcissez, votre visage s’assombrit. Mais la légitimité, elle, est là pour une fois. En réalité nous avons commencé à tirer profit de l’expérience Save dans la crise. Lorsque l’on brille on est aveuglé. Retranchez vous sur vous même et vous découvrirez la pale couleur de la réalité. Epilogue Aujourd’hui, avril 2017. Nous retombons sur nos pieds. Nous ne pouvions pas plier. 80 magasins en France et en Suède qui sauvent les appareils de plus de 30.000 clients tous les mois. Ce n’est pas une boite à abandonner.L’issue ne sera pas la plus attendue. Nous sortons par la porte de service et laissons un groupe industriel à la barre du vaisseau. Notre fierté, avoir sauvegardé la marque et ses collaborateurs les plus dévoués au delà de vents et marrés. Une nouvelle page s’ouvre pour Save, surement moins tourmentée et du coup beaucoup moins passionnée, mais nous serons là pour l’accompagner et qui sait, peut être pourrons nous continuer à nous aimer ❤. ", "title": "Save, dans les coulisses d’une aventure pas comme les autres.", "sentences": [{"2470": "Save, dans les coulisses d’une aventure pas comme les autres."}, {"2fb8": "J’ai toujours été attiré par l’idée d’entreprendre. Petit, mon cerveau bouillonnait d’idées innovantes. Supermarché bio, basket Nike à suspension hydraulique, plateforme d’immobilier Erasmus, pour moi c’était claire, il fallait que je créé un machin d’innovant. Mais par où commencer ? et quand ? Compliqué pour le doux rêveur que j’étais de me lancer. Save sera mon cas d’école, 4 ans d’aventure qui m’apprendront la vie en entreprise en concentré."}, {"29cf": "Prémices"}, {"4ece": "On avait 21 ans quand Damien nous a réunis la première fois pour nous parler de son projet. Ouvrir une boutique de réparation dans Paris sous l’enseigne Save my Smartphone. Je dois avouer qu’on y avait pas cru une seconde à ce moment là mais j’ai tout de même passé un peu de temps avec lui sur son concept marketing, je lui ai notamment présenté le graphiste à l’origine de son identité visuelle. La réalité, c’est qu’on le prenait un peu pour un dingue à cette époque là. Il ouvrira quelques mois plus tard sa boutique, et là, curiosité oblige, je me suis mis à tourner autour du projet. Je finirai par le rejoindre pour un side project avec Valentin Konrad : Lease my Smartphone. Cet été là, j’avais prévu de partir à NY pour y travailler dans des restaurants français, Valentin et Damien me feront plier et annuler tout mon séjour pour rester avec eux dans la pépinière de Boulogne Billancourt. J’ai retrouvé cette semaine un pitch vidéo de Valentin qui m’expliquait pourquoi je devais rester avec lui, en arrière plan Damien au téléphone qui vendait son projet, surement à un journaliste. J’ai beaucoup ri en l’entendant :"}, {"96fb": "“Nous avons une boutique dans le 16ème et un siège social à Boulogne Billancourt car nous prévoyons d’ouvrir d’autres boutiques très rapidement ainsi que levée de nouveaux fonds” En 2013 il avait déjà la vision deep :)"}, {"1c07": "Le projet de Leasing tombera à l’eau mais nous resterons dans les mois qui suivirent en étroite collaboration sur d’autres projets, dont un qui sera finalement développé par Valentin et qui est toujours en activité aujourd’hui : Flatchr. Keep it on bro ❤"}, {"de36": "Save my Smartphone Suisse"}, {"1608": "Damien me proposera à plusieurs reprises de le rejoindre dans l’aventure et c’est finalement d’une manière assez originale que je le ferai. Pour moi à cette époque, il était encore impossible de m’imaginer sous l’ombre de mon meilleur ami comme patron. Je partirai donc en Suisse pour ouvrir la première franchise de Save my Smartphone avec un investisseur local. J’ai pris ma petite smart, foutu toute ma vie dans son minuscule coffre et suis parti direction Lausanne. J’y ouvrirai une première boutique en avril 2014.La pire période de ma vie. Loin de ma famille, de mes amis, dans une ville ou je ne connaissais personne, où rien ne me réussira."}, {"9b4e": "Mon investisseur me laissera tomber dans la difficulté, je devrai arrêter de me salarier pour vivre dans l’arrière boutique pendant plusieurs mois de plan d’austérité forcé, afin de sauvegarder l’activité."}, {"a691": "Plus tard, j’ai pris mes salariés la main dans le sac pour vol organisé et j’ai du faire face à des concurrents menaçants, lorsque j’oserai finalement leur prendre quelques parts de marché. Une première page se tournera lorsque Damien viendra me rendre visite avec son nouvel associé, Cyril Montanari, Senior et Expert retail. Je me souviendrais toujours de la tronche qu’il a tiré en voyant l’emplacement de ma boutique du moment."}, {"2ed3": "“Tu ne feras jamais un rond dans ta boutique. Tu t’es mis à l’abris du commerce. Tu dois bouger et vite !”"}, {"247a": "Sur ses conseils je quitterai ce local pour lancer des corners éphémères dans des centres commerciaux beaucoup plus fréquentés, et là l’activité a enfin démarré. Quelques corners plus tard, Damien réussira à me convaincre de monter le rejoindre à Paris. Ca devenait sérieux du côté de la pépinière de Boulogne avec la préparation d’un développement important de magasins en IDF. Il n’était plus question pour moi de réfléchir à l’offre."}, {"4fa4": "Retour en France, 0 to 1"}, {"358a": "Je rentre en avril 2015 à Paris, au milieu des premières phases de déploiement de corners Save en France. C’est la période d’euphorie. La belle vie au bureau, musique à fond au milieu des open spaces, batailles de Nerf chroniques et soirées arrosées tout au long de la semaine. Une période d’autant plus heureuse pour moi que je revenais de 12 mois bloqué dans les montagnes suisses à manger du fromage fondu."}, {"9747": "Les équipes s’étoffaient, on commençait seulement à construire une hiérarchie et à proposer des bribes de process. La vie était encore très simple à cette époque. On avait un contact direct avec le terrain ainsi que tous les autres services de la société et c’était très bien."}, {"aafa": "Puis viendra notre première levée de fonds."}, {"c0cf": "Très vite, nous deviendrons l’égérie officielle de TheFamily. Notre déploiement opérationnel laissait tout le monde perplexe, c’était du jamais vue. Je me souviens de Stéphane Soumier qui perdait les pédales sur le plateau BFM à la simple lecture de nos datas du moment. De 1 à 80 points de ventes en 10 mois. De 200.000€ de CA par an, à 200.000€ de CA par jour. On en revenait pas nous même, c’était trop facile. Et c’est la que notre monde a basculé. Les gens se sont mis à nous regarder autrement."}, {"a30c": "D’un seul coup nous n’étions plus seulement de petits jeunes ambitieux à leurs yeux. Nous devenions des demi-dieux."}, {"edae": "https://www.youtube.com/watch?v=9tcrPyX3nY8"}, {"320c": "Le meilleur moment du mois, c’était le diner mensuel TheFamily ou nous arrivions fièrement tous avec nos t-shirts Save like rockstars. Les autres startupeurs qui vous demandaient des conseils sur leurs projets, des heures de mentoring alors que fondamentalement, nous n’avions rien fait de sorcier. C’était assez troublant, car bien sur nous n’avions aucune légitimité, nous étions victime de notre succès. Et le problème c’est que ce débordement d’attention vous donne un excès de confiance en vous. Confiance en nous qui viendra à l’encontre de la santé de notre entreprise, puisque nous n’avions plus les pieds sur terre."}, {"a784": "Crise de croissance"}, {"6bf6": "Heureusement cette euphorie s’est éteinte très rapidement. Retour à la réalité lorsque l’on décida d’ouvrir nos filiales dans 5 pays d’Europe en même temps entre septembre et novembre 2016. On enchainait pour le bien commun de l’entreprise sprint sur sprint en frôlant les burn-out, mais complètement surboosté par l’exposition médiatique de notre aventure. Durant cette période, l’organisation de l’entreprise se modifiera beaucoup pour supporter l’intégration de nouveaux pays. Nous recruterons seniors experts et assistantes de direction. De nouvelles couches de hiérarchie s’empileront jusqu’au jour, catastrophés, certains se rendront compte de l’impasse dans laquelle nous nous étions engouffrés. La structure était devenue trop lourde, nous étions paralysés."}, {"8e7e": "Je pense que j’ai eu personnellement le déclic le jour où j’ai vu nos Country Manager Sweden et UK se battrent pour avoir la meilleure caisse de fonction allemande"}, {"ed9b": "Nous lancerons alertes sur alertes à notre management en place, seulement nous étions les jeunes ils étaient les vieux, nous les avions embauchés pour leurs compétences, ils nous demandèrent de leur faire confiance… Imaginez la frustration de voir sa société partir au tapis sans avoir la main pour intervenir. C’est le moment que j’ai choisi pour lever le pied, pour le bien de ma santé morale et physique. J’ai commencé à m’aménager du temps pour reprendre une activité sportive, voir des gens en dehors de Save. Je sentais que si je ne le faisais pas, la chute serait trop dure. Et je me félicite de ce choix, il m’a donné de la force dans la difficulté qui suivit."}, {"cf9c": "Les problèmes de grands"}, {"462a": "A jouer les demi dieux on oublie parfois de garder les pieds sur terre. Le développement se travail, se prépare, le succès se mérite."}, {"8bc6": "La chute sera très lourde. Vous connaissez la version officielle. Dans les coulisses c’était encore pire. Lancer des plans sociaux dans une entreprise de + de 500 collaborateurs, c’est un moment très dur. Si vous n’êtes pas très vigilant, votre société par avec. Dans le meilleur des cas, organiser la sortie de chaque employé pour que son service continue à tourner malgré son départ. Dans le pire des cas, fouiller certains d’entre eux pour être sûr qu’ils ne partent pas les poches pleines. Tentatives de coups d’état, grèves sectorisées, risque de grève générale, ce fût notre quotidien durant toute cette période."}, {"55da": "Aussi bizarre que cela puisse paraître, vous vous découvrez une énergie supplémentaire dans ces moments. Agrémenté d’adrenaline, vous êtes dans un combat, et votre corps sait que vous ne pouvez pas baisser les bras. Donc vous vous durcissez, votre visage s’assombrit. Mais la légitimité, elle, est là pour une fois."}, {"7774": "En réalité nous avons commencé à tirer profit de l’expérience Save dans la crise. Lorsque l’on brille on est aveuglé. Retranchez vous sur vous même et vous découvrirez la pale couleur de la réalité."}, {"79b4": "Epilogue"}, {"6cc9": "Aujourd’hui, avril 2017. Nous retombons sur nos pieds. Nous ne pouvions pas plier. 80 magasins en France et en Suède qui sauvent les appareils de plus de 30.000 clients tous les mois. Ce n’est pas une boite à abandonner.L’issue ne sera pas la plus attendue. Nous sortons par la porte de service et laissons un groupe industriel à la barre du vaisseau. Notre fierté, avoir sauvegardé la marque et ses collaborateurs les plus dévoués au delà de vents et marrés. Une nouvelle page s’ouvre pour Save, surement moins tourmentée et du coup beaucoup moins passionnée, mais nous serons là pour l’accompagner et qui sait, peut être pourrons nous continuer à nous aimer ❤."}], "child": "795_1\t795_2\t795_3\t795_4"}