{"name": "799", "parent": "", "content": "Why you should kill your cash cow Before two guys in a garage do it for you. Blackberry revenue (in million US dollars) Last week, in early 2017, Gartner reported that Blackberry’s hardware business had officially crumbled into dust, with a global market share of 0.0%. Yes, you read that right. Zero. Nil. Zilch. Nada. What really happened? Did Blackberry really just die now? Not really. They were dead as far back as in 2007, when the iPhone launched. Ex-Blackberry chief executive Jim Balsillie admitted as much a couple of years back. The graph shown above was alas, just a lagging indicator. What’s funny is that till 2009, two years after the iPhone launched, the company commanded almost 25% of the global smartphone market, prompting Fortune to call it the fastest growing company in the world. Not only that, but the company’s revenue rose by over 4x and peaked a full four years after the launch of the iPhone. Apple entered the smartphone industry by pioneering a paradigm shift from the enterprise to the then-tiny consumer market. There was no way Blackberry, with its huge captive customer base, consisting of some of the biggest businesses around the world and the massive IT contracts associated with it, could have have disrupted its then hugely successful business model and product portfolio to adjust to the changing world around it. The only other option left, unfortunately, was then to get disrupted by another. It’s not hard to imagine an intern fascinated with the iPhone gushing to his bosses at RIM about it. “The iPhone? Pffft. Just look at their numbers and then look at ours! Go on now, sell some more of those IT contracts.” Even though they were dead in 2007, the fallacy of following lagging indicators like revenue and profits did them in, as revenues continued to go up and peaked in 2011. We’re killing it! Revenue fell in 2012. Uh oh. Then it fell even more sharply in 2013. What’s really going on??? By the time they kicked out the CEO, and invested in newer ‘consumer-ready’ products, that race had already been run and winners emerged. Started from the bottom, now we here “Will Netflix ever overtake us? That’s like saying the Albanian army will take over the world.” — Jeff Bewkes, CEO, Time Warner in early 2009. The morbid inevitability of product life cycles The life cycle of technology products is almost embarrassingly predictable. It is best represented by an S-curve, based on decades of empirical evidence as seen in countless industries. The product life-cycle curve A new product starts out by seeking product-market fit. Here it eats more cash than it makes. The product iteratively tries to find stickiness with a particular market segment, seeking the holy grail in tech: product-market fit. After reaching critical mass, the product begins to take off as the elusive fit is achieved. Sales pick up steam and focus is then shifted onto scaling the product to the biggest possible addressable market. As time goes on, the market starts maturing, the product becomes standardised and closes in on achieving maximum efficiency, having seen successive innovations. Margins and market share are at their highest here. The curve of innovation now starts to flatten as incremental additions are made. Just as this curve starts to flatten, newer products start appearing. They begin from the bottom end of the market, capturing niches. Slower at first and then faster, the disruptor catches up to the incumbent in terms of performance and cost. The disruptor then starts eating more and more of the market, replacing the incumbent and beginning a whole new S-curve of their own. In technology, this cycle is on constant repeat. The development of technologies tends to follow an S-Curve: they improve slowly, then quickly, and then slowly again. And at that last stage, they’re really, really good. Everything has been optimised and worked out and understood, and they’re fast, cheap and reliable. That’s also often the point that a new architecture comes to replace them. — Benedict Evans The only path then, to build a lasting tech company, lies in successfully making the jump from one S-curve to another. The jump that Blackberry never made. Despite the depressingly cyclical nature of products being common knowledge and in plain sight, it’s shocking how many companies refuse to see it and leave themselves ripe for disruption. The BCG matrix and its long-forgotten truth In fact, the Boston Consulting group developed a matrix as early as 1970, required reading for any B-school graduate, which explains what is to be done with respect to this recurring phenomenon. The BCG Matrix The matrix has four quadrants to categorise businesses by relative market share and rate of market growth. These are basically proxies for estimating how much cash a business is generating vs how much of it is being burnt. When you’re the leader in a mature market, your product generates way more cash than it burns. It’s imperative that you milk your product, called a cash cow, to its very maximum. All technology companies seem to intuitively grasp this and execute ‘milking’ to near perfection. As often, what’s often missed contains perhaps the more important truth, holding the key to successfully straddling successive product cycles and building a lasting company: The BCG model states that the cash generated from cash cows must invariably be routed to R&D expenses and question marks in the matrix. Question marks are products that eat up a lot of cash and show strong potential to grow rapidly, but do not generate much cash in the present. These products though, are the only route to build more stars and in turn cash cows in the future. In simple words, the only reason for cash cows to exist is to allow for the birth of future cash cows. The Boston model assumes markets are stable environments where established companies have a natural advantage. That may have been the case fifty years ago, but it certainly isn’t true today. The pace of change in most markets today has increased beyond recognition, and it’s a shift that’s only going to accelerate. In the age of AWS, the barrier to creating scalable software is almost non-existent and the internet has brought down distribution costs to zero. If anything product life-cycle curves have become shorter and steeper. Companies that don’t grasp these simple truths are now dying faster than ever. (The average life expectancy of a Fortune 500 company today is a mere 15 years vs 75 years back in 1960.) Just when you think you’re onto a cash cow, it’s probably already a dinosaur. Yes, it’s huge but the meteor is coming. It’s inevitable. Is your cash cow a dinosaur already? The innovator’s dilemma Why do innovative incumbents invariably get stuck at this dilemma even though it’s a scenario which has played out countless times throughout history? Why do companies that beat all and sundry to become world leaders come undone by smaller upstarts? Why do they become blind to the shockingly obvious? The reasons are not too far to seek. Incumbents are invariably loathe to get started on the next technology S-curve because from the peak of the existing S-curve, the just-forming new S-curve looks decidedly unattractive. All the incumbents that die fall prey to the illusion of the infinite S-curve, extrapolating their graphs infinitely upward. It doesn’t help that our brains are hardwired to see straight linear sequences, and not curves. The iPhone heralded the rise of the actual ‘smartphone’ product curve As Blackberry was accumulating more and more dollars climbing its peak, the curve of iPhone must have looked decidedly small and inconsequential. Clay Christensen argues in his revolutionary book ‘The Innovator’s Dilemma’ that because innovation happens on a curve, the middle is where most of the value lies and the value at the end and the beginning is minimal. And it is in approaching this highly profitable middle part of the curve, that the incumbent, with a massive customer base and hoarding profits, find its comfort zone, making incremental improvements to it’s existing product. No one notices that as the revenue, profits and total market share curve is approaching its peak, the product life-cycle curve is on the downward trend to irrelevance. And guess which is the only curve Wall Street will have you care about. It’s hard to imagine the next big thing when you already have a big thing right in front of you. Revenue lags the product life-cycle, a point lost on many If you’re the CEO, you have to report quarterly earnings, and Wall Street wants to see those earnings numbers go up every single time. It’s easy to understand the need to sell more and more of cash cows to maximise profits and revenue. The hardest thing to do is to make fundamental changes to your business when you’re making money and are profitable. — Ben Thompson Rarely are you going to be able to convince Wall Street about increasing earnings, particularly in the short run, by burning cash on new initiatives. Except of course, if you’re Amazon. And as you’re climbing the peak and approaching the most valuable part of the S- curve, the organisational focus and strategy shifts to scaling revenue, and innovation is put to the back-burner. Arjun Sethi, of Social capital, believes that in spite of Clay Christensen’s pioneering work being no secret, the middle of the innovation curve lures companies into thinking that their mission is to protect their existing audience and market share — the most fatal mistake of all. This is the point the company’s strategy shifts from being customer-focused to being product (read cash-cow) focused. The company strategy now focuses on scaling revenues of the cash cow in the portfolio. This could primarily involve three routes: This is done by adding more features to the existing product, in turn making the core product more complex, and pushing the company upmarket, down the path of no return. The organisation is now broken into functional silos, with each function singularly focused on their own departmental problems and improving their core metrics. The organisation becomes good at incrementally improving the product for their existing market, not caring for disruptors eating away at the fringes. As revenue is the main prerogative, sales starts influencing more and more decisions and product folks fade into the background. Businesses are like biological organisms — they focus on their “core metric” and will gravitate towards optimising them. It means other paths are less trodden and worth exploring. — Shamik Sharma Watch Steve Jobs talk about the fatal fallacy with this behaviour: This subtle shift in strategy causes a fundamental misunderstanding of the business that the organisation is in. You’re never in the ‘sell-more-of-your-cash-cow’ business. You’re always in the ‘solve-particular-pain-point’ business. As the incumbent starts milking his cash cow, new entrants start to appear. The disruptor, with virtually no captive customer-base, and without the huge weight of scale or history, can now use a first-principles approach to the market and build the best possible solution, given the technological, cultural and social context. The disruptor initially wins over a particular niche, but the incumbent plays it down as too small to ever be significant, not realising the curve is now favourable for the disruptor to ride just as the incumbent’s is soon to be on the downward slope. And then the meteor hits. Now that you’ve recognised the fatal fallacy, How do you solve the Innovator’s Dilemma? By increasing your odds. The very same simple logic that people who win at stocks or casinos do. There are three known ways for it: Of course, even this is not as easy as it sounds. Even if you recognise your place on the S-curve, and double down on building the next big thing, there are many pitfalls. Nothing seems to take more time, cost more money, involve more pitfalls, or cause more confusion, than the launch of ill-conceived new products. The fact is, most new products don’t have any sort of classical life cycle curve at all. Most new products never take off and instead have an infinitely descending curve. So you might need to make multiple new bets to create your next big fat cash cow. “One of my jobs is to encourage people to be bold. It’s incredibly hard. Experiments are, by their very nature, prone to failure. A few big successes compensate for dozens and dozens of things that didn’t work. Bold bets — Amazon Web Services, Kindle, Amazon Prime— all of those things are examples of bold bets that did work, and they pay for a lot of experiments. I’ve made billions of dollars of failures at Amazon.com. Literally billions of dollars of failures. You might remember Pets.com or Kosmo.com. None of those things are fun. But they also don’t matter. What really matters is, companies that don’t continue to experiment, companies that don’t embrace failure, they eventually get in a desperate position where the only thing they can do is a Hail Mary bet at the very end of their corporate existence. Whereas companies that are making bets all along, even big bets, prevail. I don’t believe in bet-the-company bets. That’s when you’re desperate. That’s the last thing you want to do.” — Jeff Bezos You would do well to learn from one of the few companies that has successfully disrupted itself time and again. Apple. Steve Jobs mentions Clay’s work on disruption in his biography to state the one truth Apple fully embraced: If you don’t cannibalize yourself, someone else will. — Steve Jobs In 2007, when Apple launched the iPhone, iPod was their actual cash cow, accounting for close to 50% of revenues. Steve Jobs knew that by integrating all of the iPod functionality into the iPhone, he was cannibalising and killing off their cash cow. If the company strategy was focused around selling more and more of iPods, the iPhone may never have launched. Apple’s core philosophy allows them to embrace the fact that the tech industry cares little for sentiment or history, and lets them jump onto the next innovation curve while still on top. And if that means that they have to cannibalize some of the biggest cash cows in their history, they are only too willing to do it. “Our core philosophy is to never fear cannibalization. If we don’t do it, someone else will. Macintosh killed the Apple II. We know that iPhone has cannibalized some of our iPod business. That doesn’t worry us. We know that iPad will cannibalize some Macs. But that’s not a concern.”- Tim Cook Apple’s organisational structure Apple’s organisational structure also helps them tackle the innovator’s dilemma, and align itself to successive S-curves over and over again. Notice how Apple doesn’t have business heads like a head of iPad, a head of iPod and so on. The company has a singular, unitary structure with just one P&L. Which allows them to focus on the end-consumer instead of their separate products. It’s no surprise that this re-organisation was one of the first things Steve Jobs did on his return to Apple. “We should all be concerned about the future because that’s where we’ll have to spend the rest of our lives.” — Unknown In the end, like all human biases and fallacies, tackling the innovator’s dilemma boils down to consciously recognising your place on the curve and preparing for the inevitable next curve by acting on customer problems with a first-principles approach, and not banking on the presumptive longevity of their products. In every single case where incumbents die, it is because there has been a false sense of belief that consumers will be as obsessed with their products as they themselves are with their cash cows, and failure to recognise and adapt to the changes around them. The lesson then, is to fully embrace the morbid truth that products die and be willing to threaten the very core of your current business to survive the future. If you don’t follow the curve, you’re doomed. ", "title": "Why you should kill your cash cow", "sentences": [{"0a2d": "Why you should kill your cash cow"}, {"ae61": "Before two guys in a garage do it for you."}, {"171c": "Blackberry revenue (in million US dollars)"}, {"ec3f": "Last week, in early 2017, Gartner reported that Blackberry’s hardware business had officially crumbled into dust, with a global market share of 0.0%."}, {"4a29": "Yes, you read that right."}, {"7db9": "Zero."}, {"ceba": "Nil. Zilch. Nada."}, {"b44b": "What really happened? Did Blackberry really just die now?"}, {"8a82": "Not really. They were dead as far back as in 2007, when the iPhone launched. Ex-Blackberry chief executive Jim Balsillie admitted as much a couple of years back."}, {"7a1f": "The graph shown above was alas, just a lagging indicator."}, {"8f82": "What’s funny is that till 2009, two years after the iPhone launched, the company commanded almost 25% of the global smartphone market, prompting Fortune to call it the fastest growing company in the world. Not only that, but the company’s revenue rose by over 4x and peaked a full four years after the launch of the iPhone."}, {"8d53": "Apple entered the smartphone industry by pioneering a paradigm shift from the enterprise to the then-tiny consumer market."}, {"abd5": "There was no way Blackberry, with its huge captive customer base, consisting of some of the biggest businesses around the world and the massive IT contracts associated with it, could have have disrupted its then hugely successful business model and product portfolio to adjust to the changing world around it."}, {"0d1d": "The only other option left, unfortunately, was then to get disrupted by another."}, {"2954": "It’s not hard to imagine an intern fascinated with the iPhone gushing to his bosses at RIM about it."}, {"2428": "“The iPhone? Pffft. Just look at their numbers and then look at ours! Go on now, sell some more of those IT contracts.”"}, {"4a46": "Even though they were dead in 2007, the fallacy of following lagging indicators like revenue and profits did them in, as revenues continued to go up and peaked in 2011. We’re killing it!"}, {"f9bc": "Revenue fell in 2012. Uh oh."}, {"cf8a": "Then it fell even more sharply in 2013. What’s really going on???"}, {"ff98": "By the time they kicked out the CEO, and invested in newer ‘consumer-ready’ products, that race had already been run and winners emerged."}, {"04a3": "Started from the bottom, now we here"}, {"1316": "“Will Netflix ever overtake us? That’s like saying the Albanian army will take over the world.” — Jeff Bewkes, CEO, Time Warner in early 2009."}, {"3f89": "The morbid inevitability of product life cycles"}, {"c093": "The life cycle of technology products is almost embarrassingly predictable. It is best represented by an S-curve, based on decades of empirical evidence as seen in countless industries."}, {"fe58": "The product life-cycle curve"}, {"8ad4": "A new product starts out by seeking product-market fit. Here it eats more cash than it makes."}, {"e838": "The product iteratively tries to find stickiness with a particular market segment, seeking the holy grail in tech: product-market fit."}, {"4927": "After reaching critical mass, the product begins to take off as the elusive fit is achieved. Sales pick up steam and focus is then shifted onto scaling the product to the biggest possible addressable market."}, {"2285": "As time goes on, the market starts maturing, the product becomes standardised and closes in on achieving maximum efficiency, having seen successive innovations. Margins and market share are at their highest here. The curve of innovation now starts to flatten as incremental additions are made."}, {"4ab6": "Just as this curve starts to flatten, newer products start appearing. They begin from the bottom end of the market, capturing niches. Slower at first and then faster, the disruptor catches up to the incumbent in terms of performance and cost. The disruptor then starts eating more and more of the market, replacing the incumbent and beginning a whole new S-curve of their own."}, {"1fab": "In technology, this cycle is on constant repeat."}, {"1506": "The development of technologies tends to follow an S-Curve: they improve slowly, then quickly, and then slowly again. And at that last stage, they’re really, really good. Everything has been optimised and worked out and understood, and they’re fast, cheap and reliable. That’s also often the point that a new architecture comes to replace them. — Benedict Evans"}, {"f806": "The only path then, to build a lasting tech company, lies in successfully making the jump from one S-curve to another."}, {"716e": "The jump that Blackberry never made."}, {"72a1": "Despite the depressingly cyclical nature of products being common knowledge and in plain sight, it’s shocking how many companies refuse to see it and leave themselves ripe for disruption."}, {"10ef": "The BCG matrix and its long-forgotten truth"}, {"5325": "In fact, the Boston Consulting group developed a matrix as early as 1970, required reading for any B-school graduate, which explains what is to be done with respect to this recurring phenomenon."}, {"91c4": "The BCG Matrix"}, {"b7b5": "The matrix has four quadrants to categorise businesses by relative market share and rate of market growth. These are basically proxies for estimating how much cash a business is generating vs how much of it is being burnt."}, {"f4e2": "When you’re the leader in a mature market, your product generates way more cash than it burns. It’s imperative that you milk your product, called a cash cow, to its very maximum. All technology companies seem to intuitively grasp this and execute ‘milking’ to near perfection."}, {"05b6": "As often, what’s often missed contains perhaps the more important truth, holding the key to successfully straddling successive product cycles and building a lasting company: The BCG model states that the cash generated from cash cows must invariably be routed to R&D expenses and question marks in the matrix."}, {"bcea": "Question marks are products that eat up a lot of cash and show strong potential to grow rapidly, but do not generate much cash in the present. These products though, are the only route to build more stars and in turn cash cows in the future."}, {"08a2": "In simple words, the only reason for cash cows to exist is to allow for the birth of future cash cows."}, {"29bb": "The Boston model assumes markets are stable environments where established companies have a natural advantage. That may have been the case fifty years ago, but it certainly isn’t true today. The pace of change in most markets today has increased beyond recognition, and it’s a shift that’s only going to accelerate."}, {"7703": "In the age of AWS, the barrier to creating scalable software is almost non-existent and the internet has brought down distribution costs to zero."}, {"0488": "If anything product life-cycle curves have become shorter and steeper."}, {"3bcb": "Companies that don’t grasp these simple truths are now dying faster than ever. (The average life expectancy of a Fortune 500 company today is a mere 15 years vs 75 years back in 1960.)"}, {"1b93": "Just when you think you’re onto a cash cow, it’s probably already a dinosaur. Yes, it’s huge but the meteor is coming. It’s inevitable."}, {"e2d9": "Is your cash cow a dinosaur already?"}, {"9960": "The innovator’s dilemma"}, {"7fa8": "Why do innovative incumbents invariably get stuck at this dilemma even though it’s a scenario which has played out countless times throughout history? Why do companies that beat all and sundry to become world leaders come undone by smaller upstarts? Why do they become blind to the shockingly obvious?"}, {"cd6d": "The reasons are not too far to seek."}, {"a04d": "Incumbents are invariably loathe to get started on the next technology S-curve because from the peak of the existing S-curve, the just-forming new S-curve looks decidedly unattractive."}, {"cdda": "All the incumbents that die fall prey to the illusion of the infinite S-curve, extrapolating their graphs infinitely upward."}, {"b797": "It doesn’t help that our brains are hardwired to see straight linear sequences, and not curves."}, {"917b": "The iPhone heralded the rise of the actual ‘smartphone’ product curve"}, {"3505": "As Blackberry was accumulating more and more dollars climbing its peak, the curve of iPhone must have looked decidedly small and inconsequential."}, {"af8a": "Clay Christensen argues in his revolutionary book ‘The Innovator’s Dilemma’ that because innovation happens on a curve, the middle is where most of the value lies and the value at the end and the beginning is minimal."}, {"cb78": "And it is in approaching this highly profitable middle part of the curve, that the incumbent, with a massive customer base and hoarding profits, find its comfort zone, making incremental improvements to it’s existing product."}, {"a6db": "No one notices that as the revenue, profits and total market share curve is approaching its peak, the product life-cycle curve is on the downward trend to irrelevance."}, {"137d": "And guess which is the only curve Wall Street will have you care about."}, {"5811": "It’s hard to imagine the next big thing when you already have a big thing right in front of you."}, {"5b9b": "Revenue lags the product life-cycle, a point lost on many"}, {"b79f": "If you’re the CEO, you have to report quarterly earnings, and Wall Street wants to see those earnings numbers go up every single time. It’s easy to understand the need to sell more and more of cash cows to maximise profits and revenue."}, {"76c8": "The hardest thing to do is to make fundamental changes to your business when you’re making money and are profitable. — Ben Thompson"}, {"4e01": "Rarely are you going to be able to convince Wall Street about increasing earnings, particularly in the short run, by burning cash on new initiatives."}, {"93d4": "Except of course, if you’re Amazon."}, {"aceb": "And as you’re climbing the peak and approaching the most valuable part of the S- curve, the organisational focus and strategy shifts to scaling revenue, and innovation is put to the back-burner."}, {"8bd5": "Arjun Sethi, of Social capital, believes that in spite of Clay Christensen’s pioneering work being no secret, the middle of the innovation curve lures companies into thinking that their mission is to protect their existing audience and market share — the most fatal mistake of all."}, {"4446": "This is the point the company’s strategy shifts from being customer-focused to being product (read cash-cow) focused. The company strategy now focuses on scaling revenues of the cash cow in the portfolio."}, {"2f2f": "This could primarily involve three routes:"}, {"8702": "This is done by adding more features to the existing product, in turn making the core product more complex, and pushing the company upmarket, down the path of no return."}, {"1763": "The organisation is now broken into functional silos, with each function singularly focused on their own departmental problems and improving their core metrics. The organisation becomes good at incrementally improving the product for their existing market, not caring for disruptors eating away at the fringes."}, {"925e": "As revenue is the main prerogative, sales starts influencing more and more decisions and product folks fade into the background."}, {"164c": "Businesses are like biological organisms — they focus on their “core metric” and will gravitate towards optimising them. It means other paths are less trodden and worth exploring. — Shamik Sharma"}, {"ee24": "Watch Steve Jobs talk about the fatal fallacy with this behaviour:"}, {"8cbf": "This subtle shift in strategy causes a fundamental misunderstanding of the business that the organisation is in."}, {"9fc9": "You’re never in the ‘sell-more-of-your-cash-cow’ business. You’re always in the ‘solve-particular-pain-point’ business."}, {"f3fd": "As the incumbent starts milking his cash cow, new entrants start to appear."}, {"50af": "The disruptor, with virtually no captive customer-base, and without the huge weight of scale or history, can now use a first-principles approach to the market and build the best possible solution, given the technological, cultural and social context."}, {"6796": "The disruptor initially wins over a particular niche, but the incumbent plays it down as too small to ever be significant, not realising the curve is now favourable for the disruptor to ride just as the incumbent’s is soon to be on the downward slope."}, {"6483": "And then the meteor hits."}, {"45f6": "Now that you’ve recognised the fatal fallacy,"}, {"a185": "How do you solve the Innovator’s Dilemma?"}, {"f60e": "By increasing your odds."}, {"c51d": "The very same simple logic that people who win at stocks or casinos do."}, {"cdd5": "There are three known ways for it:"}, {"1bfd": "Of course, even this is not as easy as it sounds. Even if you recognise your place on the S-curve, and double down on building the next big thing, there are many pitfalls."}, {"4a7a": "Nothing seems to take more time, cost more money, involve more pitfalls, or cause more confusion, than the launch of ill-conceived new products. The fact is, most new products don’t have any sort of classical life cycle curve at all."}, {"906d": "Most new products never take off and instead have an infinitely descending curve. So you might need to make multiple new bets to create your next big fat cash cow."}, {"e031": "“One of my jobs is to encourage people to be bold. It’s incredibly hard. Experiments are, by their very nature, prone to failure. A few big successes compensate for dozens and dozens of things that didn’t work. Bold bets — Amazon Web Services, Kindle, Amazon Prime— all of those things are examples of bold bets that did work, and they pay for a lot of experiments."}, {"5e5c": "I’ve made billions of dollars of failures at Amazon.com. Literally billions of dollars of failures. You might remember Pets.com or Kosmo.com. None of those things are fun. But they also don’t matter."}, {"3bcf": "What really matters is, companies that don’t continue to experiment, companies that don’t embrace failure, they eventually get in a desperate position where the only thing they can do is a Hail Mary bet at the very end of their corporate existence. Whereas companies that are making bets all along, even big bets, prevail. I don’t believe in bet-the-company bets. That’s when you’re desperate. That’s the last thing you want to do.” — Jeff Bezos"}, {"53df": "You would do well to learn from one of the few companies that has successfully disrupted itself time and again."}, {"dad1": "Apple."}, {"83a8": "Steve Jobs mentions Clay’s work on disruption in his biography to state the one truth Apple fully embraced:"}, {"5bd6": "If you don’t cannibalize yourself, someone else will. — Steve Jobs"}, {"2454": "In 2007, when Apple launched the iPhone, iPod was their actual cash cow, accounting for close to 50% of revenues."}, {"b9df": "Steve Jobs knew that by integrating all of the iPod functionality into the iPhone, he was cannibalising and killing off their cash cow."}, {"60f6": "If the company strategy was focused around selling more and more of iPods, the iPhone may never have launched."}, {"b514": "Apple’s core philosophy allows them to embrace the fact that the tech industry cares little for sentiment or history, and lets them jump onto the next innovation curve while still on top."}, {"91c3": "And if that means that they have to cannibalize some of the biggest cash cows in their history, they are only too willing to do it."}, {"177b": "“Our core philosophy is to never fear cannibalization. If we don’t do it, someone else will. Macintosh killed the Apple II. We know that iPhone has cannibalized some of our iPod business. That doesn’t worry us. We know that iPad will cannibalize some Macs. But that’s not a concern.”- Tim Cook"}, {"52ab": "Apple’s organisational structure"}, {"ee5a": "Apple’s organisational structure also helps them tackle the innovator’s dilemma, and align itself to successive S-curves over and over again."}, {"bc84": "Notice how Apple doesn’t have business heads like a head of iPad, a head of iPod and so on."}, {"cad1": "The company has a singular, unitary structure with just one P&L. Which allows them to focus on the end-consumer instead of their separate products."}, {"c67a": "It’s no surprise that this re-organisation was one of the first things Steve Jobs did on his return to Apple."}, {"23f7": "“We should all be concerned about the future because that’s where we’ll have to spend the rest of our lives.” — Unknown"}, {"3f87": "In the end, like all human biases and fallacies, tackling the innovator’s dilemma boils down to consciously recognising your place on the curve and preparing for the inevitable next curve by acting on customer problems with a first-principles approach, and not banking on the presumptive longevity of their products."}, {"4f67": "In every single case where incumbents die, it is because there has been a false sense of belief that consumers will be as obsessed with their products as they themselves are with their cash cows, and failure to recognise and adapt to the changes around them."}, {"1917": "The lesson then, is to fully embrace the morbid truth that products die and be willing to threaten the very core of your current business to survive the future."}, {"fe5f": "If you don’t follow the curve, you’re doomed."}], "child": "799_1\t799_2\t799_3\t799_4\t799_5\t799_6\t799_7\t799_8\t799_9\t799_10\t799_11\t799_12\t799_13\t799_14\t799_15\t799_16\t799_17\t799_18\t799_19799_1\t799_2\t799_3\t799_4\t799_5\t799_6\t799_7\t799_8\t799_9\t799_10\t799_11\t799_12\t799_13\t799_14\t799_15\t799_16\t799_17\t799_18\t799_19799_1\t799_2\t799_3\t799_4\t799_5\t799_6\t799_7\t799_8\t799_9\t799_10\t799_11\t799_12\t799_13\t799_14\t799_15\t799_16\t799_17\t799_18\t799_19799_1\t799_2\t799_3\t799_4\t799_5\t799_6\t799_7\t799_8\t799_9\t799_10\t799_11\t799_12\t799_13\t799_14\t799_15\t799_16\t799_17\t799_18\t799_19799_1\t799_2\t799_3\t799_4\t799_5\t799_6\t799_7\t799_8\t799_9\t799_10\t799_11\t799_12\t799_13\t799_14\t799_15\t799_16\t799_17\t799_18\t799_19"}