{"sentences": [{"3645": "Buying the Farm"}, {"57d5": "The future of agriculture is happening in cities. After years of experimentation, Silicon Valley may finally be making urban farming viable. But will residents be able to afford the crop?"}, {"40d3": "The town of Kearny, New Jersey, is a small industrial desert, populated by warehouses, factories, and twisting freeways filled with hulking cargo trucks. Its natureless landscape and the decrepit remains of 19th-century textile factories make it so uninviting that it was occasionally used as a filming location for HBO’s The Sopranos. In other words, it’s the kind of place where you’d expect to see a mobster toss a dead body into a dumpster — it is not where you’d expect to see a nice man in plaid harvesting baby kale. But the day I visited a warehouse on a concrete lot in Kearny, I watched Irving Fain, the CEO of a new urban farm named Bowery, do just that."}, {"1a00": "“Are you a kale fan?” Fain asked me excitedly."}, {"d931": "I met the 37-year-old Fain, who’s tall with messy brown hair and an enthusiastic grin, in a tidy waiting room at the back of the building. He was wearing a flannel shirt, jeans, and comfortable tennis shoes. But that was not what he wore when we headed into the adjacent room. Instead, we zipped our bodies into papery hazmat suits, tucked our hair into nets, and placed protective booties over our shoes."}, {"9e73": "The moment we walked into the spotless, brightly lit room, occupied with rows of tall remote-controlled towers that contained trays of leafy greens under LED lights, Fain morphed into a giddy, considerably healthier Willy Wonka. A single attendant had ordered the farm’s autonomous robotic forklifts to lower the portable crops onto conveyor belts and send them toward us. We walked up to their landing table, and with a pair of mini scissors, Fain began snipping leaf after leaf for me to taste. First came the arugula (which he called “crisp and peppery”), then the purple bok choy (“It’s, like, amazingly good”), then the spicy mustard greens that the executive chef at the Manhattan restaurant Craft had specifically requested (the owner, Top Chef star Tom Colicchio, is an investor in Bowery). Each sample was a pristine vision of plant life, with zero sign of the unsightly deformities that come from bugs and dirt — the risks of being grown outdoors."}, {"7e65": "And then there was the kale."}, {"c831": "“One of the compliments our kale gets a lot is: ‘Man, I never liked kale, but I had to like kale, and I actually really like your kale,’” Fain said."}, {"7832": "A begrudging kale consumer myself, I took a skeptical bite and was pleasantly surprised. I tasted no hints of the bitter chalkiness associated with the superfood. It was light and sweet and unusually fresh compared with the produce at my local Key Food. All this, without ever coming into contact with the outside world."}, {"1cb2": "But the kale wasn’t delicious simply because it was grown without pesticides, or because Fain, who previously ran a customer loyalty software startup, has a green thumb. The kale was delicious because, in addition to maintaining a mostly autonomous farming system, Bowery uses proprietary software that collects data points about what influences a plant’s health, growth rate, yield, and factors that affect its flavor. According to Fain, it analyzes the information in real time, and automatically pushes out changes to the treatments of crops as it sees fit. I liked the kale in part because its growing conditions were dictated to a microscopic degree by machine-learning software that Fain lovingly calls “FarmOS.”"}, {"c6e4": "Bowery is the latest of a handful of urban farm startups attempting to reinvent how people, specifically city dwellers, get their food. In February, the startup announced that it had raised a healthy $7.5 million from a handful of venture funds, joining the likes of companies like BrightFarms, AeroFarms, and Square Roots that have caught the eye of tech investment firms over the past few years. The premise of these companies, as they tell it, is simple: America’s current farming system is wrought with inefficiencies. Climate change is threatening our ability to efficiently grow crops. And, on top of that, food must be hauled great distances to reach highly-populated city centers. In the process, taste, quality, and shelf life are sacrificed. By growing plants in warehouses, shipping containers, and city-adjacent greenhouses, these next-gen farmers claim they are able to eliminate the threat of unpredictable weather, waste less water, reduce transportation costs, and — most enticingly — stop basil from wilting within 30 seconds of landing in the refrigerator. And even if agricultural experts warn that their farming models might not be enough to ameliorate the world’s food-shortage issues, that has not stopped these companies from adding a utopian flair to their marketing efforts. The same way that Soylent has floated its product as a way to end world hunger, these farming startups are angling to be seen as the solution to our collapsing agricultural system."}, {"4f70": "Aside from the chance to, as one farmer I spoke to put it, “disrupt the industrial food system,” supporting urban farming is especially appealing to Silicon Valley investors. As mega tech entrepreneurs have colonized Northern California over the past few decades, they have internalized elements of its collective environmental conscience and crunchy farm-to-table culture. (After all, it’s hard to snag a reservation at Chez Panisse without first learning who the hell Alice Waters is.) When climate change skeptics questioned Tim Cook’s 2014 pledge that Apple would invest in renewable energy, the typically mild-mannered CEO reportedly became “visibly angry” and told them to sell their shares. Cafeterias at corporations like Google have long offered organic, hormone-free meals made with ingredients sourced from local farms. In 2011, Mark Zuckerberg even announced a new “personal challenge” to eat meat only from animals he’d killed himself. Tech industry titans are so enamored with healthy, tasty, ethical food, that they once invested $120 million to develop a $700 machine that makes an eight-ounce glass of organic juice. Silicon Valley’s decision to invest in urban farming startups is just about as inevitable as Steve Wozniak checking in at the Outback Steakhouse in Cupertino on a weeknight. It comes with the territory."}, {"a1fb": "(Bowery)"}, {"f224": "These new-age agricultural businesses have found it helpful to update the language of an ancient industry to emphasize their innovative approach, and better cater to their ideal audience. Along with naming his facility’s operating system “FarmOS,” Fain has also coined the term “post-organic” to describe Bowery’s completely chemical-free produce and elevate its cachet in the competitive world of gourmet salad. The difference, as he explains it, is that the United States Department of Agriculture technically allows organic farmers to use certain pesticides and organic produce is sometimes exposed to chemicals spread from nearby farms, while his product is completely “pure and clean.” Last year, Elon Musk’s brother Kimbal lifted the startup incubator model popularized by Y Combinator and applied it to farming, launching the Brooklyn-based company Square Roots. (In his obligatory Medium post announcing the endeavor, he cited evidence that microwave sales were declining and declared that “Food is the new internet.”)"}, {"5713": "Square Roots’ premise is vaguely reminiscent of the contest described in the opening credits of America’s Next Top Model: 10 individual farmers are given their own app-controlled, 320-square-foot steel shipping container to grow plants in for a year. In what the company’s cofounder and CEO Tobias Peggs has dubbed a “farmer-to-desk” model, individuals can receive weekly deliveries to their workplace in the size of a “nanobite” (one bag), “megabite” (three bags), or a “terabite” (seven bags) from individual farmers in the program. In the end the farmers are set free to start their own enterprises. Even AeroFarms, a New Jersey farm startup that waters its plants with patented aeroponic misting apparatus and is the most established U.S. company of its kind, describes its progress in terms of traditional software release iterations (i.e. “AeroFarms 2.0”)."}, {"b9a2": "Not only have these startups modernized agricultural terminology, their marketing teams have also cozied up to the altruistic image of America’s modern-day agriculture movement. The history of urban farming in the United States has always been inextricably linked to the availability of food, and a community’s ability to grow that food itself. The earliest modern American urban farms were plotted in 1893, amid an economic recession. To aid the swaths of industrial workers who had recently lost their jobs, the mayor of Detroit, Hazen Pingree, launched an initiative that provided unemployed residents with vacant lots, materials, and instructions that they could use to establish their own potato farms. “Pingree’s Potato Patches,” as they were known, were so helpful in feeding needy residents that both Boston and San Francisco modeled programs after them until the economy improved. Similar programs were recycled in the 1930s, during the Great Depression."}, {"056d": "By the early 20th century, programs similar to Pingree’s began popping up at schools in urban areas, stoked by urban reformers who worried that kids would be ruined by growing up in industrial environments. Schools in cities like Chicago, New York, and Philadelphia taught their students how to plant everything from sugar beets to rye as a way to impart individual responsibility, civic virtue, and — as one New York urban farm advocate from the time put it — “the love of nature by opening to their minds the little we know of her mysteries, more wonderful than any fairy tale.”"}, {"ad0f": "(Square Roots)"}, {"cccd": "It wasn’t until the U.S.’s involvement in World War I began in 1917 that the federal government began pushing Americans to farm in the name of patriotism. In order to meet the export demands of food-starved Europe, the U.S. established the National War Garden Commission, a national organization that asked citizens to become “soldiers of the soil” by growing their own food. Posters encouraging agricultural action depicted gallant men and women working in fields, sometimes alongside anthropomorphic American-flag-toting potatoes. The campaign worked: The same year the government announced the program, it counted approximately 3.5 million war gardens."}, {"a144": "Larger-scale agriculture had helped food supply become more reliable by 1939, but that didn’t keep the federal government from repurposing the movement at the beginning of World War II. The government’s updated campaign saw these “victory gardens” as a source of health and morale, even if the increasing growth of suburbs meant that people were planting them in the privacy of their backyards. Once again, patriotism took hold, and an estimated 18–20 million families had planted victory gardens by 1944, according to the Smithsonian’s digital archive of American gardening history."}, {"7392": "In the 1960s and 1970s, activists began jump-starting their own urban-greening movements to ameliorate food deserts, benefit poor communities whose city neighborhoods were littered with vacant land, and educate locals on the benefits of healthful, seasonal eating. In 1969, a handful of UC Berkeley students and locals aimed to claim an empty lot owned by the university and transform it into what’s now known as the People’s Park. (“The University had no right to create ugliness as a way of life,” read an article in the alt newspaper the Berkeley Barb.) Organizers managed to mobilize thousands of people to convert the land into a green oasis, which conservative politicians and UC officials then attempted to bulldoze. Protesters stepped in to save the park and were promptly doused with tear gas. Governor Ronald Reagan called upon the National Guard to squash the conflict, but it only led to more chaos — including the death of a bystander, the permanent blinding of a protester, and injuries to more than 100 people. A fence school officials had put around the park before the riots began was promptly torn down. Eventually the university was forced to accept that its formerly empty lot would remain a park."}, {"abbb": "In 1970s New York — where a financial crisis had caused an uptick of abandoned buildings and lots in the Lower East Side, Hell’s Kitchen, and East Harlem — a nonprofit environmental group called the Green Guerillas began throwing “seed bombs” full of water, fertilizer, and seeds over fences and onto empty lots in an attempt to beautify them. One of the group’s founders, Liz Christy, eventually expanded its efforts by launching a campaign to remove trash and haul in soil to empty neighborhood plots. The legacy of environmental activists’ efforts has expanded in recent years, and neighborhoods feel encouraged to organize and contribute to local beautification projects, and build everything from chicken coops to beehives in urban areas. It’s no wonder that the sight of flourishing green squares amid concrete buildings has since been symbolic of charitable, earthy activism."}, {"1496": "The latest urban farming startups are not charities, though. They’re businesses. But they have not hesitated to co-opt some of the same talking points about local collaboration and healthy families heralded by their grassroots counterparts. The words “HEALTHY PEOPLE, HEALTHY COMMUNITY, HEALTHY PLANET” appear at the top of the BrightFarms website in all caps. Beneath them is the company’s mission statement: “For the health of the planet, by improving the environmental impact of the food supply chain. For the health of our society, by encouraging the consumption of whole and fresh foods.” AeroFarms goes one step further, declaring “We want to be a force for good in the world.” Square Roots’ explanation of why it exists is fittingly dramatic for a Musk brother’s operation: “Our cities are at the mercy of an industrial food system that ships in high-calorie, low-nutrient, processed food from thousands of miles away. It leaves us disconnected from the comfort, the nourishment, and the taste of food — not to mention the people who grow it. But people are turning against this system. People want real food — food you can trust to nourish your body, the community, the farmer, and the planet.”"}, {"7e25": "Despite their admirable intentions, this new market is also exploiting a gray area in how people think about city-based farming. According to Raychel Santo, a program coordinator at Johns Hopkins’s Center for a Livable Future, the positive environmental, health, and community effects of independently run farms are now more frequently being lumped into the pitch decks of urban for-profit ventures."}, {"057a": "“I do think people conflate the benefits of urban farms often: We can be less wasteful and improve food access and increase the number of jobs and things like that,” Santo said. “When people try to group all of the benefits together, you lose some of the granularity of the actual limitations of each type of urban garden.”"}, {"dc6c": "Even if the ultimate goal of these startups is to simply provide fresher, more nutrient-rich greens to urban areas, the messaging of many high-tech farming companies implies that their method of growing is a real solution to our future farming needs. “As the population grows, more food will need to be produced in the next four decades than has been in the past 10,000 years,” reads Bowery’s mission statement. “Yet resources like water are increasingly limited. There hasn’t been a practical path to provide fresh food at the volume and quality that people are looking for — until now.” When I spoke to Fain, he built on that statement, describing his business as the next logical stage for modernizing the world’s farms. “A lot of what the organic movement was about was how do we create a farming practice that allows better or slower regeneration and better protection of the land around us while also growing a higher quality food product,” he said. “And that was a great step. When the organic standards were written, a lot of the technology that we use today didn’t even exist. What we’re able to do at Bowery is the next evolution, the next step, from what organic was able to do from where industrial agriculture was before.”"}, {"8410": "Marc Oshima, cofounder of AeroFarms, also emphasized the company’s global ambitions by citing potential future projects in arid climates like Saudi Arabia. “It’s not just plants,” he said when I visited. “At the end of the day it’s about nourishing communities. It’s how we can build these responsible farms in major cities all over the world.” Musk made a similarly grand statement the day he announced Square Roots: “Our goal is to enable a whole new generation of real food entrepreneurs, ready to build thriving, responsible businesses,” he wrote. “The opportunities in front of them will be endless.”"}, {"eee3": "In reality, there are bigger food problems in the world than whether Manhattan grocery stores carry fresh arugula. The major challenges that our global agricultural system faces cannot be solved by urban farms alone."}, {"ab38": "According to Santo, whose research includes using climate change modeling to predict agricultural demand and supply, it’s projected that the global population will reach 9.6 billion people by 2050. As the effects of climate change set in and weather patterns become more volatile, farmers’ growing and harvesting seasons may be shortened or lengthened, depending on the circumstances, and they’ll be less certain of the amount of food they can produce year to year. Like many other countries, America’s food system is currently set up so that farms dedicated to specific foods — whether it be avocados, raspberries, or beef — are typically concentrated in a single location. So in a scenario in which different parts of the world are battling their own blizzards, droughts, or floods, the U.S. population would most likely experience frequent and significant shortages of specific goods. These shortages are already happening in different pockets around the world. At the beginning of March, a vegetable grower in southern Arizona that sells bags of baby spinach and “spring mix” announced that it ended its harvest earlier than usual because of an unusually damp season. This could mean a shortage of greens in early April. Similarly, snowfall in Spanish farming areas — a major source of England’s produce — has caused a temporarily low supply of zucchini, tomatoes, lettuce, peppers, and celery that began in the winter of 2016 and stretched into this year."}, {"1efe": "“The whole global food system that we rely on is heavily dependent on imports from other places and [a] very centralized system which creates a lot of potential problems,” Santo said. “A lot of research has gone into how the really complicated interconnected system that we’re facing is not very resilient if something were to happen to it.”"}, {"b24c": "So, to what degree can these startups actually help? Even if vertically grown warehouse operations like Bowery, Square Roots, and AeroFarms help supplement a salad shortage here and there, their considerable output thus far still couldn’t come close to feeding, say, the entire city of New York, let alone the United States. (Especially since the average American craves a considerable amount of meat and dairy.) Unlike your average community or rooftop garden, typical vertical farms are located indoors, so they do nothing to help what environmental scientists call the “urban heat island effect,” a phenomenon that shows cities tend to be warmer than their surrounding landscape because of human activities and concrete structures. So far, Santo says the most significant effect commercial vertical farms might have on global food system issues is influencing the culture of food consumption and encouraging communities to learn more about where their food comes from."}, {"f206": "When it comes to disrupting that increasingly fragile industrial farming system, Santo argues that we may be better off relying on regional farms strategically placed outside highly populated areas to avoid blips in our system. Peri-urban (urban adjacent) greenhouse operations like BrightFarms are able to produce higher crop yields, and therefore have much more potential to make a dent in the system, while also avoiding the significant environmental and monetary costs that indoor farmers are forced to incur from powering stacks of bright LEDs."}, {"dba1": "“Greenhouses have a much greater potential,” Santo said. “There’s very little evidence of the substantial benefits [of vertical farming], in terms of environmental impacts, partially because of energy input, but also because you can use those buildings in other ways. You can be productive on rural and peri-urban land in much greater volumes.”"}, {"35e5": "The Brooklyn-based company Gotham Greens is a successful test case for shrinking the greenhouse farm format to fit smaller metropolitan spaces, but still harvest enough produce to turn a profit. As some early indoor vertical farming startups have shuttered Gotham Greens CEO Viraj Puri has slowly expanded his business. The eight-year-old company employs about 150 people among four greenhouses, the newest of which recently opened in Chicago. Though Gotham Greens’s leaf mixes cost more than your run-of-the-mill lettuce bunch, they’re tastier, and generally stay fresh in the fridge longer than their grocery-store competition. Puri is heartened to see a new collection of vertical farmers experimenting with LED growing, though he’s not yet convinced that their methods make for a viable business."}, {"9c4a": "“Our goal at Gotham Greens is to produce the most consistent, reliable supply of premium-quality produce in the most cost-effective manner, and today greenhouse technology provides that,” he said. “But I’m glad they’re doing the research. I don’t necessarily have an appetite to do a lot of research and development and not be profitable. That’s why you have technology companies.”"}, {"f5ed": "Still, visionaries of vertical farming remain optimistic that whatever challenges the industry faces will be sorted out as technology advances, and the government recognizes their utility. When Dickson D. Despommier, an emeritus professor of public and environmental health at Columbia University’s Mailman School of Public Health, wrote a book about the possibilities of vertical farming in 2010, he wasn’t aware of any vertical farms that actually existed. He has since become one of the movement’s most prominent advocates. Though the vertical farming industry is in its infancy, he cites the rapid development of more energy-efficient LED lights and a growing variety of business structures as evidence that we will inevitably rely on indoor growing."}, {"0fa9": "“Eventually the virtues of this will become so apparent that people will say: ‘What the hell are we doing outdoors when we can do this indoors?’” he said. “Just like they’re saying: ‘Why the hell should we burn coal when it’s much more efficient to get all your energy from solar and wind power?’”"}, {"0bd4": "Despommier points to Japan as a success story when it comes to the rapid adoption of vertical farms. After a massive earthquake and subsequent tsunami shook the country in 2011 and its Fukushima Daiichi nuclear plant contaminated about 5 percent of the country’s farmland, the Japanese government rushed to secure alternate food solutions. It was what Dickson described as “the perfect storm” to encourage full integration of urban farming. Now, he says there are hundreds of vertical farms across the region, sometimes even integrated into workplace cafeterias. In many cases they’ve solicited the expertise of technology companies like Panasonic and Philips to establish more efficient farming methods."}, {"7b04": "“There’s not going to be instant success here any more than there was in the beginning of, say, Nokia,” Despommier said. “You can go down the line and see how advances in technology and efficiency of using that technology results in replacing the original invention with something that’s much better. That’s what the human species is very good at doing.”"}, {"01ec": "For all the discussion of growing healthy communities, often the only way to balance the expenses of indoor urban farms is to cater to people who already have the money to buy fancy lettuce. In other words, their customers are gourmet restaurants, health-conscious tech companies, and Whole Foods clientele. All this despite the fact that most urban warehouse farms set up shop in low-income communities, where empty buildings are more plentiful and cheaper to rent. A box of AeroFarms greens costs $3.99, while Bowery’s greens go for $3.49 — loads more than someone on a budget might be willing to pay, when they can just grab a much cheaper loose head of lettuce. As a May 2016 report from the Johns Hopkins Center for a Livable Future noted, “urban agriculture projects are not panaceas of social inclusion or equity.” According to Santo, disparity in access to more nutritious produce is a frequent pattern of for-profit city farms."}, {"67da": "“Private companies like these put buildings in communities of lower income or communities of color,” she said. “Oftentimes they produce these really expensive greens for restaurants, but then go serve wealthy people for a different community in the city.” In short, the Whole Foods crowd simply has yet another option for fresh greens, and the communities housing the operations providing them can still afford only the same old wilted lettuce."}, {"06dd": "AeroFarms has come the closest to overcoming the many challenges of the modern vertical farm. The operation’s 70,000-square-foot facility in Newark, New Jersey, can grow 2 million pounds of food each year. It’s currently renovating a former steel supply company building half a mile away from its current headquarters, creating what will be its third major farm and a symbolic gesture of rehabilitation for the city. The startup has raised more than $70 million in venture capital from the likes of Prudential and Goldman Sachs."}, {"728a": "“They’ve looked at our history, they’ve looked at our operating costs, and they’ve seen what the demand is,” cofounder Marc Oshima told me when I visited the farm. “They foresee why they want to be a part of this.”"}, {"3b49": "The true question of Silicon Valley investors is almost always: Can a business scale up? Is it a Foursquare (doomed to mild popularity) or an Uber (able to expand at a near-terrifying pace)? The question is particularly tricky for something as intricately designed and finicky as a farm, which can’t simply be revamped by overhauling a portion of code or redesigning its user experience. But of all the vertical farming startups on the market at the moment, AeroFarms is closest to proving that its model is solid enough to be plopped in any urban center on the planet and still deliver the same amount of product on the same timetable. (In its case that product is limited to six different salad box mixes of leafy greens.)"}, {"f77e": "(AeroFarms)"}, {"dff6": "The company was founded in 2004, thanks to the curious mind of Ed Harwood, an inventor and former associate professor at Cornell’s agriculture school, and AeroFarms’ current chief science officer. Harwood has toiled over refining each element of the company’s tightly coordinated growing process, from making LED lighting more energy efficient, to developing the best possible reusable fabric into which a variety of seeds can be sown to germinate and grow (his final iteration is patented). All of these elements are incorporated into each of the seven planting beds that fit into the Newark farm’s 20-foot-high, custom-designed towers."}, {"4793": "The inventor’s secret sauce is a proprietary nozzle used to mist a plant’s roots with with nutrient-rich water, a method called aeroponics that cofounder Oshima says uses 95 percent less water than traditional farming, which is even less than hydroponic farming uses — and less than the average aeroponic farm uses. (He also made sure to mention it was “perfect” that I had chosen to visit the company’s HQ on World Water Day.) In addition to saving water, he claims the misting speeds up the growth rate of the plants themselves."}, {"d28b": "“The roots are able to get oxygen, which leads to a faster growing process, more biomass in a shorter period of time,” Oshima told me in a cold, messy meeting room that had a hole in the wall, a visual indicator of where this tech company’s priorities lie. “When we think about the business of farming, how do we have the right economics, how do we compete with that field farmer, in terms of scale, cost, and productivity? We think that aeroponics is part of that equation.”"}, {"dab3": "AeroFarms’ plant beds aren’t mostly autonomous like Bowery’s. In fact, those tasked with examining plant life as it grows must stand upon adjustable accordion-like platforms to properly examine their subjects. But the company has collected a trove of data over the years from testing over 250 varieties of plants, and is developing predictive analytics and machine-learning softwares that are not unlike the kind Fain has advertised. Developers even made an in-house app to monitor the rapid progress of the crops. And when it comes to the taste of their greens, AeroFarms has earned the endorsement of chefs like Michel Nischan, a three-time James Beard Award–winning chef who also founded Wholesome Wave, a nonprofit that aims to improve access to fresh produce in low-income communities. Though Nischan is partial to produce grown the old-fashioned way, he was pleasantly surprised by the taste of AeroFarms produce."}, {"efa4": "“Purely from a flavor and texture perspective, the stuff that comes out of the dirt is still superior to everything I’ve tasted, other than AeroFarms,” he said. “In my mind they were the ones that finally cracked the code. The spinach leaves are hearty, really sturdy, they had a really great texture to them, a really deep color, and when I ate them I got the flavor intensity that you get from nutrient density.”"}, {"8282": "As for community outreach, AeroFarms has made an earnest effort to integrate with its neighborhood however it can. In 2010, when the company was in its infancy and headquartered in upstate New York, Harwood sold one of the farming towers to the inner city Philip’s Academy Charter School, and the company still holds educational sessions there. (Last year, Michelle Obama toured the setup as part of her #LetsMove campaign to promote healthy eating and exercise.) Every Wednesday, employees set up a farmstand on the empty street outside the warehouse, even if the stuff it sells might be out of the price range for AeroFarms’ neighbors. The company has only 120 employees, many of whom are engineers, software developers, and microbiologists. But Oshima has made an effort to hire locals whenever he can, and takes pride in the fact that he’s taught people a skill scarcely practiced in a withering industrial town where unemployment is high. The company works with a local employment group to ensure over 40 percent of its workers are from Newark. While he was showing me the latest farm, one of them approached Oshima to ask about a work program that would allow the employee to take classes relating to urban farming. Recently, AeroFarms set up an informational booth at the brand-new Newark Whole Foods to spread the word about its product. As Oshima tells it, a mother and her baby approached to sing the praises of the company. “Future customer?” the AeroFarms employee asked, pointing at her child. “Future worker,” the mother replied."}, {"cdbd": "“We get excited about how we can be an inspiration to the community,” Oshima, an otherwise reserved man, gushed. “So that was exciting.”"}, {"6987": "Nischan agrees that providing jobs to low-income communities is central to helping them afford better food. Beyond that, he argues that for-profit food companies that want to make their product affordable must structure their business plans to accommodate the extra costs that come with subsidizing a product."}, {"ebd8": "(AeroFarms)"}, {"cb0f": "“What AeroFarms is doing in Newark … by really focusing on hiring people from the local communities is actually the best beachhead that you can establish,” he said. “But when it comes to getting into Whole Foods and doing farm stands, if you want to help an underserved community because you’re producing food, and you want some of that food to transform the health of underserved communities in the place that your business calls home, you generally have to take some kind of a haircut.”"}, {"8484": "AeroFarms’ modest effect on the surrounding area is still germinating. And it may still be far off from its goal of becoming a global presence in destinations as far-flung as Saudi Arabia. But given that the vertical farming industry is exploring uncharted territory, what little impact it’s had is promising."}, {"0703": "“There’s no playbook, no traditional government land grant,” Oshima said. “Universities aren’t developing the next generation of farmers — we are.”"}, {"d5bf": "While all the farmers I spoke to were eager to bridge the gap between the customers who can afford their high-quality produce and those who can’t, Jonathan Bernard seemed especially contemplative about the issue. The 24-year-old former accountant from Long Island grows premium lettuce in one of Square Roots’ narrow shipping containers, an operation that costs about $3,000 a month to maintain. The large rectangular boxes are lined up in the parking lot of the Pfizer building in Bed-Stuy, now an office that houses movie props and a variety of local food startups. At one point during the tour of his farm, he opened the door and pointed to the Marcy Houses, a cluster of public housing buildings across the street."}, {"3ba1": "“Jay Z grew up right here, like literally,” he said, pointing to a fence. “And this fence is pretty symbolic of what’s going on. There’s a true barrier to getting in there. They have food deserts that they can’t get over. I can go back to Long Island, get whatever I want. But inside these communities they’re not getting fresh stuff.”"}, {"c37a": "Bernard admits that he’s not entirely sure how to bring affordable food into a low-income community like Bed-Stuy without going out of business. “That’s kind of what we’re here figuring out,” he said. His intended business, a farm that grows nutrient-rich plants for performance athletes, also relies on an elite customer class. He recently showed off his operation to a handful of NBA players, and is also mulling the possibility of selling some decorative nasturtium leaves on the side to chefs, who will pay up to $60 a pound for the rare and fragile plant. Ultimately he predicts that the only way he can offer affordable produce to the people who need it most is by doubling his output."}, {"4bda": "“It costs money to light this thing, it costs rent to put it on this land,” he said. “If all else is the same, how do you get it cheaper? You have to produce more.”"}, {"bf8e": "Companies that can afford the Square Roots service have been impressed by it. As soon as Brannon Skillern, the 33-year-old head of talent management at stock exchange startup IEX, gathered about nine people in her office to participate in the program, she was visited by Square Roots farmer Electra Jarvis. Jarvis dropped off her first delivery, explained the properties of her heirloom-seed bok choy and that there was no need to wash it, and opened an email thread to encourage feedback. Soon Skillern started seeing her coworkers snacking on the greens straight from the bag. Though some people from the company have opted not to join because they’ve said it’s cheaper to buy salad at the grocery store, Skillern says that she values building a relationship with a farmer who’s within a mile radius of her home."}, {"f78c": "(Square Roots)"}, {"b559": "“It’s neat to have that back and forth with your farmer,” she said. “I follow Electra on Instagram and I can kind of see like ‘Oh, cool. She’s harvesting this this week.’ It just feels like the personal-connection aspect is not anything that you can get anywhere else.”"}, {"5595": "Bernard values that personal connection with customers as well. And the day I visited, he was testing a strategy to up his yield rate, in the hopes that he could nail down a structure that would allow him to give back to his surrounding community. He’d been tinkering with the temperature, light cycles, pH, and nutrient levels of his shipping container’s humming apparatus — powered by programs like Freight Farms and Bright Agrotech and monitorable via a smartphone app — to speed up the growth rate of his heirloom red leaf lettuce. Space in his narrow container is limited, so plants are stuffed into multiple rows of white plastic towers, which are rigged with plastic tubes for water delivery, and hung on a bar from the ceiling. Above them sit strands of red and blue LED lights (colored that way to beam only a portion of the light spectrum onto plants and conserve resources). Mixed together they wash the room in a purple glow."}, {"c712": "Bernard unclipped a tower and placed it on a hook to remove a single bunch of healthy-looking lettuce, which he then placed on a metal scale. He recently began weighing each lettuce plant to measure whether he could produce 100 pounds of food a week. His goal was to hit somewhere between 4 and 5 ounces per plant. He grabbed this one ahead of schedule, to test whether his amped-up settings could help it get there earlier. Before delicately placing it on the scale, he pointed to a few tiny leaves sticking out at the root, which he proudly explained to be the remnants of the plant’s very first growth, and something that would’ve been quickly decimated in a traditional agricultural setting. The plant clocked in at 4.69 ounces, and a smile spread on Bernard’s face."}, {"15ef": "“That makes me really happy,” he said. “It’s the size that I wanted three weeks earlier than I expected.” It was a small triumph for him, maybe a microscopic one in the larger industry of vertical farming. But it was progress. We celebrated with a tasting. The lettuce was flavorful, crisp, and juicy. He sent me home with a bunch, along with a baggie of his pricy nasturtium leaves. It lasted in my dinky fridge for well over a week."}, {"05b9": "An earlier version of this piece stated that Jonathan Bernard wasn’t delivering weekly to an individual business; he is delivering weekly to gyms."}], "content": "Buying the Farm The future of agriculture is happening in cities. After years of experimentation, Silicon Valley may finally be making urban farming viable. But will residents be able to afford the crop? The town of Kearny, New Jersey, is a small industrial desert, populated by warehouses, factories, and twisting freeways filled with hulking cargo trucks. Its natureless landscape and the decrepit remains of 19th-century textile factories make it so uninviting that it was occasionally used as a filming location for HBO’s The Sopranos. In other words, it’s the kind of place where you’d expect to see a mobster toss a dead body into a dumpster — it is not where you’d expect to see a nice man in plaid harvesting baby kale. But the day I visited a warehouse on a concrete lot in Kearny, I watched Irving Fain, the CEO of a new urban farm named Bowery, do just that. “Are you a kale fan?” Fain asked me excitedly. I met the 37-year-old Fain, who’s tall with messy brown hair and an enthusiastic grin, in a tidy waiting room at the back of the building. He was wearing a flannel shirt, jeans, and comfortable tennis shoes. But that was not what he wore when we headed into the adjacent room. Instead, we zipped our bodies into papery hazmat suits, tucked our hair into nets, and placed protective booties over our shoes. The moment we walked into the spotless, brightly lit room, occupied with rows of tall remote-controlled towers that contained trays of leafy greens under LED lights, Fain morphed into a giddy, considerably healthier Willy Wonka. A single attendant had ordered the farm’s autonomous robotic forklifts to lower the portable crops onto conveyor belts and send them toward us. We walked up to their landing table, and with a pair of mini scissors, Fain began snipping leaf after leaf for me to taste. First came the arugula (which he called “crisp and peppery”), then the purple bok choy (“It’s, like, amazingly good”), then the spicy mustard greens that the executive chef at the Manhattan restaurant Craft had specifically requested (the owner, Top Chef star Tom Colicchio, is an investor in Bowery). Each sample was a pristine vision of plant life, with zero sign of the unsightly deformities that come from bugs and dirt — the risks of being grown outdoors. And then there was the kale. “One of the compliments our kale gets a lot is: ‘Man, I never liked kale, but I had to like kale, and I actually really like your kale,’” Fain said. A begrudging kale consumer myself, I took a skeptical bite and was pleasantly surprised. I tasted no hints of the bitter chalkiness associated with the superfood. It was light and sweet and unusually fresh compared with the produce at my local Key Food. All this, without ever coming into contact with the outside world. But the kale wasn’t delicious simply because it was grown without pesticides, or because Fain, who previously ran a customer loyalty software startup, has a green thumb. The kale was delicious because, in addition to maintaining a mostly autonomous farming system, Bowery uses proprietary software that collects data points about what influences a plant’s health, growth rate, yield, and factors that affect its flavor. According to Fain, it analyzes the information in real time, and automatically pushes out changes to the treatments of crops as it sees fit. I liked the kale in part because its growing conditions were dictated to a microscopic degree by machine-learning software that Fain lovingly calls “FarmOS.” Bowery is the latest of a handful of urban farm startups attempting to reinvent how people, specifically city dwellers, get their food. In February, the startup announced that it had raised a healthy $7.5 million from a handful of venture funds, joining the likes of companies like BrightFarms, AeroFarms, and Square Roots that have caught the eye of tech investment firms over the past few years. The premise of these companies, as they tell it, is simple: America’s current farming system is wrought with inefficiencies. Climate change is threatening our ability to efficiently grow crops. And, on top of that, food must be hauled great distances to reach highly-populated city centers. In the process, taste, quality, and shelf life are sacrificed. By growing plants in warehouses, shipping containers, and city-adjacent greenhouses, these next-gen farmers claim they are able to eliminate the threat of unpredictable weather, waste less water, reduce transportation costs, and — most enticingly — stop basil from wilting within 30 seconds of landing in the refrigerator. And even if agricultural experts warn that their farming models might not be enough to ameliorate the world’s food-shortage issues, that has not stopped these companies from adding a utopian flair to their marketing efforts. The same way that Soylent has floated its product as a way to end world hunger, these farming startups are angling to be seen as the solution to our collapsing agricultural system. Aside from the chance to, as one farmer I spoke to put it, “disrupt the industrial food system,” supporting urban farming is especially appealing to Silicon Valley investors. As mega tech entrepreneurs have colonized Northern California over the past few decades, they have internalized elements of its collective environmental conscience and crunchy farm-to-table culture. (After all, it’s hard to snag a reservation at Chez Panisse without first learning who the hell Alice Waters is.) When climate change skeptics questioned Tim Cook’s 2014 pledge that Apple would invest in renewable energy, the typically mild-mannered CEO reportedly became “visibly angry” and told them to sell their shares. Cafeterias at corporations like Google have long offered organic, hormone-free meals made with ingredients sourced from local farms. In 2011, Mark Zuckerberg even announced a new “personal challenge” to eat meat only from animals he’d killed himself. Tech industry titans are so enamored with healthy, tasty, ethical food, that they once invested $120 million to develop a $700 machine that makes an eight-ounce glass of organic juice. Silicon Valley’s decision to invest in urban farming startups is just about as inevitable as Steve Wozniak checking in at the Outback Steakhouse in Cupertino on a weeknight. It comes with the territory. (Bowery) These new-age agricultural businesses have found it helpful to update the language of an ancient industry to emphasize their innovative approach, and better cater to their ideal audience. Along with naming his facility’s operating system “FarmOS,” Fain has also coined the term “post-organic” to describe Bowery’s completely chemical-free produce and elevate its cachet in the competitive world of gourmet salad. The difference, as he explains it, is that the United States Department of Agriculture technically allows organic farmers to use certain pesticides and organic produce is sometimes exposed to chemicals spread from nearby farms, while his product is completely “pure and clean.” Last year, Elon Musk’s brother Kimbal lifted the startup incubator model popularized by Y Combinator and applied it to farming, launching the Brooklyn-based company Square Roots. (In his obligatory Medium post announcing the endeavor, he cited evidence that microwave sales were declining and declared that “Food is the new internet.”) Square Roots’ premise is vaguely reminiscent of the contest described in the opening credits of America’s Next Top Model: 10 individual farmers are given their own app-controlled, 320-square-foot steel shipping container to grow plants in for a year. In what the company’s cofounder and CEO Tobias Peggs has dubbed a “farmer-to-desk” model, individuals can receive weekly deliveries to their workplace in the size of a “nanobite” (one bag), “megabite” (three bags), or a “terabite” (seven bags) from individual farmers in the program. In the end the farmers are set free to start their own enterprises. Even AeroFarms, a New Jersey farm startup that waters its plants with patented aeroponic misting apparatus and is the most established U.S. company of its kind, describes its progress in terms of traditional software release iterations (i.e. “AeroFarms 2.0”). Not only have these startups modernized agricultural terminology, their marketing teams have also cozied up to the altruistic image of America’s modern-day agriculture movement. The history of urban farming in the United States has always been inextricably linked to the availability of food, and a community’s ability to grow that food itself. The earliest modern American urban farms were plotted in 1893, amid an economic recession. To aid the swaths of industrial workers who had recently lost their jobs, the mayor of Detroit, Hazen Pingree, launched an initiative that provided unemployed residents with vacant lots, materials, and instructions that they could use to establish their own potato farms. “Pingree’s Potato Patches,” as they were known, were so helpful in feeding needy residents that both Boston and San Francisco modeled programs after them until the economy improved. Similar programs were recycled in the 1930s, during the Great Depression. By the early 20th century, programs similar to Pingree’s began popping up at schools in urban areas, stoked by urban reformers who worried that kids would be ruined by growing up in industrial environments. Schools in cities like Chicago, New York, and Philadelphia taught their students how to plant everything from sugar beets to rye as a way to impart individual responsibility, civic virtue, and — as one New York urban farm advocate from the time put it — “the love of nature by opening to their minds the little we know of her mysteries, more wonderful than any fairy tale.” (Square Roots) It wasn’t until the U.S.’s involvement in World War I began in 1917 that the federal government began pushing Americans to farm in the name of patriotism. In order to meet the export demands of food-starved Europe, the U.S. established the National War Garden Commission, a national organization that asked citizens to become “soldiers of the soil” by growing their own food. Posters encouraging agricultural action depicted gallant men and women working in fields, sometimes alongside anthropomorphic American-flag-toting potatoes. The campaign worked: The same year the government announced the program, it counted approximately 3.5 million war gardens. Larger-scale agriculture had helped food supply become more reliable by 1939, but that didn’t keep the federal government from repurposing the movement at the beginning of World War II. The government’s updated campaign saw these “victory gardens” as a source of health and morale, even if the increasing growth of suburbs meant that people were planting them in the privacy of their backyards. Once again, patriotism took hold, and an estimated 18–20 million families had planted victory gardens by 1944, according to the Smithsonian’s digital archive of American gardening history. In the 1960s and 1970s, activists began jump-starting their own urban-greening movements to ameliorate food deserts, benefit poor communities whose city neighborhoods were littered with vacant land, and educate locals on the benefits of healthful, seasonal eating. In 1969, a handful of UC Berkeley students and locals aimed to claim an empty lot owned by the university and transform it into what’s now known as the People’s Park. (“The University had no right to create ugliness as a way of life,” read an article in the alt newspaper the Berkeley Barb.) Organizers managed to mobilize thousands of people to convert the land into a green oasis, which conservative politicians and UC officials then attempted to bulldoze. Protesters stepped in to save the park and were promptly doused with tear gas. Governor Ronald Reagan called upon the National Guard to squash the conflict, but it only led to more chaos — including the death of a bystander, the permanent blinding of a protester, and injuries to more than 100 people. A fence school officials had put around the park before the riots began was promptly torn down. Eventually the university was forced to accept that its formerly empty lot would remain a park. In 1970s New York — where a financial crisis had caused an uptick of abandoned buildings and lots in the Lower East Side, Hell’s Kitchen, and East Harlem — a nonprofit environmental group called the Green Guerillas began throwing “seed bombs” full of water, fertilizer, and seeds over fences and onto empty lots in an attempt to beautify them. One of the group’s founders, Liz Christy, eventually expanded its efforts by launching a campaign to remove trash and haul in soil to empty neighborhood plots. The legacy of environmental activists’ efforts has expanded in recent years, and neighborhoods feel encouraged to organize and contribute to local beautification projects, and build everything from chicken coops to beehives in urban areas. It’s no wonder that the sight of flourishing green squares amid concrete buildings has since been symbolic of charitable, earthy activism. The latest urban farming startups are not charities, though. They’re businesses. But they have not hesitated to co-opt some of the same talking points about local collaboration and healthy families heralded by their grassroots counterparts. The words “HEALTHY PEOPLE, HEALTHY COMMUNITY, HEALTHY PLANET” appear at the top of the BrightFarms website in all caps. Beneath them is the company’s mission statement: “For the health of the planet, by improving the environmental impact of the food supply chain. For the health of our society, by encouraging the consumption of whole and fresh foods.” AeroFarms goes one step further, declaring “We want to be a force for good in the world.” Square Roots’ explanation of why it exists is fittingly dramatic for a Musk brother’s operation: “Our cities are at the mercy of an industrial food system that ships in high-calorie, low-nutrient, processed food from thousands of miles away. It leaves us disconnected from the comfort, the nourishment, and the taste of food — not to mention the people who grow it. But people are turning against this system. People want real food — food you can trust to nourish your body, the community, the farmer, and the planet.” Despite their admirable intentions, this new market is also exploiting a gray area in how people think about city-based farming. According to Raychel Santo, a program coordinator at Johns Hopkins’s Center for a Livable Future, the positive environmental, health, and community effects of independently run farms are now more frequently being lumped into the pitch decks of urban for-profit ventures. “I do think people conflate the benefits of urban farms often: We can be less wasteful and improve food access and increase the number of jobs and things like that,” Santo said. “When people try to group all of the benefits together, you lose some of the granularity of the actual limitations of each type of urban garden.” Even if the ultimate goal of these startups is to simply provide fresher, more nutrient-rich greens to urban areas, the messaging of many high-tech farming companies implies that their method of growing is a real solution to our future farming needs. “As the population grows, more food will need to be produced in the next four decades than has been in the past 10,000 years,” reads Bowery’s mission statement. “Yet resources like water are increasingly limited. There hasn’t been a practical path to provide fresh food at the volume and quality that people are looking for — until now.” When I spoke to Fain, he built on that statement, describing his business as the next logical stage for modernizing the world’s farms. “A lot of what the organic movement was about was how do we create a farming practice that allows better or slower regeneration and better protection of the land around us while also growing a higher quality food product,” he said. “And that was a great step. When the organic standards were written, a lot of the technology that we use today didn’t even exist. What we’re able to do at Bowery is the next evolution, the next step, from what organic was able to do from where industrial agriculture was before.” Marc Oshima, cofounder of AeroFarms, also emphasized the company’s global ambitions by citing potential future projects in arid climates like Saudi Arabia. “It’s not just plants,” he said when I visited. “At the end of the day it’s about nourishing communities. It’s how we can build these responsible farms in major cities all over the world.” Musk made a similarly grand statement the day he announced Square Roots: “Our goal is to enable a whole new generation of real food entrepreneurs, ready to build thriving, responsible businesses,” he wrote. “The opportunities in front of them will be endless.” In reality, there are bigger food problems in the world than whether Manhattan grocery stores carry fresh arugula. The major challenges that our global agricultural system faces cannot be solved by urban farms alone. According to Santo, whose research includes using climate change modeling to predict agricultural demand and supply, it’s projected that the global population will reach 9.6 billion people by 2050. As the effects of climate change set in and weather patterns become more volatile, farmers’ growing and harvesting seasons may be shortened or lengthened, depending on the circumstances, and they’ll be less certain of the amount of food they can produce year to year. Like many other countries, America’s food system is currently set up so that farms dedicated to specific foods — whether it be avocados, raspberries, or beef — are typically concentrated in a single location. So in a scenario in which different parts of the world are battling their own blizzards, droughts, or floods, the U.S. population would most likely experience frequent and significant shortages of specific goods. These shortages are already happening in different pockets around the world. At the beginning of March, a vegetable grower in southern Arizona that sells bags of baby spinach and “spring mix” announced that it ended its harvest earlier than usual because of an unusually damp season. This could mean a shortage of greens in early April. Similarly, snowfall in Spanish farming areas — a major source of England’s produce — has caused a temporarily low supply of zucchini, tomatoes, lettuce, peppers, and celery that began in the winter of 2016 and stretched into this year. “The whole global food system that we rely on is heavily dependent on imports from other places and [a] very centralized system which creates a lot of potential problems,” Santo said. “A lot of research has gone into how the really complicated interconnected system that we’re facing is not very resilient if something were to happen to it.” So, to what degree can these startups actually help? Even if vertically grown warehouse operations like Bowery, Square Roots, and AeroFarms help supplement a salad shortage here and there, their considerable output thus far still couldn’t come close to feeding, say, the entire city of New York, let alone the United States. (Especially since the average American craves a considerable amount of meat and dairy.) Unlike your average community or rooftop garden, typical vertical farms are located indoors, so they do nothing to help what environmental scientists call the “urban heat island effect,” a phenomenon that shows cities tend to be warmer than their surrounding landscape because of human activities and concrete structures. So far, Santo says the most significant effect commercial vertical farms might have on global food system issues is influencing the culture of food consumption and encouraging communities to learn more about where their food comes from. When it comes to disrupting that increasingly fragile industrial farming system, Santo argues that we may be better off relying on regional farms strategically placed outside highly populated areas to avoid blips in our system. Peri-urban (urban adjacent) greenhouse operations like BrightFarms are able to produce higher crop yields, and therefore have much more potential to make a dent in the system, while also avoiding the significant environmental and monetary costs that indoor farmers are forced to incur from powering stacks of bright LEDs. “Greenhouses have a much greater potential,” Santo said. “There’s very little evidence of the substantial benefits [of vertical farming], in terms of environmental impacts, partially because of energy input, but also because you can use those buildings in other ways. You can be productive on rural and peri-urban land in much greater volumes.” The Brooklyn-based company Gotham Greens is a successful test case for shrinking the greenhouse farm format to fit smaller metropolitan spaces, but still harvest enough produce to turn a profit. As some early indoor vertical farming startups have shuttered Gotham Greens CEO Viraj Puri has slowly expanded his business. The eight-year-old company employs about 150 people among four greenhouses, the newest of which recently opened in Chicago. Though Gotham Greens’s leaf mixes cost more than your run-of-the-mill lettuce bunch, they’re tastier, and generally stay fresh in the fridge longer than their grocery-store competition. Puri is heartened to see a new collection of vertical farmers experimenting with LED growing, though he’s not yet convinced that their methods make for a viable business. “Our goal at Gotham Greens is to produce the most consistent, reliable supply of premium-quality produce in the most cost-effective manner, and today greenhouse technology provides that,” he said. “But I’m glad they’re doing the research. I don’t necessarily have an appetite to do a lot of research and development and not be profitable. That’s why you have technology companies.” Still, visionaries of vertical farming remain optimistic that whatever challenges the industry faces will be sorted out as technology advances, and the government recognizes their utility. When Dickson D. Despommier, an emeritus professor of public and environmental health at Columbia University’s Mailman School of Public Health, wrote a book about the possibilities of vertical farming in 2010, he wasn’t aware of any vertical farms that actually existed. He has since become one of the movement’s most prominent advocates. Though the vertical farming industry is in its infancy, he cites the rapid development of more energy-efficient LED lights and a growing variety of business structures as evidence that we will inevitably rely on indoor growing. “Eventually the virtues of this will become so apparent that people will say: ‘What the hell are we doing outdoors when we can do this indoors?’” he said. “Just like they’re saying: ‘Why the hell should we burn coal when it’s much more efficient to get all your energy from solar and wind power?’” Despommier points to Japan as a success story when it comes to the rapid adoption of vertical farms. After a massive earthquake and subsequent tsunami shook the country in 2011 and its Fukushima Daiichi nuclear plant contaminated about 5 percent of the country’s farmland, the Japanese government rushed to secure alternate food solutions. It was what Dickson described as “the perfect storm” to encourage full integration of urban farming. Now, he says there are hundreds of vertical farms across the region, sometimes even integrated into workplace cafeterias. In many cases they’ve solicited the expertise of technology companies like Panasonic and Philips to establish more efficient farming methods. “There’s not going to be instant success here any more than there was in the beginning of, say, Nokia,” Despommier said. “You can go down the line and see how advances in technology and efficiency of using that technology results in replacing the original invention with something that’s much better. That’s what the human species is very good at doing.” For all the discussion of growing healthy communities, often the only way to balance the expenses of indoor urban farms is to cater to people who already have the money to buy fancy lettuce. In other words, their customers are gourmet restaurants, health-conscious tech companies, and Whole Foods clientele. All this despite the fact that most urban warehouse farms set up shop in low-income communities, where empty buildings are more plentiful and cheaper to rent. A box of AeroFarms greens costs $3.99, while Bowery’s greens go for $3.49 — loads more than someone on a budget might be willing to pay, when they can just grab a much cheaper loose head of lettuce. As a May 2016 report from the Johns Hopkins Center for a Livable Future noted, “urban agriculture projects are not panaceas of social inclusion or equity.” According to Santo, disparity in access to more nutritious produce is a frequent pattern of for-profit city farms. “Private companies like these put buildings in communities of lower income or communities of color,” she said. “Oftentimes they produce these really expensive greens for restaurants, but then go serve wealthy people for a different community in the city.” In short, the Whole Foods crowd simply has yet another option for fresh greens, and the communities housing the operations providing them can still afford only the same old wilted lettuce. AeroFarms has come the closest to overcoming the many challenges of the modern vertical farm. The operation’s 70,000-square-foot facility in Newark, New Jersey, can grow 2 million pounds of food each year. It’s currently renovating a former steel supply company building half a mile away from its current headquarters, creating what will be its third major farm and a symbolic gesture of rehabilitation for the city. The startup has raised more than $70 million in venture capital from the likes of Prudential and Goldman Sachs. “They’ve looked at our history, they’ve looked at our operating costs, and they’ve seen what the demand is,” cofounder Marc Oshima told me when I visited the farm. “They foresee why they want to be a part of this.” The true question of Silicon Valley investors is almost always: Can a business scale up? Is it a Foursquare (doomed to mild popularity) or an Uber (able to expand at a near-terrifying pace)? The question is particularly tricky for something as intricately designed and finicky as a farm, which can’t simply be revamped by overhauling a portion of code or redesigning its user experience. But of all the vertical farming startups on the market at the moment, AeroFarms is closest to proving that its model is solid enough to be plopped in any urban center on the planet and still deliver the same amount of product on the same timetable. (In its case that product is limited to six different salad box mixes of leafy greens.) (AeroFarms) The company was founded in 2004, thanks to the curious mind of Ed Harwood, an inventor and former associate professor at Cornell’s agriculture school, and AeroFarms’ current chief science officer. Harwood has toiled over refining each element of the company’s tightly coordinated growing process, from making LED lighting more energy efficient, to developing the best possible reusable fabric into which a variety of seeds can be sown to germinate and grow (his final iteration is patented). All of these elements are incorporated into each of the seven planting beds that fit into the Newark farm’s 20-foot-high, custom-designed towers. The inventor’s secret sauce is a proprietary nozzle used to mist a plant’s roots with with nutrient-rich water, a method called aeroponics that cofounder Oshima says uses 95 percent less water than traditional farming, which is even less than hydroponic farming uses — and less than the average aeroponic farm uses. (He also made sure to mention it was “perfect” that I had chosen to visit the company’s HQ on World Water Day.) In addition to saving water, he claims the misting speeds up the growth rate of the plants themselves. “The roots are able to get oxygen, which leads to a faster growing process, more biomass in a shorter period of time,” Oshima told me in a cold, messy meeting room that had a hole in the wall, a visual indicator of where this tech company’s priorities lie. “When we think about the business of farming, how do we have the right economics, how do we compete with that field farmer, in terms of scale, cost, and productivity? We think that aeroponics is part of that equation.” AeroFarms’ plant beds aren’t mostly autonomous like Bowery’s. In fact, those tasked with examining plant life as it grows must stand upon adjustable accordion-like platforms to properly examine their subjects. But the company has collected a trove of data over the years from testing over 250 varieties of plants, and is developing predictive analytics and machine-learning softwares that are not unlike the kind Fain has advertised. Developers even made an in-house app to monitor the rapid progress of the crops. And when it comes to the taste of their greens, AeroFarms has earned the endorsement of chefs like Michel Nischan, a three-time James Beard Award–winning chef who also founded Wholesome Wave, a nonprofit that aims to improve access to fresh produce in low-income communities. Though Nischan is partial to produce grown the old-fashioned way, he was pleasantly surprised by the taste of AeroFarms produce. “Purely from a flavor and texture perspective, the stuff that comes out of the dirt is still superior to everything I’ve tasted, other than AeroFarms,” he said. “In my mind they were the ones that finally cracked the code. The spinach leaves are hearty, really sturdy, they had a really great texture to them, a really deep color, and when I ate them I got the flavor intensity that you get from nutrient density.” As for community outreach, AeroFarms has made an earnest effort to integrate with its neighborhood however it can. In 2010, when the company was in its infancy and headquartered in upstate New York, Harwood sold one of the farming towers to the inner city Philip’s Academy Charter School, and the company still holds educational sessions there. (Last year, Michelle Obama toured the setup as part of her #LetsMove campaign to promote healthy eating and exercise.) Every Wednesday, employees set up a farmstand on the empty street outside the warehouse, even if the stuff it sells might be out of the price range for AeroFarms’ neighbors. The company has only 120 employees, many of whom are engineers, software developers, and microbiologists. But Oshima has made an effort to hire locals whenever he can, and takes pride in the fact that he’s taught people a skill scarcely practiced in a withering industrial town where unemployment is high. The company works with a local employment group to ensure over 40 percent of its workers are from Newark. While he was showing me the latest farm, one of them approached Oshima to ask about a work program that would allow the employee to take classes relating to urban farming. Recently, AeroFarms set up an informational booth at the brand-new Newark Whole Foods to spread the word about its product. As Oshima tells it, a mother and her baby approached to sing the praises of the company. “Future customer?” the AeroFarms employee asked, pointing at her child. “Future worker,” the mother replied. “We get excited about how we can be an inspiration to the community,” Oshima, an otherwise reserved man, gushed. “So that was exciting.” Nischan agrees that providing jobs to low-income communities is central to helping them afford better food. Beyond that, he argues that for-profit food companies that want to make their product affordable must structure their business plans to accommodate the extra costs that come with subsidizing a product. (AeroFarms) “What AeroFarms is doing in Newark … by really focusing on hiring people from the local communities is actually the best beachhead that you can establish,” he said. “But when it comes to getting into Whole Foods and doing farm stands, if you want to help an underserved community because you’re producing food, and you want some of that food to transform the health of underserved communities in the place that your business calls home, you generally have to take some kind of a haircut.” AeroFarms’ modest effect on the surrounding area is still germinating. And it may still be far off from its goal of becoming a global presence in destinations as far-flung as Saudi Arabia. But given that the vertical farming industry is exploring uncharted territory, what little impact it’s had is promising. “There’s no playbook, no traditional government land grant,” Oshima said. “Universities aren’t developing the next generation of farmers — we are.” While all the farmers I spoke to were eager to bridge the gap between the customers who can afford their high-quality produce and those who can’t, Jonathan Bernard seemed especially contemplative about the issue. The 24-year-old former accountant from Long Island grows premium lettuce in one of Square Roots’ narrow shipping containers, an operation that costs about $3,000 a month to maintain. The large rectangular boxes are lined up in the parking lot of the Pfizer building in Bed-Stuy, now an office that houses movie props and a variety of local food startups. At one point during the tour of his farm, he opened the door and pointed to the Marcy Houses, a cluster of public housing buildings across the street. “Jay Z grew up right here, like literally,” he said, pointing to a fence. “And this fence is pretty symbolic of what’s going on. There’s a true barrier to getting in there. They have food deserts that they can’t get over. I can go back to Long Island, get whatever I want. But inside these communities they’re not getting fresh stuff.” Bernard admits that he’s not entirely sure how to bring affordable food into a low-income community like Bed-Stuy without going out of business. “That’s kind of what we’re here figuring out,” he said. His intended business, a farm that grows nutrient-rich plants for performance athletes, also relies on an elite customer class. He recently showed off his operation to a handful of NBA players, and is also mulling the possibility of selling some decorative nasturtium leaves on the side to chefs, who will pay up to $60 a pound for the rare and fragile plant. Ultimately he predicts that the only way he can offer affordable produce to the people who need it most is by doubling his output. “It costs money to light this thing, it costs rent to put it on this land,” he said. “If all else is the same, how do you get it cheaper? You have to produce more.” Companies that can afford the Square Roots service have been impressed by it. As soon as Brannon Skillern, the 33-year-old head of talent management at stock exchange startup IEX, gathered about nine people in her office to participate in the program, she was visited by Square Roots farmer Electra Jarvis. Jarvis dropped off her first delivery, explained the properties of her heirloom-seed bok choy and that there was no need to wash it, and opened an email thread to encourage feedback. Soon Skillern started seeing her coworkers snacking on the greens straight from the bag. Though some people from the company have opted not to join because they’ve said it’s cheaper to buy salad at the grocery store, Skillern says that she values building a relationship with a farmer who’s within a mile radius of her home. (Square Roots) “It’s neat to have that back and forth with your farmer,” she said. “I follow Electra on Instagram and I can kind of see like ‘Oh, cool. She’s harvesting this this week.’ It just feels like the personal-connection aspect is not anything that you can get anywhere else.” Bernard values that personal connection with customers as well. And the day I visited, he was testing a strategy to up his yield rate, in the hopes that he could nail down a structure that would allow him to give back to his surrounding community. He’d been tinkering with the temperature, light cycles, pH, and nutrient levels of his shipping container’s humming apparatus — powered by programs like Freight Farms and Bright Agrotech and monitorable via a smartphone app — to speed up the growth rate of his heirloom red leaf lettuce. Space in his narrow container is limited, so plants are stuffed into multiple rows of white plastic towers, which are rigged with plastic tubes for water delivery, and hung on a bar from the ceiling. Above them sit strands of red and blue LED lights (colored that way to beam only a portion of the light spectrum onto plants and conserve resources). Mixed together they wash the room in a purple glow. Bernard unclipped a tower and placed it on a hook to remove a single bunch of healthy-looking lettuce, which he then placed on a metal scale. He recently began weighing each lettuce plant to measure whether he could produce 100 pounds of food a week. His goal was to hit somewhere between 4 and 5 ounces per plant. He grabbed this one ahead of schedule, to test whether his amped-up settings could help it get there earlier. Before delicately placing it on the scale, he pointed to a few tiny leaves sticking out at the root, which he proudly explained to be the remnants of the plant’s very first growth, and something that would’ve been quickly decimated in a traditional agricultural setting. The plant clocked in at 4.69 ounces, and a smile spread on Bernard’s face. “That makes me really happy,” he said. “It’s the size that I wanted three weeks earlier than I expected.” It was a small triumph for him, maybe a microscopic one in the larger industry of vertical farming. But it was progress. We celebrated with a tasting. The lettuce was flavorful, crisp, and juicy. He sent me home with a bunch, along with a baggie of his pricy nasturtium leaves. It lasted in my dinky fridge for well over a week. An earlier version of this piece stated that Jonathan Bernard wasn’t delivering weekly to an individual business; he is delivering weekly to gyms. ", "parent": "", "title": "Buying the Farm", "child": "8_1\t8_2\t8_3\t8_4\t8_5\t8_6\t8_7\t8_8\t8_9\t8_10", "name": "8"}