{"name": "801", "parent": "", "content": "If Scale Isn’t The Goal, Then What Is? Seth Godin has a recent post titled “What if scale wasn’t the goal?”. I’ve posted the entirety of it below: From restaurants to direct mail, there’s pressure to be scalable, to be efficient, to create something easily replicated. Which is often used as the reason it’s not very good. “Well, we’d like to spend more time/more care/more focus on this, but we need to get bigger.” What if you started in the other direction? What would happen if you created something noteworthy and worried about scale only after you’ve figured out how to make a difference? The knee jerk reaction in tech, as both VCs and, often, as founder is to agonize how scalable something is long before it has proven noteworthy. A favorite reason for passing on an investment can be boiled down to “I don’t see how this can be a billion dollar business”. I recently spoke with a founder who is working to answer the question at the heart of Seth’s post. Giacomo ‘Peldi’ Guilizzoni is the founder of the wireframing software company, Balsamiq. Our chat covered a wide range of topics, but it was his answers to my questions specific to scale that departed so completely from the VC funded startup narrative. Peldi started Balsamiq nearly a decade ago. His intent was not be to it’s founder or CEO, but to be it’s only employee. Ever. Growth has never been a goal of ours. Our growth comes as a direct result of building a product customers love. We love talking with and listening to our customers. As their needs and challenges grow, our vision for how to support them grows too. But if growth isn’t the goal then what is? Our goal is to not mess it up! And to have good profit margins. Unlike many founders who hit on something that’s working then rush to raise funding to scale, Balsamiq has chosen to take a more measured approach- consistently growing revenue and profits year of over year. Each year Peldi takes $1M out personally, socks away 18mo of runway for a rainy day, and pays out 15% of profits to Balsamiq’s 25 employees (this number grows by 2–3 new hires per year). Over the years, there has been plenty of pressure to scale, be it from waves of competitors (Peldi called 2011 their year of the Clone Wars™) or VC’s looking to use the company’s massive user base as the foundation to roll up similar startups to dominate the category. To which Peldi says: Push us into prototyping tools? Design tools? Nope! Create a suite to go after Google Drive? Call InVision! All of those teams and all of those heavily funded strategies have to build complicated products so they can charge more. They can’t stay simple and reach the scale they need to meet investor expectations. They have to go up market. We don’t. What hasn’t Balsamiq been able to do without the support and resources that come from taking on outside investors? Sell. In 2010 we almost sold the business. I was freaking out. I didn’t want to stop coding so I figured I needed to hire myself a boss or bring on someone to help me sell the business. Raising money to help me sell was very enticing. Problem was, everytime I let myself go there I couldn’t sleep. I couldn’t convince my team. I couldn’t shake the feeling of being a sellout. My head was saying “YES!” but every cell in my body was saying “NO!”. Any regrets? None. I’m my own boss. I don’t have to answer to anyone. I get to learn from my own mistakes instead of being fired for making them. We have no debts and we have no deadlines. There’s no pressure to take shortcuts, or please any outside shareholders. We get to spend our time in customer interviews not in board meetings. Back to Seth’s original question then. If scale isn’t the goal, then what is? I don’t believe in the hustle. The goal for us as a company is finding a balance in our work and in our life. Extreme growth sounds way too stressful! We aren’t some kids from the Bay Area Hacker News crowd hoping against hope to grab a winning lottery ticket. As a product person I want to spend the next 40–50yrs honing and perfecting this craft. I’m Italian. We measure things in generations, not quarters. ", "title": "If Scale Isn’t The Goal, Then What Is?", "sentences": [{"fca0": "If Scale Isn’t The Goal, Then What Is?"}, {"7a60": "Seth Godin has a recent post titled “What if scale wasn’t the goal?”."}, {"b6b8": "I’ve posted the entirety of it below:"}, {"3a07": "From restaurants to direct mail, there’s pressure to be scalable, to be efficient, to create something easily replicated."}, {"a429": "Which is often used as the reason it’s not very good. “Well, we’d like to spend more time/more care/more focus on this, but we need to get bigger.”"}, {"52f3": "What if you started in the other direction?"}, {"4e6b": "What would happen if you created something noteworthy and worried about scale only after you’ve figured out how to make a difference?"}, {"c0e0": "The knee jerk reaction in tech, as both VCs and, often, as founder is to agonize how scalable something is long before it has proven noteworthy."}, {"586f": "A favorite reason for passing on an investment can be boiled down to “I don’t see how this can be a billion dollar business”."}, {"a3b9": "I recently spoke with a founder who is working to answer the question at the heart of Seth’s post. Giacomo ‘Peldi’ Guilizzoni is the founder of the wireframing software company, Balsamiq. Our chat covered a wide range of topics, but it was his answers to my questions specific to scale that departed so completely from the VC funded startup narrative."}, {"b67d": "Peldi started Balsamiq nearly a decade ago. His intent was not be to it’s founder or CEO, but to be it’s only employee. Ever."}, {"780a": "Growth has never been a goal of ours. Our growth comes as a direct result of building a product customers love. We love talking with and listening to our customers. As their needs and challenges grow, our vision for how to support them grows too."}, {"956d": "But if growth isn’t the goal then what is?"}, {"d33a": "Our goal is to not mess it up! And to have good profit margins."}, {"41a8": "Unlike many founders who hit on something that’s working then rush to raise funding to scale, Balsamiq has chosen to take a more measured approach- consistently growing revenue and profits year of over year. Each year Peldi takes $1M out personally, socks away 18mo of runway for a rainy day, and pays out 15% of profits to Balsamiq’s 25 employees (this number grows by 2–3 new hires per year)."}, {"b26b": "Over the years, there has been plenty of pressure to scale, be it from waves of competitors (Peldi called 2011 their year of the Clone Wars™) or VC’s looking to use the company’s massive user base as the foundation to roll up similar startups to dominate the category. To which Peldi says:"}, {"b1c4": "Push us into prototyping tools? Design tools? Nope! Create a suite to go after Google Drive? Call InVision! All of those teams and all of those heavily funded strategies have to build complicated products so they can charge more. They can’t stay simple and reach the scale they need to meet investor expectations. They have to go up market. We don’t."}, {"ebd6": "What hasn’t Balsamiq been able to do without the support and resources that come from taking on outside investors? Sell."}, {"39b2": "In 2010 we almost sold the business. I was freaking out. I didn’t want to stop coding so I figured I needed to hire myself a boss or bring on someone to help me sell the business. Raising money to help me sell was very enticing. Problem was, everytime I let myself go there I couldn’t sleep. I couldn’t convince my team. I couldn’t shake the feeling of being a sellout. My head was saying “YES!” but every cell in my body was saying “NO!”."}, {"c1de": "Any regrets?"}, {"9d1b": "None. I’m my own boss. I don’t have to answer to anyone. I get to learn from my own mistakes instead of being fired for making them. We have no debts and we have no deadlines. There’s no pressure to take shortcuts, or please any outside shareholders. We get to spend our time in customer interviews not in board meetings."}, {"b718": "Back to Seth’s original question then. If scale isn’t the goal, then what is?"}, {"01d9": "I don’t believe in the hustle. The goal for us as a company is finding a balance in our work and in our life. Extreme growth sounds way too stressful! We aren’t some kids from the Bay Area Hacker News crowd hoping against hope to grab a winning lottery ticket. As a product person I want to spend the next 40–50yrs honing and perfecting this craft."}, {"259e": "I’m Italian. We measure things in generations, not quarters."}], "child": "801_1\t801_2\t801_3\t801_4\t801_5\t801_6\t801_7\t801_8\t801_9\t801_10\t801_11\t801_12\t801_13\t801_14\t801_15"}