{"name": "802", "parent": "", "content": "Build a Business, not a Startup For the longest time, I bought into the “exciting” startup life — colossal valuations, 80–100 hour work weeks with no time for interactions with family or friends, seed rounds, Series A, B, C investments, burnt out founders, no sleep, no time to eat, unnecessary hires, beautiful offices with “incredible team culture”, the same culture that disappears when you’re offered a shiny cheque for exiting your company. So. much. hype. These are all vanity metrics that startups have been tuned to believe are successful milestones. I remember getting laughed at when I asked some founders about their profitability plans — “that’s not how a startup works. High burn rates help generate revenue and then maybe in 10 years or so, we MIGHT break-even.” Both founders shut their companies a year later. Snapchat is the perfect example — their IPO terms warned that Snap may never be profitable. These terms have ruined it for the 90% of startups that are already running at odds to make their ventures succeed. Let me break down what the following really means for your business: Fundraising Raising investment means you just convinced someone to give you money and have some control of your company, it does not mean you now run a successful business. A group of investors that give you half a million pounds in your seed round just bought a piece of your company — congratulations. You no longer are at risk but their money is. What happens when you run out of this money? Not a problem. There is always Series A. And then of course Series B.. C.. D.. You now have to learn how to create investment reports because your investors will want to know every month how you’re spending their money and when you can triple their investments by. You are no longer in control. They are. Even if they only own a small amount of equity, the fact that you now report to them puts them in control. Gone are the days when you could pivot overnight or change strategy. You need permission. Life as a founder is stressful as it is. When you’re fundraising, you don’t have time for the other 100 hats that you need to wear. So when do you get time to generate your own money? At what point will your startup become self-sufficient so that you’re not constantly running after some investor’s money? The truth is you won’t have time if all you’re doing is blowing the cash and running after the next round of funding. This is why most funded startups run out of cash and die. Solution: I’m no expert, but based on advice I’ve received, this is what I would suggest: Press Achieving press means you convinced someone to write about your “exciting new product that still needs to be built and hasn’t offered value to anyone yet”, it does not mean you now run a successful business. Press generates traffic which eventually converts into customers so yes, press coverage is important but, do you deserve any credit? You just launched your business, you have 1 or 2 users, and the first thing you want is press? Once you land that big feature, instead of measuring the feature as your milestone, use real metrics that help you identify the best media channels to secure customers and bring in revenue. Office/Team Having a fancy office in the early stages of a business means you’re burning money to look good rather than investing in your team (bonuses, paid holiday trips, childcare, healthcare), building your product or impeccable customer service, it does not mean you run a successful business. If you’re limiting yourself to a geographic location, this means you’re unable to benefit from the talent pool available globally. As Jason Fried points out, most people will tell you their most productive hours are in quiet locations like their home, the train, on a flight, in coffee shops or with headphones on. Distributed teams that are able to benefit from flexible working locations allow you to build incredible and diverse teams that give you their best work. Time This one is a puzzler for me. Everyone in the startup world seems to be going at supersonic speeds. Afraid of competition. Afraid of failure. Why? Competition is healthy, it means that you have a market and also pushes you to do better. Failure allows you to learn and grow. So what are you racing against? Are you striving for quality or quantity? Over the last year, I’ve realised how wrong I was to fall for this ridiculous hype. What’s worse is that I was guilty of participating in it too. I’ve taken some time to reflect on why I voluntarily jumped on this rollercoaster and it wasn’t to build a temporary platform that impacts X number of lives and then gets destroyed on acquisition or exit just because I was bought out. I want to have a long-lasting impact. Impact that survives beyond me. Impact that is life-changing and benefits generations. Impact that transforms communities and economies. This kind of impact takes a lifetime, maybe more to make a dent in the universe. I don’t want an exit. I don’t want a big pay-out. I just want to improve lives and if I’m not financially stable to sustain the impact, I will always be dependent on others in which case I will be unable to achieve my goal. In pursuit of my own healthy work/life balance, I believe the key to achieving this is by giving others the opportunity to benefit from this first. Building a family at work is incredibly important for the success of a business. We’re not building a normal business — profitability and capital efficiency is high on the agenda but more importantly, we’re seeking family members, not employees, that speak the same language as us, are compassionate, selfless and giving towards their fellow members, understand the fire that drives us to build an impactful technology, and go the extra mile to do what’s right. We take inspiration from companies like Basecamp, Buffer and Mailchimp that have built incredibly successful tech companies whilst prioritising teams, profits and healthy environments. We want to build a workplace environment that values family needs — people working in an organisation are first and foremost humans and have their own personal battles and struggles — these need to be valued. Many studies have proven that fostering a family-friendly work environment significantly boosts productivity yet so many companies are failing to adopt this. This can involve a creche for employees with children and flexible leaves for new parents. I’m actually counting on this so that I too can benefit from it when my time comes :) Don’t get me wrong, I’m not saying that we won’t ever raise money, but when I do, I want to ensure I’ve prioritised the right metrics of running a successful business. Revenue. Profit. Team satisfaction. Happy customers. An incredible product. If you are running a business, not just a startup, I would love to hear what you’re doing to achieve this. ", "title": "Build a Business, not a Startup", "sentences": [{"9d22": "Build a Business, not a Startup"}, {"ef71": "For the longest time, I bought into the “exciting” startup life — colossal valuations, 80–100 hour work weeks with no time for interactions with family or friends, seed rounds, Series A, B, C investments, burnt out founders, no sleep, no time to eat, unnecessary hires, beautiful offices with “incredible team culture”, the same culture that disappears when you’re offered a shiny cheque for exiting your company."}, {"699d": "So. much. hype. These are all vanity metrics that startups have been tuned to believe are successful milestones."}, {"fc3e": "I remember getting laughed at when I asked some founders about their profitability plans — “that’s not how a startup works. High burn rates help generate revenue and then maybe in 10 years or so, we MIGHT break-even.” Both founders shut their companies a year later."}, {"3161": "Snapchat is the perfect example — their IPO terms warned that Snap may never be profitable. These terms have ruined it for the 90% of startups that are already running at odds to make their ventures succeed."}, {"55a4": "Let me break down what the following really means for your business:"}, {"63cc": "Fundraising"}, {"865a": "Raising investment means you just convinced someone to give you money and have some control of your company, it does not mean you now run a successful business."}, {"b636": "A group of investors that give you half a million pounds in your seed round just bought a piece of your company — congratulations. You no longer are at risk but their money is. What happens when you run out of this money? Not a problem. There is always Series A. And then of course Series B.. C.. D.."}, {"3911": "You now have to learn how to create investment reports because your investors will want to know every month how you’re spending their money and when you can triple their investments by. You are no longer in control. They are. Even if they only own a small amount of equity, the fact that you now report to them puts them in control. Gone are the days when you could pivot overnight or change strategy. You need permission."}, {"5722": "Life as a founder is stressful as it is. When you’re fundraising, you don’t have time for the other 100 hats that you need to wear. So when do you get time to generate your own money? At what point will your startup become self-sufficient so that you’re not constantly running after some investor’s money? The truth is you won’t have time if all you’re doing is blowing the cash and running after the next round of funding. This is why most funded startups run out of cash and die."}, {"7618": "Solution: I’m no expert, but based on advice I’ve received, this is what I would suggest:"}, {"f6ab": "Press"}, {"2639": "Achieving press means you convinced someone to write about your “exciting new product that still needs to be built and hasn’t offered value to anyone yet”, it does not mean you now run a successful business."}, {"0525": "Press generates traffic which eventually converts into customers so yes, press coverage is important but, do you deserve any credit? You just launched your business, you have 1 or 2 users, and the first thing you want is press?"}, {"a456": "Once you land that big feature, instead of measuring the feature as your milestone, use real metrics that help you identify the best media channels to secure customers and bring in revenue."}, {"16e4": "Office/Team"}, {"69a2": "Having a fancy office in the early stages of a business means you’re burning money to look good rather than investing in your team (bonuses, paid holiday trips, childcare, healthcare), building your product or impeccable customer service, it does not mean you run a successful business."}, {"99a5": "If you’re limiting yourself to a geographic location, this means you’re unable to benefit from the talent pool available globally. As Jason Fried points out, most people will tell you their most productive hours are in quiet locations like their home, the train, on a flight, in coffee shops or with headphones on. Distributed teams that are able to benefit from flexible working locations allow you to build incredible and diverse teams that give you their best work."}, {"2b0d": "Time"}, {"6c08": "This one is a puzzler for me. Everyone in the startup world seems to be going at supersonic speeds. Afraid of competition. Afraid of failure. Why? Competition is healthy, it means that you have a market and also pushes you to do better. Failure allows you to learn and grow. So what are you racing against? Are you striving for quality or quantity?"}, {"8e42": "Over the last year, I’ve realised how wrong I was to fall for this ridiculous hype. What’s worse is that I was guilty of participating in it too. I’ve taken some time to reflect on why I voluntarily jumped on this rollercoaster and it wasn’t to build a temporary platform that impacts X number of lives and then gets destroyed on acquisition or exit just because I was bought out. I want to have a long-lasting impact. Impact that survives beyond me. Impact that is life-changing and benefits generations. Impact that transforms communities and economies. This kind of impact takes a lifetime, maybe more to make a dent in the universe. I don’t want an exit. I don’t want a big pay-out. I just want to improve lives and if I’m not financially stable to sustain the impact, I will always be dependent on others in which case I will be unable to achieve my goal."}, {"c2eb": "In pursuit of my own healthy work/life balance, I believe the key to achieving this is by giving others the opportunity to benefit from this first. Building a family at work is incredibly important for the success of a business."}, {"fe9f": "We’re not building a normal business — profitability and capital efficiency is high on the agenda but more importantly, we’re seeking family members, not employees, that speak the same language as us, are compassionate, selfless and giving towards their fellow members, understand the fire that drives us to build an impactful technology, and go the extra mile to do what’s right. We take inspiration from companies like Basecamp, Buffer and Mailchimp that have built incredibly successful tech companies whilst prioritising teams, profits and healthy environments."}, {"2247": "We want to build a workplace environment that values family needs — people working in an organisation are first and foremost humans and have their own personal battles and struggles — these need to be valued. Many studies have proven that fostering a family-friendly work environment significantly boosts productivity yet so many companies are failing to adopt this. This can involve a creche for employees with children and flexible leaves for new parents. I’m actually counting on this so that I too can benefit from it when my time comes :)"}, {"af98": "Don’t get me wrong, I’m not saying that we won’t ever raise money, but when I do, I want to ensure I’ve prioritised the right metrics of running a successful business. Revenue. Profit. Team satisfaction. Happy customers. An incredible product."}, {"631e": "If you are running a business, not just a startup, I would love to hear what you’re doing to achieve this."}], "child": "802_1\t802_2\t802_3\t802_4"}