{"name": "808", "parent": "", "content": "MicroConf 2017 tips Your guide to attending the conference for self-funded startups Every spring, thousands of bootstrapped entrepreneurs descend on Las Vegas for MicroConf. The brainchild of Rob Walling and Mike Taber, this event bucks the startup trend: it’s not for venture-funded companies. “MicroConf is a great place to meet like-minded people who are self-funding their businesses. It’s one of the best places to make friends with other people in the same situation as you. In fact, it is one of the few places you can do that!” — Hiten Shah I recently hosted a pre-MicroConf hangout: Some great people showed up: Josh Earl, Brian Hogg, Jacob Thurman, Josh Doody, Ryan Battles, and Ben Orenstein. Together, we came up with these tips for attendees: Come for the “hallway track.” The “hallway track” refers to hanging out with other attendees outside of the main talks. People repeatedly cite it as the best part about MicroConf. Here are a few things to remember: Make a plan for who you want meet, and what topics you want to discuss. If you have specific folks you’d like to ask questions of, write a list of their names and what topic you’d like to discuss. Pro tip: add yourself to this Who is coming to MicroConf? list and connect with people ahead of time! But… also be open to meeting “sleeper attendees.” At any event, there’s always people everyone wants to talk to, and then there are folks who aren’t as well-known. Outside of the bloggers, podcasters, and “internet famous” people you’ve heard of, there are tons of amazing entrepreneurs at MicroConf, with awesome stories to tell. Rehearse your answer to: “what are you working on?” People at MicroConf are curious! They’ll want to know what you’re working on. Don’t be self-conscious. Just tell them about your main project, or pitch them on your business idea. One idea is to host a reception in your room during the evenings. Buy some drinks, and give out personal invitations (be sure to invite a wide variety of people!) Breakfast can be a great opportunity to meet new people. Wander down to the Beach Cafe in the morning, and ask to join a table! Be vulnerable. You don’t need to pretend at MicroConf. If you’re struggling with something, share it with others! It’s likely other people have been where you’re at now. Be open and honest; no need to fake it. The hallway track is the best part of MicroConf. The talks MicroConf talks are packed with tactics. Want to get the most out of them? Leave your laptop in your room. It’s way too easy to get distracted during a talk by Slack, your email, and other work that needs to be done. Bring a pen and paper, or write notes on your iPhone. You don’t need to take photos of each slide. Most speakers make their slides available afterwords, and the talks are also recorded. Kai Davis also writes notes at microconfrecap.com. Enjoying a talk? Let the speaker know! Quote a notable line on Twitter (use the #microconf hashtag), or tell them afterwards. Giving a talk? MicroConf is unique in that there are keynote talks as well as talks from attendees. Here are some tips for speaking at MicroConf: Hotel, taxi and travel My friend Jimmy Jacobson, of Wedgies, lives in Las Vegas. Here is his advice: You can use Uber or Lyft at the airport, but just make sure you pay attention to the notice that they will pick you up on level 2M of the parking garage (that’s one level up from passenger pickup). If you are cool with a taxi, then just follow the signs to the taxi stand. It’s fast and efficient as well. The Cosmopolitan is reasonably close to Tropicana and has one of the only non chain coffee shops on the strip. It also has some good but reasonably priced eats (for the strip). Also, Mike Taber just reminded me of this important tip: If the taxi driver asks if you want to take the highway, say no. The highway goes south out of the airport and then all the way around the airport. Not applicable to Uber or Lyft, since they’re much better about not ripping you off because of maps and such. Other advice Was this helpful? Please give it a ♥ so other people can find it. Resources on the web Cheers,Justin Jackson@mijustin A weekly newsletter for independent makers Like this? You’ll dig Indie Newsletter. If you’re a developer, designer, or entrepreneur making an independent income from digital products (or you want to), this newsletter is for you. Subscribe here: Originally published at justinjackson.ca on March 29, 2017. ", "title": "MicroConf 2017 tips", "sentences": [{"b01b": "MicroConf 2017 tips"}, {"414f": "Your guide to attending the conference for self-funded startups"}, {"ad3a": "Every spring, thousands of bootstrapped entrepreneurs descend on Las Vegas for MicroConf."}, {"17c0": "The brainchild of Rob Walling and Mike Taber, this event bucks the startup trend: it’s not for venture-funded companies."}, {"5be1": "“MicroConf is a great place to meet like-minded people who are self-funding their businesses. It’s one of the best places to make friends with other people in the same situation as you. In fact, it is one of the few places you can do that!” — Hiten Shah"}, {"3e23": "I recently hosted a pre-MicroConf hangout:"}, {"5abf": "Some great people showed up: Josh Earl, Brian Hogg, Jacob Thurman, Josh Doody, Ryan Battles, and Ben Orenstein."}, {"1189": "Together, we came up with these tips for attendees:"}, {"ce5a": "Come for the “hallway track.”"}, {"4f0c": "The “hallway track” refers to hanging out with other attendees outside of the main talks. People repeatedly cite it as the best part about MicroConf."}, {"8965": "Here are a few things to remember:"}, {"c748": "Make a plan for who you want meet, and what topics you want to discuss. If you have specific folks you’d like to ask questions of, write a list of their names and what topic you’d like to discuss."}, {"8573": "Pro tip: add yourself to this Who is coming to MicroConf? list and connect with people ahead of time!"}, {"d69f": "But… also be open to meeting “sleeper attendees.” At any event, there’s always people everyone wants to talk to, and then there are folks who aren’t as well-known. Outside of the bloggers, podcasters, and “internet famous” people you’ve heard of, there are tons of amazing entrepreneurs at MicroConf, with awesome stories to tell."}, {"ae67": "Rehearse your answer to: “what are you working on?” People at MicroConf are curious! They’ll want to know what you’re working on. Don’t be self-conscious. Just tell them about your main project, or pitch them on your business idea."}, {"686c": "One idea is to host a reception in your room during the evenings. Buy some drinks, and give out personal invitations (be sure to invite a wide variety of people!)"}, {"7141": "Breakfast can be a great opportunity to meet new people. Wander down to the Beach Cafe in the morning, and ask to join a table!"}, {"e4dd": "Be vulnerable. You don’t need to pretend at MicroConf. If you’re struggling with something, share it with others! It’s likely other people have been where you’re at now. Be open and honest; no need to fake it."}, {"ba85": "The hallway track is the best part of MicroConf."}, {"8055": "The talks"}, {"3499": "MicroConf talks are packed with tactics. Want to get the most out of them?"}, {"67df": "Leave your laptop in your room. It’s way too easy to get distracted during a talk by Slack, your email, and other work that needs to be done. Bring a pen and paper, or write notes on your iPhone."}, {"f021": "You don’t need to take photos of each slide. Most speakers make their slides available afterwords, and the talks are also recorded. Kai Davis also writes notes at microconfrecap.com."}, {"dd2f": "Enjoying a talk? Let the speaker know! Quote a notable line on Twitter (use the #microconf hashtag), or tell them afterwards."}, {"8e9d": "Giving a talk?"}, {"8070": "MicroConf is unique in that there are keynote talks as well as talks from attendees. Here are some tips for speaking at MicroConf:"}, {"a6d5": "Hotel, taxi and travel"}, {"2d0e": "My friend Jimmy Jacobson, of Wedgies, lives in Las Vegas. Here is his advice:"}, {"3100": "You can use Uber or Lyft at the airport, but just make sure you pay attention to the notice that they will pick you up on level 2M of the parking garage (that’s one level up from passenger pickup)."}, {"b0c1": "If you are cool with a taxi, then just follow the signs to the taxi stand. It’s fast and efficient as well."}, {"155a": "The Cosmopolitan is reasonably close to Tropicana and has one of the only non chain coffee shops on the strip. It also has some good but reasonably priced eats (for the strip)."}, {"11c5": "Also, Mike Taber just reminded me of this important tip:"}, {"66c3": "If the taxi driver asks if you want to take the highway, say no. The highway goes south out of the airport and then all the way around the airport. Not applicable to Uber or Lyft, since they’re much better about not ripping you off because of maps and such."}, {"df7d": "Other advice"}, {"0397": "Was this helpful? Please give it a ♥ so other people can find it."}, {"0290": "Resources on the web"}, {"b874": "Cheers,Justin Jackson@mijustin"}, {"10a8": "A weekly newsletter for independent makers"}, {"9ec1": "Like this? You’ll dig Indie Newsletter."}, {"f40c": "If you’re a developer, designer, or entrepreneur making an independent income from digital products (or you want to), this newsletter is for you."}, {"d9ed": "Subscribe here:"}, {"0ddd": "Originally published at justinjackson.ca on March 29, 2017."}], "child": "808_1\t808_2808_1\t808_2808_1\t808_2"}