{"name": "810", "parent": "", "content": "Lean Agile Scotland… the next chapter In the beginning In the Autumn of 2011 I started on a journey that would challenge me in ways I never imagined and would change my life immeasurably. Having tried unsuccessfully to attend a number of the Lean Kanban series conferences I decided to organise my own conference… after all how hard could it be, right? While I was keen to explore what was emerging from the Lean Kanban community at the time I felt that Scotland needed something with a broader appeal, something that would allow us to explore the full breadth and depth of the value stream of effective software delivery, so decided to organise Lean Agile Scotland. Within a few weeks David J Anderson and Liz Keogh had agreed to give keynote speeches and my expectations about what the conference could be began to rise. After what can only be described as an intense year of organising, #lascot12 opened on the 21st of September 2012 at 9am with 114 attendees, 26 speakers and a 8 helpers. While the core of the content was drawn from the Kanban community there were also sessions on BDD, Scrum, Software Craftsmanship, a mini track on Rightshifting and more. Those two days were an exhilarating and emotional experience, I made many new friends and watched many other friendships form. When I look back the tweet below from Ben Forrest always springs to mind and helps cement the fond memories I have of that year. Since 2012 Lean Agile Scotland has grown each year not only in numbers (372 attendees in 2016 with 73 speakers) but also in breadth of content. In 2013 we welcomed Dave Snowden as a keynote speaker and the complexity journey began, this was further cemented as a key theme for the conference in 2015 when philosopher Alicia Juarrero keynoted. The community Over the years I’ve received great feedback and have often pondered what makes #lascot so special. For many years I thought I was the only one who experienced the feeling but I’ve come to realise that many care deeply for the conference and the connections they make on those days each year. In Chris Matts talk in 2016 he described his ideas behind community of needs and community of solutions. He then asked the audience how they would categories #lascot, the overwhelming majority described it as a community of needs, Roisi Proven adding that: “when I go to other conferences I feel like I’m poking a bear when I try and enter into a discussion, where as here it’s like poking a kitten that rolls on it’s back and says… hello”. What is it that contributes to making this a community of needs? Is it the location? Jabe Bloom once remarked that “most cities have bronze statues of great soldiers who led armies into battle. Edinburgh has statues of philosophers, instead!”. Is it the care and attention that Marc and I put into the programme? The balance between speakers who we know will challenge the community to think differently and the introductory content for those starting out in their journey. Is it those practitioners who care deeply for the community that travel each year to be part of the event? I think we could say that Lean Agile Scotland might well be a place of multiple belongings. The challenge Each year I’ve received great help from friends and family for which I am truly grateful. After a particularly challenging year in 2014 I was joined in 2015 by my good friend Marc Burgauer who has helped shape the conference since. Lucy Burns also joined in on preparations for 2015 and has added much needed support in the organisation of the logistical elements. While I may have been able to keep LAS going for another couple of years the levels of stress, often anxiety, it induces on me and more so what it asks of my family cannot be sustained. The many many evenings each year sitting at my laptop away from Julia is not something either of us relish. Over the years I’ve seen great conferences come and go and felt the sadness and loss in the community as that time of year where they usually would gather pass without their favourite event taking place. I didn’t want to see this happen to the Lean Agile Scotland community. On the flip side I’ve often pondered what else Lean Agile Scotland could contribute to the community both globally and here in Scotland. Clearly sustaining the conference has proved to be a big enough challenge let alone have it contribute more. What’s next… In April 2016 Mark Dalgarno a fellow Scot, Agile practitioner and highly experienced conference organiser who I’ve known for a number of years approached me and asked if I’d be interested in passing on the responsibility of organising the conference to his company Software Acumen while still leading on the design of the programme and hosting the event. In the following months Mark and I had a number of discussions around the topics of community, diversity and the role of the conference and found that we think and act along the same lines. After giving it many months of consideration I’m delighted to say that I decided to pass on the conference to Mark and his team. Not only is Lean Agile Scotland now in safe hands that will secure it’s future but it also has an opportunity to grow and contribute more to the community. With over 10 years experience in organising events and the passion Mark, and the team at Software Acumen, have for the community combined with the on going contribution to the programme and event feel that Marc B and I will bring I am excited for the future of Lean Agile Scotland. You can read Marks thoughts in his Lean Agile Scotland – postscript here. Thank you! Since its incarnation I have cared deeply for the conference and the community that has grown around it and I’m delighted that this has the opportunity continue. But it has never been just the work of one person and I’d like to thank everyone who has attended, presented, shared their ideas with our community, helped shape the programme, helped on the day, spread the word about the conference and contributed in the many ways you have. Of course a special thanks goes to Marc and Lucy for everything you’ve done. Without doubt the biggest thank you is reserved for my beloved wife Julia who has supported my efforts throughout, been an ever present sounding board and notably packed over 300 delegate bags single handedly in 2014 while 7 months pregnant!. Thank you, always ❤️ I look forward to seeing you at #lascot17! ", "title": "Lean Agile Scotland… the next chapter", "sentences": [{"1b8a": "Lean Agile Scotland… the next chapter"}, {"6673": "In the beginning"}, {"8813": "In the Autumn of 2011 I started on a journey that would challenge me in ways I never imagined and would change my life immeasurably."}, {"8e1b": "Having tried unsuccessfully to attend a number of the Lean Kanban series conferences I decided to organise my own conference… after all how hard could it be, right? While I was keen to explore what was emerging from the Lean Kanban community at the time I felt that Scotland needed something with a broader appeal, something that would allow us to explore the full breadth and depth of the value stream of effective software delivery, so decided to organise Lean Agile Scotland. Within a few weeks David J Anderson and Liz Keogh had agreed to give keynote speeches and my expectations about what the conference could be began to rise."}, {"9f60": "After what can only be described as an intense year of organising, #lascot12 opened on the 21st of September 2012 at 9am with 114 attendees, 26 speakers and a 8 helpers. While the core of the content was drawn from the Kanban community there were also sessions on BDD, Scrum, Software Craftsmanship, a mini track on Rightshifting and more. Those two days were an exhilarating and emotional experience, I made many new friends and watched many other friendships form. When I look back the tweet below from Ben Forrest always springs to mind and helps cement the fond memories I have of that year."}, {"b2b9": "Since 2012 Lean Agile Scotland has grown each year not only in numbers (372 attendees in 2016 with 73 speakers) but also in breadth of content. In 2013 we welcomed Dave Snowden as a keynote speaker and the complexity journey began, this was further cemented as a key theme for the conference in 2015 when philosopher Alicia Juarrero keynoted."}, {"7624": "The community"}, {"aba9": "Over the years I’ve received great feedback and have often pondered what makes #lascot so special. For many years I thought I was the only one who experienced the feeling but I’ve come to realise that many care deeply for the conference and the connections they make on those days each year. In Chris Matts talk in 2016 he described his ideas behind community of needs and community of solutions. He then asked the audience how they would categories #lascot, the overwhelming majority described it as a community of needs, Roisi Proven adding that:"}, {"3e06": "“when I go to other conferences I feel like I’m poking a bear when I try and enter into a discussion, where as here it’s like poking a kitten that rolls on it’s back and says… hello”."}, {"c874": "What is it that contributes to making this a community of needs? Is it the location? Jabe Bloom once remarked that “most cities have bronze statues of great soldiers who led armies into battle. Edinburgh has statues of philosophers, instead!”. Is it the care and attention that Marc and I put into the programme? The balance between speakers who we know will challenge the community to think differently and the introductory content for those starting out in their journey. Is it those practitioners who care deeply for the community that travel each year to be part of the event? I think we could say that Lean Agile Scotland might well be a place of multiple belongings."}, {"9de3": "The challenge"}, {"2f3a": "Each year I’ve received great help from friends and family for which I am truly grateful. After a particularly challenging year in 2014 I was joined in 2015 by my good friend Marc Burgauer who has helped shape the conference since. Lucy Burns also joined in on preparations for 2015 and has added much needed support in the organisation of the logistical elements."}, {"7dca": "While I may have been able to keep LAS going for another couple of years the levels of stress, often anxiety, it induces on me and more so what it asks of my family cannot be sustained. The many many evenings each year sitting at my laptop away from Julia is not something either of us relish."}, {"3370": "Over the years I’ve seen great conferences come and go and felt the sadness and loss in the community as that time of year where they usually would gather pass without their favourite event taking place. I didn’t want to see this happen to the Lean Agile Scotland community. On the flip side I’ve often pondered what else Lean Agile Scotland could contribute to the community both globally and here in Scotland. Clearly sustaining the conference has proved to be a big enough challenge let alone have it contribute more."}, {"597f": "What’s next…"}, {"237f": "In April 2016 Mark Dalgarno a fellow Scot, Agile practitioner and highly experienced conference organiser who I’ve known for a number of years approached me and asked if I’d be interested in passing on the responsibility of organising the conference to his company Software Acumen while still leading on the design of the programme and hosting the event. In the following months Mark and I had a number of discussions around the topics of community, diversity and the role of the conference and found that we think and act along the same lines."}, {"8a99": "After giving it many months of consideration I’m delighted to say that I decided to pass on the conference to Mark and his team. Not only is Lean Agile Scotland now in safe hands that will secure it’s future but it also has an opportunity to grow and contribute more to the community. With over 10 years experience in organising events and the passion Mark, and the team at Software Acumen, have for the community combined with the on going contribution to the programme and event feel that Marc B and I will bring I am excited for the future of Lean Agile Scotland. You can read Marks thoughts in his Lean Agile Scotland – postscript here."}, {"0fcb": "Thank you!"}, {"e030": "Since its incarnation I have cared deeply for the conference and the community that has grown around it and I’m delighted that this has the opportunity continue. But it has never been just the work of one person and I’d like to thank everyone who has attended, presented, shared their ideas with our community, helped shape the programme, helped on the day, spread the word about the conference and contributed in the many ways you have. Of course a special thanks goes to Marc and Lucy for everything you’ve done."}, {"e402": "Without doubt the biggest thank you is reserved for my beloved wife Julia who has supported my efforts throughout, been an ever present sounding board and notably packed over 300 delegate bags single handedly in 2014 while 7 months pregnant!. Thank you, always ❤️"}, {"f754": "I look forward to seeing you at #lascot17!"}], "child": "810_1\t810_2\t810_3\t810_4\t810_5\t810_6"}