{"name": "812", "parent": "", "content": "Our Lightning Talks Sessions are up! source: https://commons.wikimedia.org/wiki/Lightning#/media/File:Orage_%C3%A0_Annemasse.jpg We’re pretty excited to announce our list of lightning talks this year. We received many great proposals and decided to add an extra lightning session slot on the second day. Here is our full list of lightning talks: How to create a React Native reusable component for existing Android apps without knowing a thing about npm or node_modules by Petter Hesselberg Quantifying Best Practices by Jackson Hamburger and Louis Antonelli Thousand ways to navigate in React Native by Charles Mangwa Smarter code-splitting and preloading for React applications by Brandon Dail Leveraging code-splitting in React apps by Glenn Reyes Devtools for dataloading: how GraphQL devtools make the Frontend Dev experience great! by Danielle Man Expo Snack by Brent Vatne return null; by Joshua Comeau ShoutemUI by the Shoutem team Fancy Footwork: Building a Composable CMS for Aldo by Brendan Moore, Sarah Mogin and Serge Rose Detox — Graybox End-to-End Tests and Automation Library for React Native by Tal Kol That’s it for our lightning sessions! Cheers and see you at the conf! Follow us on Twitter and Facebook. We still have a few sponsorship tickets available, contact us here and also very few hackathon tickets. ", "title": "Our Lightning Talks Sessions are up!", "sentences": [{"bcef": "Our Lightning Talks Sessions are up!"}, {"1478": "source: https://commons.wikimedia.org/wiki/Lightning#/media/File:Orage_%C3%A0_Annemasse.jpg"}, {"eaf6": "We’re pretty excited to announce our list of lightning talks this year. We received many great proposals and decided to add an extra lightning session slot on the second day."}, {"8f49": "Here is our full list of lightning talks:"}, {"5aa6": "How to create a React Native reusable component for existing Android apps without knowing a thing about npm or node_modules by Petter Hesselberg"}, {"4032": "Quantifying Best Practices by Jackson Hamburger and Louis Antonelli"}, {"c286": "Thousand ways to navigate in React Native by Charles Mangwa"}, {"ba77": "Smarter code-splitting and preloading for React applications by Brandon Dail"}, {"2d53": "Leveraging code-splitting in React apps by Glenn Reyes"}, {"6f62": "Devtools for dataloading: how GraphQL devtools make the Frontend Dev experience great! by Danielle Man"}, {"3878": "Expo Snack by Brent Vatne"}, {"e7d4": "return null; by Joshua Comeau"}, {"18cc": "ShoutemUI by the Shoutem team"}, {"eb7b": "Fancy Footwork: Building a Composable CMS for Aldo by Brendan Moore, Sarah Mogin and Serge Rose"}, {"c9c0": "Detox — Graybox End-to-End Tests and Automation Library for React Native by Tal Kol"}, {"6b96": "That’s it for our lightning sessions!"}, {"55f6": "Cheers and see you at the conf!"}, {"a8de": "Follow us on Twitter and Facebook. We still have a few sponsorship tickets available, contact us here and also very few hackathon tickets."}], "child": "812_1\t812_2"}