{"name": "813", "parent": "", "content": "Welcome to the Isle of Ruby We’re in the midst of organising a brand new event for the Ruby community. In its simplest form, it will be a conference. We aspire though to create something bigger — a festival of sorts. A festival for our craft — for technology and for Ruby, our programming language of choice. Technology does not exist in a vacuum. The political upheavals of the last year surely remind us of this. We want to spur on members of our community to consider how the work we do affects the world around us. We will bring in people from other programming communities and disciplines to help us explore some of these questions. Isle of Ruby will take place in Devon from 10th-13th August, at the height of the English summer. There will be more than ample time for outdoor activities and socialising. Partners and family are welcome to join us. The conference will be run as a partnership between the non-profit Ruby Berlin e.V. and members of the Ruby community in the U.K. Our team has experience organising such events as eurucamp, EuRuKo 2012, and Rails Girls Berlin workshops. Over the coming weeks we’ll give more details about the format of the event. Members of our team will have the chance to introduce themselves personally and talk about their motivation for being part of Isle of Ruby. Follow us here and on Twitter for the latest news. Call for Papers will open later this month. We hope to see you in August! ", "title": "Welcome to the Isle of Ruby", "sentences": [{"1301": "Welcome to the Isle of Ruby"}, {"5aba": "We’re in the midst of organising a brand new event for the Ruby community. In its simplest form, it will be a conference. We aspire though to create something bigger — a festival of sorts. A festival for our craft — for technology and for Ruby, our programming language of choice."}, {"d5ed": "Technology does not exist in a vacuum. The political upheavals of the last year surely remind us of this. We want to spur on members of our community to consider how the work we do affects the world around us. We will bring in people from other programming communities and disciplines to help us explore some of these questions."}, {"e2c0": "Isle of Ruby will take place in Devon from 10th-13th August, at the height of the English summer. There will be more than ample time for outdoor activities and socialising. Partners and family are welcome to join us."}, {"740d": "The conference will be run as a partnership between the non-profit Ruby Berlin e.V. and members of the Ruby community in the U.K. Our team has experience organising such events as eurucamp, EuRuKo 2012, and Rails Girls Berlin workshops."}, {"5af1": "Over the coming weeks we’ll give more details about the format of the event. Members of our team will have the chance to introduce themselves personally and talk about their motivation for being part of Isle of Ruby."}, {"3c12": "Follow us here and on Twitter for the latest news. Call for Papers will open later this month."}, {"1930": "We hope to see you in August!"}], "child": "813_1"}