{"name": "817", "parent": "", "content": "Krótko o tym, jak sprawić, żeby konferencje i spotkania branżowe były lepsze. W oparciu o krótkie badanie* oraz moje przemyślenia. Mam taką teorię, że wszystko co robimy jest tylko na tyle dobre na ile się w to zaangażujemy. Jeśli oglądamy serial, grając jednocześnie w grę na telefonie, to — nawet jeśli serial jest świetny — nie będziemy go tak przeżywać. Jeśli jesteśmy na spotkaniu ze znajomymi, ale cały czas sms-ujemy z dziewczyną, którą poznaliśmy poprzedniego wieczoru, to spotkanie to nie zapadnie nam w pamięci jako udane i wartościowe. Przeżycie pełnego doświadczenia wymaga pełnego zaangażowania. To samo dotyczy konferencji i spotkań branżowych. Jeśli pójdziemy na konferencję po czym usiądziemy wygodnie w fotelu i będziemy jedynie słuchać prezentacji, to najpewniej nie wyjdziemy w pełni usatysfakcjonowani. Konferencja wymaga pełnej interakcji. Dla pełnego zadowolenia widownia powinna być tak samo zaangażowana jak prezentujący. Nie tylko słuchać, ale też mówić — zadawać pytania lub rozmawiać z innymi jej członkami. W innym przypadku po co na nią w ogóle iść, skoro moglibyśmy obejrzeć stream z domu? Dlatego też wpadłem na pomysł przeprowadzenia badania* na osobach z facebookowych grup Polish Designers i Usability PL w celu sprawdzenia jakości interakcji i zaangażowania podczas spotkań branżowych. Chciałem by cel tej krótkiej ankiety nie był oczywisty, więc jako skupiłem się na chęci prezentowania i zadawania pytań. Te dwa podstawowe sposoby zaangażowania się w spotkanie branżowe posłużą mi za wskaźniki czy i jak zaangażowani jesteśmy w tego typu wydarzenia. Artykuł ten będzie pewnie najciekawszy dla organizatorów wydarzeń i prezentujących, ale może też pokazać nowy punkt widzenia dla tych, którzy wolą być odbiorcami. Jeżeli wolisz patrzeć na konkretne dane zamiast czytać moją ich interpretację, pełne wyniki są dostępne dla wszystkich tutaj: https://docs.google.com/spreadsheets/d/1NGpI82jbQgPbXvJxuzxs_7QLz8qlUQZ1f-_hpFji-R4/edit?usp=sharing Odpowiedzi na pierwsze pytania były zgodne z moimi założeniami: Ze 149 odpowiedzi 82% respondentów bywa na wydarzeniach branżowych a 18% nigdy na żadnym nie było. Co ciekawe, jedynie ćwierć z tych 18%, czyli mniej więcej 4.5% wszystkich wypełniających ankietę, uważa wydarzenia na stratę czasu. Ponad 95% z nas jest odbiorcami lub potencjalnymi odbiorcami tego typu wydarzeń! Jaką jesteśmy widownią? Ku mojej ogromnej uldze 0% (słownie: zero) respondentów stwierdziło, że prezentacje są idealne i nie trzeba już o nic dopytywać. Wiemy dzięki temu, że zdecydowanie istnieje potrzeba nawiązaniu dialogu. Ponad połowa (61%) osób uczęszczające na tego typu wydarzenia stwierdziła, że zadaje pytania, chociaż jedynie 6% wybrało odpowiedź “jasne” a aż 55% “czasami”. Ponadto istnieje też grupa niemal 40%, która nigdy nie zadaje pytań! Mnie osobiście ten wynik zaskoczył — skąd wynika nasza niechęć do podjęcia dialogu z prezentującymi? Na szczęście dokładnie o tym było następne pytanie… Ponad 60% osób twierdzi, że nic im od razu nie przychodzi do głowy, a połowa wstydzi się i boi się, że się wygłupi. To dość poważne powody, ale na szczęście jest parę pomysłów (w ostatniej części tego artykułu) jak je rozwiązać. Jak prezentujemy? Kolejny wynik, którego się nie spodziewałem, to aż 88% respondentów zgłaszających chęć prezentowania — to zaskakująco duża liczba. Jeśli zauważymy, że jedynie 16% respondentów kiedyś już prezentowało, daje nam to wspaniały potencjał 71% respondentów, którzy nigdy jeszcze nie mieli okazji podzielić się swoją unikalną perspektywą, a być może będą chcieli w przyszłości. Zaledwie dwie osoby (niecałe 2%) prezentowały w przeszłości ale nie zamierzają tego powtórzyć. Jeśli już szukamy prelegentów, to warto wiedzieć, że praktycznie wszyscy (97%) chętni do prezentowania zwracają uwagę na dwa podstawowe czynniki: temat — muszą się czuć w nim pewnie — oraz (70%) czas na przygotowanie. Niezmiernie ucieszyłem się również z zaledwie dwóch odpowiedzi “żeby nie było pytań od publiczności”. Osoby prezentujące raczej nie będą blokadą dla podjęcia dialogu. Spośród osób, które nie wyrażają chęci prezentowania, dwa największe powody to zbyt duży stres (53%) oraz brak ciekawych rzeczy do opowiedzenia (aż 47%!). Muszę jednak przyznać, że przy zaledwie piętnastu odpowiedziach na to pytanie, istotność tych wyników pozostawia wiele do życzenia. Dla mnie osobiście zawsze najciekawszą częścią każdej ankiety jest ostatnie pytanie otwarte, w którym liczyłem (i nie zawiodłem się!) na ciekawe przemyślenia. Raz jeszcze zachęcam do przejrzenia pełnych wyników, al część cytatów można przeczytać (w oryginalnej pisowni) poniżej w tym artykule. Problemy i rozwiązania? Jeśli organizujesz konferencje lub prezentujesz, to może być część dla Ciebie. Wykluczyłem wszystkie uwagi typu “tematy są nieciekawe” czy “prezenter jest kiepski” bo — choć często mają w sobie wiele prawdy — obawiam się, że niewiele wnoszą do dyskusji nad rozwiązaniem tego problemu. Do każdego zagadnienia dołączam cytat bezpośrednio z pytań otwartych ankiety. Problem wstydu i strachu przed konfrontacją Choć zdaje się, że problem ten nie istnieje dla tych z nas, którzy są już gotowi prezentować (tylko dwie osoby na 106 stwierdziły, że nie chcą pytań od publiczności) to jednak okazuje się, że to dość powszechna bolączka wśród odbiorców. Aż 31 na 47 respondentów nie chcących zadawać pytań stwierdziło, że boją się, że się wygłupią i/lub wstydzą się wystąpień publicznych. może przygotować taką skrzyneczkę jak urna wyborcza do wrzucania pytań do prelegentów jeśli ktoś się wstydzi zapytać przy publiczności? RozwiązanieJest wiele dostępnych obecnie sposobów, które pomogą nam obejść ten problem. Na przykład zadawanie (anonimowych?) pytań przez stronę mobilną czy aplikację tak, żeby każdy miał szansę spokojnie sformułować swoje pytanie (na przykład sli.do: https://www.sli.do/). Zastanowiłabym się także nad fajnymi pomysłami zadawania pytań, bo nie każdy ma odwagę zadać pytanie przed setką czy większą ilością ludzi. Lepsze są formy zadawania ich anonimowo i wybierania przez prowadzących najlepszych pytań. Pozwala to skrócić dyskusje na bezsensowne tematy (a czasem jest ich dużo) oraz dać każdemu równa szansę na zadanie pytania. Ciekawym wariantem tego rozwiązania jest zadawanie pytań w komentarzach na stronie wydarzenia na facebooku (piona Experience Night! https://www.facebook.com/experiencenight/), dzięki czemu prezenter ma szansę odpowiedzieć na wszystkie pytania (a widz je zadać) nawet w kilka dni po wydarzeniu, a także podjąć dyskusję na którą nie starczyło czasu podczas spotkania czy afterparty. Warto pamiętać, że nie jest to opcja anonimowa, więc niektórzy mogą bać się ośmieszenia przed szerszym gronem. Mimo wszystko jestem przekonany, że zalety tego rozwiązania są warte tego ryzyka i mogę je z własnego doświadczenia serdecznie polecić. WTF networking? Grupa dorosłych ludzi nie jest w stanie nawiązać ze sobą sensownej rozmowy? Niestety, znamy to aż za dobrze. Dość duża liczba komentarzy wspominających o tym temacie zdaje się potwierdzać powszechność tego problemu. Najsłabsza cześć polskich wydarzeń na których byłem to newtorking, który nie odbywa sie prawie wcale. Ludzie są jakby przestraszeni, trzymają się tylko we własnych grupkach. Zapytani o opinie na dowolny temat boja się mówić. RozwiązanieZ pewnością nie jest łatwo sprawić, żeby ludzie nagle stali się bardziej otwarci. Jak widać pozostawienie ludzi samych sobie z drinkiem w dłoni nie sprawdza się w stu procentach. Być może warto zatem spróbować różnych gier czy zadań, które znamy z zajęć budujących zespół. Ponadto istnieją także coraz bardziej innowacyjne rozwiązania, takie jak na przykład Idea mixer: https://www.polidea.com/blog/Our_Conference_Networking_Game_Idea_Mixer/Na pewno warto nieustannie próbować udoskonalić tę część spotkań, gdyż, jak widać, są osoby dla których to właśnie jest najważniejsza ich część: Zwykle na takich wydarzeniach ciekawiej jest przy piwku pogadać z innymi dyzajnerami i dowiedzieć się czegoś interesującego od nich niż na samych prelekcjach. Za mało czasu, zbyt szybkie tempo… 61% osób twierdzi, że żadne pytania im nie przychodzą do głowy od razu po wystąpieniu. Jednym ze sposobów może być zadawanie pytań po spotkaniu (patrz wyżej). Drugim, który może pozytywnie wpłynąć na poczucie interakcji i zaangażowania w trakcie konferencji, jest budowanie oczekiwania dialogu od samego początku… Według mnie często brakuje moderowanych dyskusji na koniec, co pozwoliłoby lepiej zaangażować słuchaczy i bardziej zgłębić i zrozumieć temat. Problemem jest także dla mnie szybkie przechodzenie pomiędzy różnymi tematami, co nie pozwala przetrawić i przemyśleć poprzedniego tematu. RozwiązanieUstalenie ram czasowych tak, żeby były znane dla wszystkich — zarówno prezentujących jak i publiczności— pomoże zbudować pewne oczekiwania wobec obu stron. Na przykład: jeśli prezentacja trwa 20 minut, a na pytania jest bezwzględnie odłożone 10 minut (i oznaczone w planie wydarzenia oraz przed każdą prezentacją), jest większa szansa, że widownia zmobilizuje się do zadawania pytań wiedząc, że jest na nie wyznaczony czas. Dodatkowo przygotowanie i zadanie pierwszego pytania (oby nie wymagającego długiej odpowiedzi!) przez organizatorów może być świetnym początkiem dyskusji oraz dać dodatkowy czas na zastanowienie dla widowni. Pozwoli też zburzyć psychologiczną barierę bycia pierwszym pytającym, co dodatkowo powinno ułatwić interakcję. Pro tip: Jeśli prezentujesz i masz na widowni kogoś znajomego — przygotuj sobie jakieś pytanie (i odpowiedź) i poproś tę osobę, żeby je zadała ;) Słuchać to za mało… Siedzenie przez 45 minut i słuchanie prezentującego na pewno nie wpływa pobudzająco na poczucie otwartego dialogu. Jeśli prezentacja jest długa część osób nie będzie w stanie zapamiętać tego, co było na początku prezentacji i pod koniec nie będzie pewna czy pytanie ma w ogóle sens. Zazwyczaj na tego typu wydarzeniach, jest przedstawiana sama teoria, co często może nudzić słuchaczy, nawet kiedy jest mowa na temat, który nas interesuje, to po pewnym czasie, po prostu się wyłączamy. Dobrym rozwiązaniem może być zachęcenie użytkowników do interakcji, niektórzy mogą się stresować, ale można zrobić to anonimowo, a po zakończeniu zadania pokazywana jest prawidłowa odpowiedź RozwiązaniePrezentujący może wpleść w swoją prezentację interaktywne fragmenty, pytania do publiczności, podnoszenie rąk itp. Dzięki temu od samego początku widz będzie miał poczucie bardziej otwartego dialogu, a nie bycia jedynie biernym odbiorcą treści. Podobnie anonimowe głosowania przez strony mobilne mogą znacząco zwiększyć zaangażowanie publiczności. Co dalej? Jak widać, żadne z tych rozwiązań nie są jakoś szczególnie skomplikowane i trudne we wdrożeniu, a jestem przekonany, że zwiększenie zaangażowanie wszystkich osób obecnych na konferencji odbije się pozytywnie na jej odbiorze. W gruncie rzeczy jest to produkt taki jak wszystkie inne i powinniśmy ciągle ulepszać doświadczenie jego użytkowników. A Ty jakie znasz sposoby na usprawnienie interakcji na tego typu wydarzeniach? Może jest jakieś rozwiązanie które powinno być wdrożone na absolutnie każdej konferencji? A może to coś zupełnie innego jest dla Ciebie największym problemem? Daj znać! Do zobaczenia na następnym spotkaniu! Nie zapomnij mnie o coś zapytać;) Post Scriptum *Nie oszukujmy się, wiele temu “badaniu” brakuje, żeby traktować te wyniki naprawdę poważnie, ale mam nadzieję, że będzie dobrym punktem wyjściowym do dyskusji. Wielkie dzięki Wojtek Kutyla za pomoc przy artykule! ", "title": "Krótko o tym, jak sprawić, żeby konferencje i spotkania branżowe były lepsze.", "sentences": [{"fa60": "Krótko o tym, jak sprawić, żeby konferencje i spotkania branżowe były lepsze."}, {"e1d1": "W oparciu o krótkie badanie* oraz moje przemyślenia."}, {"d1e7": "Mam taką teorię, że wszystko co robimy jest tylko na tyle dobre na ile się w to zaangażujemy. Jeśli oglądamy serial, grając jednocześnie w grę na telefonie, to — nawet jeśli serial jest świetny — nie będziemy go tak przeżywać. Jeśli jesteśmy na spotkaniu ze znajomymi, ale cały czas sms-ujemy z dziewczyną, którą poznaliśmy poprzedniego wieczoru, to spotkanie to nie zapadnie nam w pamięci jako udane i wartościowe. Przeżycie pełnego doświadczenia wymaga pełnego zaangażowania."}, {"5c71": "To samo dotyczy konferencji i spotkań branżowych. Jeśli pójdziemy na konferencję po czym usiądziemy wygodnie w fotelu i będziemy jedynie słuchać prezentacji, to najpewniej nie wyjdziemy w pełni usatysfakcjonowani. Konferencja wymaga pełnej interakcji. Dla pełnego zadowolenia widownia powinna być tak samo zaangażowana jak prezentujący. Nie tylko słuchać, ale też mówić — zadawać pytania lub rozmawiać z innymi jej członkami. W innym przypadku po co na nią w ogóle iść, skoro moglibyśmy obejrzeć stream z domu?"}, {"a08b": "Dlatego też wpadłem na pomysł przeprowadzenia badania* na osobach z facebookowych grup Polish Designers i Usability PL w celu sprawdzenia jakości interakcji i zaangażowania podczas spotkań branżowych. Chciałem by cel tej krótkiej ankiety nie był oczywisty, więc jako skupiłem się na chęci prezentowania i zadawania pytań. Te dwa podstawowe sposoby zaangażowania się w spotkanie branżowe posłużą mi za wskaźniki czy i jak zaangażowani jesteśmy w tego typu wydarzenia."}, {"d456": "Artykuł ten będzie pewnie najciekawszy dla organizatorów wydarzeń i prezentujących, ale może też pokazać nowy punkt widzenia dla tych, którzy wolą być odbiorcami. Jeżeli wolisz patrzeć na konkretne dane zamiast czytać moją ich interpretację, pełne wyniki są dostępne dla wszystkich tutaj: https://docs.google.com/spreadsheets/d/1NGpI82jbQgPbXvJxuzxs_7QLz8qlUQZ1f-_hpFji-R4/edit?usp=sharing"}, {"b636": "Odpowiedzi na pierwsze pytania były zgodne z moimi założeniami: Ze 149 odpowiedzi 82% respondentów bywa na wydarzeniach branżowych a 18% nigdy na żadnym nie było. Co ciekawe, jedynie ćwierć z tych 18%, czyli mniej więcej 4.5% wszystkich wypełniających ankietę, uważa wydarzenia na stratę czasu. Ponad 95% z nas jest odbiorcami lub potencjalnymi odbiorcami tego typu wydarzeń!"}, {"8843": "Jaką jesteśmy widownią?"}, {"42aa": "Ku mojej ogromnej uldze 0% (słownie: zero) respondentów stwierdziło, że prezentacje są idealne i nie trzeba już o nic dopytywać. Wiemy dzięki temu, że zdecydowanie istnieje potrzeba nawiązaniu dialogu."}, {"21c3": "Ponad połowa (61%) osób uczęszczające na tego typu wydarzenia stwierdziła, że zadaje pytania, chociaż jedynie 6% wybrało odpowiedź “jasne” a aż 55% “czasami”. Ponadto istnieje też grupa niemal 40%, która nigdy nie zadaje pytań! Mnie osobiście ten wynik zaskoczył — skąd wynika nasza niechęć do podjęcia dialogu z prezentującymi? Na szczęście dokładnie o tym było następne pytanie…"}, {"4de5": "Ponad 60% osób twierdzi, że nic im od razu nie przychodzi do głowy, a połowa wstydzi się i boi się, że się wygłupi. To dość poważne powody, ale na szczęście jest parę pomysłów (w ostatniej części tego artykułu) jak je rozwiązać."}, {"9f48": "Jak prezentujemy?"}, {"71e8": "Kolejny wynik, którego się nie spodziewałem, to aż 88% respondentów zgłaszających chęć prezentowania — to zaskakująco duża liczba. Jeśli zauważymy, że jedynie 16% respondentów kiedyś już prezentowało, daje nam to wspaniały potencjał 71% respondentów, którzy nigdy jeszcze nie mieli okazji podzielić się swoją unikalną perspektywą, a być może będą chcieli w przyszłości. Zaledwie dwie osoby (niecałe 2%) prezentowały w przeszłości ale nie zamierzają tego powtórzyć."}, {"416f": "Jeśli już szukamy prelegentów, to warto wiedzieć, że praktycznie wszyscy (97%) chętni do prezentowania zwracają uwagę na dwa podstawowe czynniki: temat — muszą się czuć w nim pewnie — oraz (70%) czas na przygotowanie. Niezmiernie ucieszyłem się również z zaledwie dwóch odpowiedzi “żeby nie było pytań od publiczności”. Osoby prezentujące raczej nie będą blokadą dla podjęcia dialogu."}, {"2162": "Spośród osób, które nie wyrażają chęci prezentowania, dwa największe powody to zbyt duży stres (53%) oraz brak ciekawych rzeczy do opowiedzenia (aż 47%!). Muszę jednak przyznać, że przy zaledwie piętnastu odpowiedziach na to pytanie, istotność tych wyników pozostawia wiele do życzenia."}, {"22f3": "Dla mnie osobiście zawsze najciekawszą częścią każdej ankiety jest ostatnie pytanie otwarte, w którym liczyłem (i nie zawiodłem się!) na ciekawe przemyślenia. Raz jeszcze zachęcam do przejrzenia pełnych wyników, al część cytatów można przeczytać (w oryginalnej pisowni) poniżej w tym artykule."}, {"1859": "Problemy i rozwiązania?"}, {"6075": "Jeśli organizujesz konferencje lub prezentujesz, to może być część dla Ciebie. Wykluczyłem wszystkie uwagi typu “tematy są nieciekawe” czy “prezenter jest kiepski” bo — choć często mają w sobie wiele prawdy — obawiam się, że niewiele wnoszą do dyskusji nad rozwiązaniem tego problemu. Do każdego zagadnienia dołączam cytat bezpośrednio z pytań otwartych ankiety."}, {"23e2": "Problem wstydu i strachu przed konfrontacją"}, {"0ccd": "Choć zdaje się, że problem ten nie istnieje dla tych z nas, którzy są już gotowi prezentować (tylko dwie osoby na 106 stwierdziły, że nie chcą pytań od publiczności) to jednak okazuje się, że to dość powszechna bolączka wśród odbiorców. Aż 31 na 47 respondentów nie chcących zadawać pytań stwierdziło, że boją się, że się wygłupią i/lub wstydzą się wystąpień publicznych."}, {"cbcc": "może przygotować taką skrzyneczkę jak urna wyborcza do wrzucania pytań do prelegentów jeśli ktoś się wstydzi zapytać przy publiczności?"}, {"07b4": "RozwiązanieJest wiele dostępnych obecnie sposobów, które pomogą nam obejść ten problem. Na przykład zadawanie (anonimowych?) pytań przez stronę mobilną czy aplikację tak, żeby każdy miał szansę spokojnie sformułować swoje pytanie (na przykład sli.do: https://www.sli.do/)."}, {"2879": "Zastanowiłabym się także nad fajnymi pomysłami zadawania pytań, bo nie każdy ma odwagę zadać pytanie przed setką czy większą ilością ludzi. Lepsze są formy zadawania ich anonimowo i wybierania przez prowadzących najlepszych pytań. Pozwala to skrócić dyskusje na bezsensowne tematy (a czasem jest ich dużo) oraz dać każdemu równa szansę na zadanie pytania."}, {"73de": "Ciekawym wariantem tego rozwiązania jest zadawanie pytań w komentarzach na stronie wydarzenia na facebooku (piona Experience Night! https://www.facebook.com/experiencenight/), dzięki czemu prezenter ma szansę odpowiedzieć na wszystkie pytania (a widz je zadać) nawet w kilka dni po wydarzeniu, a także podjąć dyskusję na którą nie starczyło czasu podczas spotkania czy afterparty. Warto pamiętać, że nie jest to opcja anonimowa, więc niektórzy mogą bać się ośmieszenia przed szerszym gronem. Mimo wszystko jestem przekonany, że zalety tego rozwiązania są warte tego ryzyka i mogę je z własnego doświadczenia serdecznie polecić."}, {"1db4": "WTF networking?"}, {"f3ac": "Grupa dorosłych ludzi nie jest w stanie nawiązać ze sobą sensownej rozmowy? Niestety, znamy to aż za dobrze. Dość duża liczba komentarzy wspominających o tym temacie zdaje się potwierdzać powszechność tego problemu."}, {"9741": "Najsłabsza cześć polskich wydarzeń na których byłem to newtorking, który nie odbywa sie prawie wcale. Ludzie są jakby przestraszeni, trzymają się tylko we własnych grupkach. Zapytani o opinie na dowolny temat boja się mówić."}, {"744b": "RozwiązanieZ pewnością nie jest łatwo sprawić, żeby ludzie nagle stali się bardziej otwarci. Jak widać pozostawienie ludzi samych sobie z drinkiem w dłoni nie sprawdza się w stu procentach. Być może warto zatem spróbować różnych gier czy zadań, które znamy z zajęć budujących zespół. Ponadto istnieją także coraz bardziej innowacyjne rozwiązania, takie jak na przykład Idea mixer: https://www.polidea.com/blog/Our_Conference_Networking_Game_Idea_Mixer/Na pewno warto nieustannie próbować udoskonalić tę część spotkań, gdyż, jak widać, są osoby dla których to właśnie jest najważniejsza ich część:"}, {"ed75": "Zwykle na takich wydarzeniach ciekawiej jest przy piwku pogadać z innymi dyzajnerami i dowiedzieć się czegoś interesującego od nich niż na samych prelekcjach."}, {"619d": "Za mało czasu, zbyt szybkie tempo…"}, {"8fa1": "61% osób twierdzi, że żadne pytania im nie przychodzą do głowy od razu po wystąpieniu. Jednym ze sposobów może być zadawanie pytań po spotkaniu (patrz wyżej). Drugim, który może pozytywnie wpłynąć na poczucie interakcji i zaangażowania w trakcie konferencji, jest budowanie oczekiwania dialogu od samego początku…"}, {"c312": "Według mnie często brakuje moderowanych dyskusji na koniec, co pozwoliłoby lepiej zaangażować słuchaczy i bardziej zgłębić i zrozumieć temat. Problemem jest także dla mnie szybkie przechodzenie pomiędzy różnymi tematami, co nie pozwala przetrawić i przemyśleć poprzedniego tematu."}, {"4f7e": "RozwiązanieUstalenie ram czasowych tak, żeby były znane dla wszystkich — zarówno prezentujących jak i publiczności— pomoże zbudować pewne oczekiwania wobec obu stron. Na przykład: jeśli prezentacja trwa 20 minut, a na pytania jest bezwzględnie odłożone 10 minut (i oznaczone w planie wydarzenia oraz przed każdą prezentacją), jest większa szansa, że widownia zmobilizuje się do zadawania pytań wiedząc, że jest na nie wyznaczony czas."}, {"5c51": "Dodatkowo przygotowanie i zadanie pierwszego pytania (oby nie wymagającego długiej odpowiedzi!) przez organizatorów może być świetnym początkiem dyskusji oraz dać dodatkowy czas na zastanowienie dla widowni. Pozwoli też zburzyć psychologiczną barierę bycia pierwszym pytającym, co dodatkowo powinno ułatwić interakcję."}, {"0efd": "Pro tip: Jeśli prezentujesz i masz na widowni kogoś znajomego — przygotuj sobie jakieś pytanie (i odpowiedź) i poproś tę osobę, żeby je zadała ;)"}, {"9cba": "Słuchać to za mało…"}, {"0f99": "Siedzenie przez 45 minut i słuchanie prezentującego na pewno nie wpływa pobudzająco na poczucie otwartego dialogu. Jeśli prezentacja jest długa część osób nie będzie w stanie zapamiętać tego, co było na początku prezentacji i pod koniec nie będzie pewna czy pytanie ma w ogóle sens."}, {"4f8e": "Zazwyczaj na tego typu wydarzeniach, jest przedstawiana sama teoria, co często może nudzić słuchaczy, nawet kiedy jest mowa na temat, który nas interesuje, to po pewnym czasie, po prostu się wyłączamy. Dobrym rozwiązaniem może być zachęcenie użytkowników do interakcji, niektórzy mogą się stresować, ale można zrobić to anonimowo, a po zakończeniu zadania pokazywana jest prawidłowa odpowiedź"}, {"ebed": "RozwiązaniePrezentujący może wpleść w swoją prezentację interaktywne fragmenty, pytania do publiczności, podnoszenie rąk itp. Dzięki temu od samego początku widz będzie miał poczucie bardziej otwartego dialogu, a nie bycia jedynie biernym odbiorcą treści. Podobnie anonimowe głosowania przez strony mobilne mogą znacząco zwiększyć zaangażowanie publiczności."}, {"f46a": "Co dalej?"}, {"5561": "Jak widać, żadne z tych rozwiązań nie są jakoś szczególnie skomplikowane i trudne we wdrożeniu, a jestem przekonany, że zwiększenie zaangażowanie wszystkich osób obecnych na konferencji odbije się pozytywnie na jej odbiorze. W gruncie rzeczy jest to produkt taki jak wszystkie inne i powinniśmy ciągle ulepszać doświadczenie jego użytkowników."}, {"f54a": "A Ty jakie znasz sposoby na usprawnienie interakcji na tego typu wydarzeniach? Może jest jakieś rozwiązanie które powinno być wdrożone na absolutnie każdej konferencji? A może to coś zupełnie innego jest dla Ciebie największym problemem? Daj znać!"}, {"f4b4": "Do zobaczenia na następnym spotkaniu! Nie zapomnij mnie o coś zapytać;)"}, {"0ec4": "Post Scriptum"}, {"e3f2": "*Nie oszukujmy się, wiele temu “badaniu” brakuje, żeby traktować te wyniki naprawdę poważnie, ale mam nadzieję, że będzie dobrym punktem wyjściowym do dyskusji."}, {"feda": "Wielkie dzięki Wojtek Kutyla za pomoc przy artykule!"}], "child": "817_1\t817_2817_1\t817_2"}