{"name": "818", "parent": "", "content": "I Interrupt My Regularly Scheduled Post… Or I Have an Announcement that Could Probably Wait Dear People of Earth (i.e., the tiny section of humanity that's currently reading this), I like to think of myself as a good communicator so I wanted to let all four of you know what I’m planning (I hope I’m up to four readers by now. Really? It’s still only two. Damn. Hi, Mom and Dad). After much intense deliberation — during which time I attempted to numb painful dental work with Netflix, alcohol and pureed French fries* — I’ve come to a very difficult conclusion: You should always floss even when you’re really, really tired. Also, as of this week, I’m gonna start posting every OTHER Wednesday. At least for the next few weeks. So this post isn’t really a post-post, it’s just the best way I know how to tell everyone (Mom, Dad) not to be surprised that I didn’t actually post this week, but that I will be posting next week… and then not posting the following week, but posting the week after that week (See. I told you I was a good communicationer). Now, I assure you I have very valid reasons for changing my blogging schedule and it’s not because I’m lazy. If I was lazy, I wouldn’t even write this, derrr. I’m doing this because: (A) I’ve become super busy and, more than anything, I do not want the quality of my posts to suffer. Of course, I realize I’ve set a very low bar and “quality” is a subjective term, especially when I use it, but it could actually get worse. I know, right?! How is that even possible? Just friggin’ trust me (for instance, I could start using the word “friggin’”). And I’m afraid if I continue to write a new piece every week, there’s a significant chance I’ll just start posting pictures of my left knee with captions like “This is my knee” and “This is my knee from a slightly different angle.” Shit. Maybe I should pitch this idea to Medium under the category of “Personal Development.” While some people might consider that a “quality” post, those people probably also like modern art … and blogs about how getting up early leads to financial success *obscene hand gesture*. BUT most importantly: (B) I’m working on my very own… wait for it… ThunderPuff website! Unfortunately, it’s taking longer than I anticipated due to my inability to code. I really wish I could code. If I knew how to code and started getting up at 4am, I would probably be a self-actualized, time-management-life-work-balance-relationship-success-happiness-guru, millionaire by now. See you next week! *Recipe for Vodka Fries™ You basically have two options: Note: Do NOT use flavored vodka. Far More Important Note: Don’t do any of this. It’s gross. Stuck in an elevator with excellent wifi? Need something to pass the time? Here: 25 Pretty-Fucking-Obvious Signs That He’s Not “the One.”Or She.psiloveyou.xyz Career Tips for Anti-SocialsAnd People Who Hate Bullshit42hire.com ", "title": "I Interrupt My Regularly Scheduled Post…", "sentences": [{"3aa9": "I Interrupt My Regularly Scheduled Post…"}, {"4a13": "Or I Have an Announcement that Could Probably Wait"}, {"a764": "Dear People of Earth (i.e., the tiny section of humanity that's currently reading this),"}, {"29b9": "I like to think of myself as a good communicator so I wanted to let all four of you know what I’m planning (I hope I’m up to four readers by now. Really? It’s still only two. Damn. Hi, Mom and Dad)."}, {"4421": "After much intense deliberation — during which time I attempted to numb painful dental work with Netflix, alcohol and pureed French fries* — I’ve come to a very difficult conclusion:"}, {"2c3e": "You should always floss even when you’re really, really tired."}, {"8fb6": "Also, as of this week, I’m gonna start posting every OTHER Wednesday. At least for the next few weeks."}, {"eac5": "So this post isn’t really a post-post, it’s just the best way I know how to tell everyone (Mom, Dad) not to be surprised that I didn’t actually post this week, but that I will be posting next week… and then not posting the following week, but posting the week after that week (See. I told you I was a good communicationer)."}, {"3551": "Now, I assure you I have very valid reasons for changing my blogging schedule and it’s not because I’m lazy. If I was lazy, I wouldn’t even write this, derrr."}, {"ace6": "I’m doing this because:"}, {"c215": "(A) I’ve become super busy and, more than anything, I do not want the quality of my posts to suffer. Of course, I realize I’ve set a very low bar and “quality” is a subjective term, especially when I use it, but it could actually get worse. I know, right?! How is that even possible? Just friggin’ trust me (for instance, I could start using the word “friggin’”)."}, {"eda2": "And I’m afraid if I continue to write a new piece every week, there’s a significant chance I’ll just start posting pictures of my left knee with captions like “This is my knee” and “This is my knee from a slightly different angle.”"}, {"f848": "Shit. Maybe I should pitch this idea to Medium under the category of “Personal Development.”"}, {"5b6b": "While some people might consider that a “quality” post, those people probably also like modern art … and blogs about how getting up early leads to financial success *obscene hand gesture*."}, {"2079": "BUT most importantly:"}, {"c8b6": "(B) I’m working on my very own… wait for it… ThunderPuff website! Unfortunately, it’s taking longer than I anticipated due to my inability to code."}, {"79bd": "I really wish I could code. If I knew how to code and started getting up at 4am, I would probably be a self-actualized, time-management-life-work-balance-relationship-success-happiness-guru, millionaire by now."}, {"3fc0": "See you next week!"}, {"117d": "*Recipe for Vodka Fries™"}, {"9c2e": "You basically have two options:"}, {"6d6a": "Note: Do NOT use flavored vodka."}, {"d85f": "Far More Important Note: Don’t do any of this. It’s gross."}, {"d11a": "Stuck in an elevator with excellent wifi? Need something to pass the time? Here:"}, {"4982": "25 Pretty-Fucking-Obvious Signs That He’s Not “the One.”Or She.psiloveyou.xyz"}, {"151d": "Career Tips for Anti-SocialsAnd People Who Hate Bullshit42hire.com"}], "child": "818_1\t818_2\t818_3\t818_4\t818_5\t818_6\t818_7\t818_8\t818_9\t818_10\t818_11\t818_12\t818_13\t818_14\t818_15\t818_16\t818_17\t818_18\t818_19\t818_20\t818_21\t818_22\t818_23\t818_24\t818_25818_1\t818_2\t818_3\t818_4\t818_5\t818_6\t818_7\t818_8\t818_9\t818_10\t818_11\t818_12\t818_13\t818_14\t818_15\t818_16\t818_17\t818_18\t818_19\t818_20\t818_21\t818_22\t818_23\t818_24\t818_25818_1\t818_2\t818_3\t818_4\t818_5\t818_6\t818_7\t818_8\t818_9\t818_10\t818_11\t818_12\t818_13\t818_14\t818_15\t818_16\t818_17\t818_18\t818_19\t818_20\t818_21\t818_22\t818_23\t818_24\t818_25"}