{"sentences": [{"1746": "Please Let Me Leave This Godforsaken Hellhole"}, {"7705": "I’ll Write Whatever Think Piece You Want"}, {"175e": "To whom it may concern,"}, {"04fc": "I have decided to move. Please do not recommend a realtor. Please do not put out a Facebook post asking if anyone needs a roommate. Please do not try to sell me on your neighborhood."}, {"488c": "I have decided to move out of New York City. If you’re not rich in this city, you can’t live the life I want to live. Many people disagree with that statement. Many people think the life I want to live isn’t the life I should want to live. Many people think I should want to live in New York City."}, {"9fcb": "All of that’s fine. I don’t care. No one else on Earth has to want to live the way I want to live. I don’t care if you think I’m expecting the wrong thing out of New York City — in fact, I agree with you. It’s why I want to leave this post-apocalyptic nightmare circus of a city. It’s come to be something different than it was when I moved here."}, {"bb83": "So I’m moving."}, {"08fc": "However, as a creative class millennial in 2017, I understand that I am required to write an introspective, thought-provoking “Leaving New York” essay of at least 1000 words before I am allowed to leave. I am expected to explain how much thought I have put into this decision and how I have long agonized over it. That I have gnashed my teeth, rent my garments, and a writhed about in the ashen heap in the process of making the choice to leave a city where it can take three hours to drive 2.8 miles."}, {"b663": "Or, on the other hand, I may instead elect to compare my relationship with New York to that of a lover, and that I’ve always known I’d eventually leave. That I knew, even during my first hopeful, bright-eyed week of emailing open mic hosts for spots in 2009, that one day my card would get punched and I’d go my own way. That this was a long, thought-out break up, tragic yet beautiful in its inevitability. That though I’ll always love this city, I need to put my own needs first and move on to a place that will treat me better. For ours was a perfect love — in fact, too perfect to persist."}, {"94ae": "Honestly, I’ll write whichever piece you want. I don’t care. I just want to live somewhere that isn’t a constant, 24-hour assault on my senses."}, {"c491": "Do you know where I’m going to move to? New Jersey. I’m choosing New Jersey over New York. I know! You think I’m insane. But allow me to reiterate that I do not care if you think I’m insane. If you think I’m insane, then you either live somewhere where a comfortably middle class family can afford to live a single bedroom apartment in the downtown area, are rich, or are very likely insane yourself."}, {"4cde": "I’m moving to New Jersey because 95% of my friends are there, the cost of living is drastically less expensive, and there’s a beach (in fact, there’s lots of them). Before you say that I have friends in New York (I do, dear ones), that there are affordable places to live in New York (there are), and there are beaches in New York (sure, ok), allow me to clarify that those are the reasons why I am moving to New Jersey, but they are not the reasons I am leaving New York."}, {"b514": "I am leaving New York because this city is full of rats and garbage and every terrorist organization in the world wants to blow it up."}, {"2680": "Let me ask you a question: why do you want to stay here? Have you not yet been spit on by one of the many screaming women on the trains? Are you aware there is a public transit system that goes into New Jersey that may take less time than your current commute, utilizes post-2000 technology, and is clean?"}, {"8cc6": "Have you not yet walked back to your apartment after a delicious dinner with your parents in a cute neighborhood spot, having convinced yourself for a fleeting, precious moment that you have assembled a tenable, realistic living situation that an adult at the start of what looks to be a reasonably successful career can be proud of, only to have that delusion shattered by a man openly urinating in front of your apartment building while multiple people walk by and say nothing?"}, {"27e9": "Not a homeless man, mind you. A grown man in clean clothes standing outside of his white Durango very plainly and obviously urinating into the street directly in front of your apartment building. Has that not happened to you yet?"}, {"9349": "I’m sure you’re laughing. I’m laughing, too. It’s an objectively hilarious situation! It’s also an excellent reason to move out of a city-sized urinal."}, {"ab1f": "Yes, I understand that is part of the fabric of this amazing city, and yes, it is amazing. Yes, with a city this enormous and diverse and vibrant and powerful and important, I understand that you’re bound to encounter a few crazies, odd eggs, or nuts. I get that. I fully understand."}, {"2446": "In fact, I think I understand it better than you do, as I’m the one who’s leaving and you’re the one who’s trying to get me to stay."}, {"e7ab": "Anyway, I should be close to 1000 words by now, and I honestly don’t care if you want me to stay. I’m already gone, actually. I’m just submitting my Leaving New York Essay late because everything takes five times longer than it should in a city that was built for a population five times smaller than the amount of people that actually live there."}, {"9ea0": "This is my Leaving New York Essay. I am leaving New York for New Jersey."}, {"6d2a": "Can I go now?"}], "content": "Please Let Me Leave This Godforsaken Hellhole I’ll Write Whatever Think Piece You Want To whom it may concern, I have decided to move. Please do not recommend a realtor. Please do not put out a Facebook post asking if anyone needs a roommate. Please do not try to sell me on your neighborhood. I have decided to move out of New York City. If you’re not rich in this city, you can’t live the life I want to live. Many people disagree with that statement. Many people think the life I want to live isn’t the life I should want to live. Many people think I should want to live in New York City. All of that’s fine. I don’t care. No one else on Earth has to want to live the way I want to live. I don’t care if you think I’m expecting the wrong thing out of New York City — in fact, I agree with you. It’s why I want to leave this post-apocalyptic nightmare circus of a city. It’s come to be something different than it was when I moved here. So I’m moving. However, as a creative class millennial in 2017, I understand that I am required to write an introspective, thought-provoking “Leaving New York” essay of at least 1000 words before I am allowed to leave. I am expected to explain how much thought I have put into this decision and how I have long agonized over it. That I have gnashed my teeth, rent my garments, and a writhed about in the ashen heap in the process of making the choice to leave a city where it can take three hours to drive 2.8 miles. Or, on the other hand, I may instead elect to compare my relationship with New York to that of a lover, and that I’ve always known I’d eventually leave. That I knew, even during my first hopeful, bright-eyed week of emailing open mic hosts for spots in 2009, that one day my card would get punched and I’d go my own way. That this was a long, thought-out break up, tragic yet beautiful in its inevitability. That though I’ll always love this city, I need to put my own needs first and move on to a place that will treat me better. For ours was a perfect love — in fact, too perfect to persist. Honestly, I’ll write whichever piece you want. I don’t care. I just want to live somewhere that isn’t a constant, 24-hour assault on my senses. Do you know where I’m going to move to? New Jersey. I’m choosing New Jersey over New York. I know! You think I’m insane. But allow me to reiterate that I do not care if you think I’m insane. If you think I’m insane, then you either live somewhere where a comfortably middle class family can afford to live a single bedroom apartment in the downtown area, are rich, or are very likely insane yourself. I’m moving to New Jersey because 95% of my friends are there, the cost of living is drastically less expensive, and there’s a beach (in fact, there’s lots of them). Before you say that I have friends in New York (I do, dear ones), that there are affordable places to live in New York (there are), and there are beaches in New York (sure, ok), allow me to clarify that those are the reasons why I am moving to New Jersey, but they are not the reasons I am leaving New York. I am leaving New York because this city is full of rats and garbage and every terrorist organization in the world wants to blow it up. Let me ask you a question: why do you want to stay here? Have you not yet been spit on by one of the many screaming women on the trains? Are you aware there is a public transit system that goes into New Jersey that may take less time than your current commute, utilizes post-2000 technology, and is clean? Have you not yet walked back to your apartment after a delicious dinner with your parents in a cute neighborhood spot, having convinced yourself for a fleeting, precious moment that you have assembled a tenable, realistic living situation that an adult at the start of what looks to be a reasonably successful career can be proud of, only to have that delusion shattered by a man openly urinating in front of your apartment building while multiple people walk by and say nothing? Not a homeless man, mind you. A grown man in clean clothes standing outside of his white Durango very plainly and obviously urinating into the street directly in front of your apartment building. Has that not happened to you yet? I’m sure you’re laughing. I’m laughing, too. It’s an objectively hilarious situation! It’s also an excellent reason to move out of a city-sized urinal. Yes, I understand that is part of the fabric of this amazing city, and yes, it is amazing. Yes, with a city this enormous and diverse and vibrant and powerful and important, I understand that you’re bound to encounter a few crazies, odd eggs, or nuts. I get that. I fully understand. In fact, I think I understand it better than you do, as I’m the one who’s leaving and you’re the one who’s trying to get me to stay. Anyway, I should be close to 1000 words by now, and I honestly don’t care if you want me to stay. I’m already gone, actually. I’m just submitting my Leaving New York Essay late because everything takes five times longer than it should in a city that was built for a population five times smaller than the amount of people that actually live there. This is my Leaving New York Essay. I am leaving New York for New Jersey. Can I go now? ", "parent": "", "title": "Please Let Me Leave This Godforsaken Hellhole", "child": "82_1\t82_2\t82_3\t82_4", "name": "82"}