{"name": "823", "parent": "", "content": "Reading Is For Geeks? Wrong, It’s for Achievers. 7 Reasons why Mark Zuckerberg, Oprah, Bill Gates, Elon Musk, and co. spend hours every day reading… If I could go back in time and give one piece of advice to my younger self, it would be this: Read.A.Lot. Reserve 2–3 hours of your day just for reading. Read (auto-)biographies of great men. Read books. Read magazines. Read scientific papers. Read online articles. Read on your smartphone. Read whenever you’ve got some spare time on your hands and don’t know what to do with it. I currently work part-time in a construction working site. I start work at 7:30am in the morning. I leave the house at 6:45am. When do I get up? Not after 5am. Why? So that I can spend some of my sharpest hours in the day reading — that’s how important it is to me. Most days I guess I read for about 3 hours. Some days it’s 5 hours. Some days it’s 10 minutes. But it rarely happens that a day passes by and I didn’t read at least a couple of paragraphs. You can tell: I am 100% sold on the benefits of reading. Now let me convince YOU. Here are 7 reasons why reading is one of the best things you could ever do. Let’s get to it… (BY THE WAY: When I talk about reading I don’t talk about the geeky “it’s such a fun activity” type of reading. There’s a shitload of activities that are a LOT more fun. I’m talking about reading to gain knowledge and get access to ideas and insights of great men and women… I talk about reading as a personal growth tool, not a means to get pleasure or have fun.) #1 Mark Zuckerberg, Warren Buffett, Bill Gates, Mark Cuban, Charlie Munger, Oprah, Elon Musk, and Co. ALL Read A Lot These 3 billionaires? All voracious readers… The more I read and learn, the more I realize how little I know about myself and the world… …yet, there’s one thing I’m getting more and more convinced of: Truly great and “successful” (whatever the fuck that means) people are voracious readers. Just check out some of these examples… Take Warren Buffet as an example — multi-billionaire and currently the 3rd richest person in the world. When asked to describe his day, he said, “I just sit in my office and read all day.” He estimates that he spends 80 percent of his working day reading and thinking. Also, when asked about the key to success, Buffett pointed to a stack of nearby books and said, “Read 500 pages like this every day. That’s how knowledge works. It builds up, like compound interest. All of you can do it, but I guarantee not many of you will do it.” His infamous business partner, Charlie Munger, is famous for saying, “Go to bed smarter than you woke up.” About his partnership with Warren Buffet, he comments, “You could hardly find a partnership in which two people settle on reading more hours of the day than in ours.” Damn, these guys are committed to reading… Next up, Oprah Winfrey — self-made multi-billionaire, currently the world’s 21th most powerful woman, and the only person in the world to have appeared in Time’s list of the most influential people 10 times. She supposedly started reading as a toddler and never stopped. She once mentioned, “Books were my pass to personal freedom. I learned to read at age three, and soon discovered there was a whole world to conquer that went beyond our farm in Mississippi.” You may also have heard about her book club where she selects one of her favorite books every month. Speaking of book clubs, Bill Gates does a similar thing and shares his reading list online. He reads more than 50 books a year and credits his success at least partly to books: “I really had a lot of dreams when I was a kid, and I think a great deal of that grew out of the fact that I had a chance to read a lot.” Mark Cuban, another self-made billionaire, writes on his blog that he reads 3+ hours a day, “Most people won’t put in the time to get a knowledge advantage. Sure, there were folks that worked hard at picking up every bit of information that they could, but we were few and far between. To this day, I feel like if I put in enough time consuming all the information available, particularly with the net making it so readily available, I can get an advantage in any technology business. Of course my wife hates that I read more than 3 hours almost every day, but it gives me a level of comfort and confidence in my businesses. AT MicroSolutions it gave me a huge advantage. A guy with little computer background could compete with far more experienced guys just because I put in the time to learn all I could.” Elon Musk, when asked how he learned to build rockets, answers “I read books.” Last but not least, Mark Zuckerberg. He resolved to read a book every two weeks in 2015, and even started a book club called “A Year of Books” in order to discuss those books with the Facebook community. These guys are committed to learning — and reading is a key part of their learning machinery. Bottom line: Many of the most accomplished people in the world use reading as a key practice to stay on top of their game and get what Mark Cuban calls “the knowledge advantage”. #2 Reading Gives You Tools to Solve Your Problems Modern life is full of “problems”. Maybe you have trouble falling asleep at night. Or you are going through a depression. Or your marriage sucks. Or you’re suffering from low self-esteem. Or you’re going through a tough break-up. Or maybe you’re overweight. Or you’re underweight. Wouldn’t life be better if you got rid of some of your problems? FACT: You would be a lot better off if you could get rid of some of your problems. You would also be able to achieve more in life. The PROBLEM is: You don’t know how to solve most of your problems. Why? Because you lack the right tools, the right knowledge and know-how. And this is where books come in — they give you the necessary tools and knowledge to solve almost any problem. Let me give you an example from my own life: How reading helped me cure my insomnia for good: I’ve been suffering from insomnia until about a year ago. I wasn’t a chronic insomniac, but there were a lot of nights of just lying in bed for hours and hours and not being able to fall asleep — my overactive mind wouldn’t let me. Then I started reading lots of articles about curing insomnia and sleep optimization in general. I learned everything I could about the causes of insomnia and how to fall asleep faster. I started using the tricks, started seeing some results, and just kept on tweaking and tweaking. Today, I can fall asleep on demand, every night, within 5–10 minutes. Reading gave me the tools to solve this problem. And it’s been well worth it. My health is better. I’m feeling less stressed. I can easily get adequate amounts of sleep. I can get up early when I want to. I save a lot of time and energy. Frankly, getting rid of this problem was a big upgrade for me. (Note: You find a lot of the tools Jonas and I use to fall asleep faster on this very blog. You can get access to these tools through… *drumroll* reading.) The point is, (almost) every problem you’re currently struggling with can be solved by reading the right book(s). The more you read, the more tools you’ll have in your tool belt. The more tools you have, the more problems can be solved and the stronger you’ll become as a person. Bottom line: Reading helps you solve problems. For any problem you currently have in life there are at least 100+ books showing you ways to solve it. #3 Reading Gives You the Tools to Reach Your Goals Same story. Just like there are tools to solve your problems, there are also tools that will help you reach your goals, dreams, and ambitions for the future. There are more than enough books teaching you exactly how to achieve all those things and more. Bottom line: Books give you all the tools, knowledge, and know-how you need to achieve your goals and aspiration for the future. #4 Reading Powerfully Changes Your Mindsets and Beliefs Every heard of a mindset intervention? Here’s Kelly McGonigal’s explanation from The Upside of Stress: “Mindsets are beliefs that shape your reality, including objective physical reactions (like the strength of my arm as Crum pushed on it), and even long-term health, happiness, and success. More important, the new field of mindset science shows that a single brief intervention, designed to change how you think about something, can improve your health, happiness, and success, even years into the future. The field is full or remarkable findings that will make you think twice about your own beliefs. From placebos to self-fulfilling prophecies, perception matters.” The goal of a mindset intervention is to change your mindset about something — in other words, how you think or feel about something. This then can lead to remarkable changes in a person’s health, happiness, and success. Here’s an interesting study highlighting the powerful effects such a mindset intervention can have: ​In a study testing whether the relationship between exercise and health is moderated by one’s mind-set, 84 female room attendants working in seven different hotels were measured on physiological health variables affected by exercise. Those in the informed condition were told that the work they do (cleaning hotel rooms) is good exercise and satisfies the Surgeon General’s recommendations for an active lifestyle. Examples of how their work was exercise were provided. Subjects in the control group were not given this information. Although actual behavior did not change, 4 weeks after the intervention, the informed group perceived themselves to be getting significantly more exercise than before. As a result, compared with the control group, they showed a decrease in weight, blood pressure, body fat, waist-to-hip ratio, and body mass index. That’s how powerful our mindsets and beliefs are. Remember, these housekeepers didn’t consciously change a thing. All that really changed was their mindset… and just look what a crazy effect it had on their lives. Now think about it in your own life. What beliefs and mindsets might you be having that are potentially holding you back? Maybe you believe that life is tough, that women don’t like skinny guys (or fat guys), that achieving anything in this life without a college degree is impossible. Maybe you believe that losing weight is hard, or that building muscle mass is impossible, or that eating healthy is expensive, or … These are all mindsets and beliefs that society has conditioned and programmed into your (subconscious) mind. These programs — that you did not choose yourself — are now running your life without you even knowing it. Here’s where books come into play: Reading books gives you more programs to choose from. They give you alternative views. They give you other perspectives. They show you that your narrow view of the world may not be the end-all-be-all. Books are nothing more than mindset interventions. And best of all, one book may contain 5, 10, 20, or even more mindset interventions. They can completely change your life by changing your beliefs, your mindsets, your entire worldview and how you see the world. Are you starting to understand how reading can be a true game-changer? How reading turns you into a fuller and more powerful human being? How reading can completely turn your life around? How it can literally create a new, better reality for you? Let me give you two specific beliefs I got from some of the books I’ve read… Stress is good for you. Stress is bad for us, that’s what society tells us. Whenever I felt stressed out in the past, I made a big deal out of it. I thought it was super unhealthy and I told myself that I shouldn’t ever feel stressed. That all changed when I read The Upside of Stress by Kelly McGonigal. Guess what? Stress is actually good for you! It helps you perform better and makes you more resilient in the future. It’s only bad for you if you think it’s bad. Duh! Nowadays I see stress as a positive sign. As a learning opportunity. As a way to grow and become a stronger version of myself. Anyone can get rich. I grew up in a family and culture where being rich was a bit frowned upon. I also didn’t know any rich people. Instead, I clearly remember my mother often telling us that we’re short on cash and we should be cautious when spending money. Getting rich seemed almost kind of magical and mythical — certainly it wasn’t possible for ordinary people. That changed when I read a summary of T. Harv Eker’s Secrets of the Millionaire Mind. According to him, it’s possible for anyone to become a millionaire. It’s simply a matter of having the right mindset (!). And even though I’m not rich yet, I’m 100% convinced I can be a millionaire one day… if I want to… and if I put in enough time and effort. Oftentimes we’re not at all aware of the programs and beliefs that are running the show in our lives. And if you don’t read or learn or in any other way expose yourself to new ideas, new mindsets, new beliefs… Then guess what? Your programs will never change… and neither will your life. Bottom line: Reading opens you up to a whole new world. It shows you new possibilities, new ways of looking at things, new ways of living. Reading gives you the freedom to choose your own way. It shows you a way out of society’s limited conditionings, programs, and worldviews. #5 Reading Inspires You to Do Great Things Reading about other people and what they have achieved in life and how they made the world a better place is as motivating and inspiring as it gets. Read (auto-)biographies of great people. Read Mandela’s story. Or Gandhi’s story. Or Abraham Lincoln’s story. Or Tiger Woods’ story. Or Kobe Bryant’s story. Or Elon Musk’s story. What these people achieved is truly extraordinary. And by reading about them you will come to realize that they weren’t born special. They got to where they got because of hard work, dedication, will, perseverance, persistence, and a relentless drive to overcome any obstacle life has thrown in their way. And look, you don’t necessarly need to read biographies. Good books are packed with great stories of great people. I recently read Tim Grover’s book “Relentless” (summary here). He was the personal coach of Kobe Bryant, Dwayne Wade, and other legendary basketball champs. In the book, he talks about the day Kobe was drafted. While pretty much all the others went out to celebrate, guess what Kobe did? He went to the fucking gym to practice. A while back I read Laura Vanderkam’s book What Successful People Do Before Breakfast. Most of these people get up super early. They work out in the morning. They meditate. They journal. They start working on their hardest tasks. They get more done before breakfast than most people during an entire day. It’s pure inspiration. My point is, reading motivates and inspires you to do great things with your life. Bottom line: Reading about other people owning and dominating their lives makes you want to get up from your couch and do shit. It makes you want to make something happen. It makes you want to do more than just watch TV all day long. It’s pure inspiration. #6 Reading Automatically Improves You at [Insert Topic of the Book] Recently I came across this quote from Marcy Shimoff’s book Happy for No Reason: “In 1977 Dr. Michael Fordyce, a psychologist and author of `The Psychology of Happiness, published the groundbreaking results of his experiment showing that students asked to study the habits of happy people actually increased their happiness and life satisfaction by just learning about the subject.” Just learning about happiness makes you happier. And I’ve found this to be true for any topic. I know this sounds too easy, but try it out for yourself. What’s one thing you want to get better at in your life? Read a book about it. Want to be a better communicator? Read a book about it. Want to build more muscle mass? Read a book about it. Want to lose weight? Read a book about it. Want to become rich? Read a book about it. Want to travel the world? Read a book about it. Want to improve your golf score? Read a book about it. Bottom line: The act of reading and learning about a specific topic automatically makes you better at it. Want more happiness? Read a book on how to become happier. Simple as that. #7 Reading Upgrades Your Environment by Giving You Virtual Friends and Mentors Ever heard of the following expression: “You are the average of the five people you spend the most time with.” — Jim Rohn Jim Rohn goes on to explain, “You will become the combined average of the five people you hang around the most. You will have the combined attitude, health and income of the five people you hang around the most.” We absorb other people`s personalities, habits, styles, thought patterns, mindsets, and attitudes like a sponge. There’s the saying that criminals are made, not born. Think about it. Nobody is born a criminal. It’s a characteristic (like any other) that is developed gradually over time. It’s circumstances like unemployment, child abuse, a “bad” neighborhood that slowly turn a person into a criminal. It’s scientifically proven that children who have been abused are more likely to grow up to be criminals. They grew up with a lot of hate which is naturally absorbed into their personalities. That same child growing up with loving parents and in a “good” neighborhood might become a completely different person. It’s all in the environment. It’s all about the people your surround yourself with. Ever wondered why Silicon Valley brings out so many millionaires? It`s because the people there are surrounded by so many other successful people. Kids grow up in a society where entrepreneurship, high achievement, success, and getting rich is normal. It`s really simple: If you want to be rich, hang around rich people. If you want to be funny, hang around funny people. If you want to be a great athlete, hang around other great athletes. If you want to be a total loser, hang around other losers. Now here’s the kicker: It’s not just about who you hang around with physically. If you read someone’s book, it’s almost as if you’re hanging out with that person. It’s almost as if the author is talking to you. And so you absorb his or her personality, mindsets, beliefs, and thought patterns. If you read Mandela’s biography, it’s almost as if you’re hanging out with him. If you read Steve Jobs’ biography, it’s almost as if you’re hanging out with him. Just think for a second how powerful that is. The authors of the books you read in a way become your friends and mentors. And so you start absorbing these great people’s mindsets, beliefs, attitudes, thought patterns, and more. Are you starting to see the magic powers behind the simple act of reading? Bottom line: Reading someone’s book helps you absorb that person’s beliefs, mindsets, attitudes, and thought patterns. It’s almost as if you’re actually hanging out with that person — it’s like having a virtual mentor. Let’s Wrap This Up Here are 7 reasons why you may want to up your reading game: My goal with this article is to get you to read more. Let me know if it worked in the comments below. And thanks for reading. Want more? Want additional strategies to live better and become more productive? Then download some of my top productivity hacks by clicking the link below: My Top 7 Productivity Hacks to Get More Done (free PDF) Originally published at www.njlifehacks.com. ", "title": "Reading Is For Geeks? Wrong, It’s for Achievers.", "sentences": [{"52d6": "Reading Is For Geeks? Wrong, It’s for Achievers."}, {"34bf": "7 Reasons why Mark Zuckerberg, Oprah, Bill Gates, Elon Musk, and co. spend hours every day reading…"}, {"c458": "If I could go back in time and give one piece of advice to my younger self, it would be this:"}, {"c48a": "Read.A.Lot."}, {"c45e": "Reserve 2–3 hours of your day just for reading. Read (auto-)biographies of great men. Read books. Read magazines. Read scientific papers. Read online articles. Read on your smartphone. Read whenever you’ve got some spare time on your hands and don’t know what to do with it."}, {"c715": "I currently work part-time in a construction working site. I start work at 7:30am in the morning. I leave the house at 6:45am. When do I get up? Not after 5am. Why? So that I can spend some of my sharpest hours in the day reading — that’s how important it is to me."}, {"5aae": "Most days I guess I read for about 3 hours. Some days it’s 5 hours. Some days it’s 10 minutes. But it rarely happens that a day passes by and I didn’t read at least a couple of paragraphs."}, {"bd27": "You can tell: I am 100% sold on the benefits of reading. Now let me convince YOU. Here are 7 reasons why reading is one of the best things you could ever do. Let’s get to it…"}, {"a7bc": "(BY THE WAY: When I talk about reading I don’t talk about the geeky “it’s such a fun activity” type of reading. There’s a shitload of activities that are a LOT more fun. I’m talking about reading to gain knowledge and get access to ideas and insights of great men and women… I talk about reading as a personal growth tool, not a means to get pleasure or have fun.)"}, {"ed1a": "#1 Mark Zuckerberg, Warren Buffett, Bill Gates, Mark Cuban, Charlie Munger, Oprah, Elon Musk, and Co. ALL Read A Lot"}, {"9cc3": "These 3 billionaires? All voracious readers…"}, {"74ee": "The more I read and learn, the more I realize how little I know about myself and the world…"}, {"7003": "…yet, there’s one thing I’m getting more and more convinced of: Truly great and “successful” (whatever the fuck that means) people are voracious readers."}, {"2938": "Just check out some of these examples…"}, {"97fd": "Take Warren Buffet as an example — multi-billionaire and currently the 3rd richest person in the world. When asked to describe his day, he said, “I just sit in my office and read all day.” He estimates that he spends 80 percent of his working day reading and thinking."}, {"53e8": "Also, when asked about the key to success, Buffett pointed to a stack of nearby books and said, “Read 500 pages like this every day. That’s how knowledge works. It builds up, like compound interest. All of you can do it, but I guarantee not many of you will do it.”"}, {"8b8f": "His infamous business partner, Charlie Munger, is famous for saying, “Go to bed smarter than you woke up.” About his partnership with Warren Buffet, he comments, “You could hardly find a partnership in which two people settle on reading more hours of the day than in ours.”"}, {"175d": "Damn, these guys are committed to reading…"}, {"4881": "Next up, Oprah Winfrey — self-made multi-billionaire, currently the world’s 21th most powerful woman, and the only person in the world to have appeared in Time’s list of the most influential people 10 times. She supposedly started reading as a toddler and never stopped. She once mentioned, “Books were my pass to personal freedom. I learned to read at age three, and soon discovered there was a whole world to conquer that went beyond our farm in Mississippi.”"}, {"9437": "You may also have heard about her book club where she selects one of her favorite books every month."}, {"d654": "Speaking of book clubs, Bill Gates does a similar thing and shares his reading list online. He reads more than 50 books a year and credits his success at least partly to books: “I really had a lot of dreams when I was a kid, and I think a great deal of that grew out of the fact that I had a chance to read a lot.”"}, {"88e1": "Mark Cuban, another self-made billionaire, writes on his blog that he reads 3+ hours a day, “Most people won’t put in the time to get a knowledge advantage. Sure, there were folks that worked hard at picking up every bit of information that they could, but we were few and far between. To this day, I feel like if I put in enough time consuming all the information available, particularly with the net making it so readily available, I can get an advantage in any technology business. Of course my wife hates that I read more than 3 hours almost every day, but it gives me a level of comfort and confidence in my businesses. AT MicroSolutions it gave me a huge advantage. A guy with little computer background could compete with far more experienced guys just because I put in the time to learn all I could.”"}, {"e74a": "Elon Musk, when asked how he learned to build rockets, answers “I read books.”"}, {"d0c9": "Last but not least, Mark Zuckerberg. He resolved to read a book every two weeks in 2015, and even started a book club called “A Year of Books” in order to discuss those books with the Facebook community."}, {"fd57": "These guys are committed to learning — and reading is a key part of their learning machinery."}, {"098b": "Bottom line: Many of the most accomplished people in the world use reading as a key practice to stay on top of their game and get what Mark Cuban calls “the knowledge advantage”."}, {"9055": "#2 Reading Gives You Tools to Solve Your Problems"}, {"82d0": "Modern life is full of “problems”."}, {"8887": "Maybe you have trouble falling asleep at night. Or you are going through a depression. Or your marriage sucks. Or you’re suffering from low self-esteem. Or you’re going through a tough break-up. Or maybe you’re overweight. Or you’re underweight."}, {"4308": "Wouldn’t life be better if you got rid of some of your problems?"}, {"6130": "FACT: You would be a lot better off if you could get rid of some of your problems. You would also be able to achieve more in life."}, {"dca2": "The PROBLEM is: You don’t know how to solve most of your problems. Why? Because you lack the right tools, the right knowledge and know-how. And this is where books come in — they give you the necessary tools and knowledge to solve almost any problem."}, {"8d5d": "Let me give you an example from my own life:"}, {"eddd": "How reading helped me cure my insomnia for good: I’ve been suffering from insomnia until about a year ago. I wasn’t a chronic insomniac, but there were a lot of nights of just lying in bed for hours and hours and not being able to fall asleep — my overactive mind wouldn’t let me."}, {"bc3e": "Then I started reading lots of articles about curing insomnia and sleep optimization in general. I learned everything I could about the causes of insomnia and how to fall asleep faster. I started using the tricks, started seeing some results, and just kept on tweaking and tweaking. Today, I can fall asleep on demand, every night, within 5–10 minutes."}, {"742d": "Reading gave me the tools to solve this problem. And it’s been well worth it. My health is better. I’m feeling less stressed. I can easily get adequate amounts of sleep. I can get up early when I want to. I save a lot of time and energy. Frankly, getting rid of this problem was a big upgrade for me."}, {"3ce7": "(Note: You find a lot of the tools Jonas and I use to fall asleep faster on this very blog. You can get access to these tools through… *drumroll* reading.)"}, {"812d": "The point is, (almost) every problem you’re currently struggling with can be solved by reading the right book(s)."}, {"23cd": "The more you read, the more tools you’ll have in your tool belt. The more tools you have, the more problems can be solved and the stronger you’ll become as a person."}, {"576c": "Bottom line: Reading helps you solve problems. For any problem you currently have in life there are at least 100+ books showing you ways to solve it."}, {"9249": "#3 Reading Gives You the Tools to Reach Your Goals"}, {"4b58": "Same story."}, {"5b44": "Just like there are tools to solve your problems, there are also tools that will help you reach your goals, dreams, and ambitions for the future."}, {"5cf0": "There are more than enough books teaching you exactly how to achieve all those things and more."}, {"992a": "Bottom line: Books give you all the tools, knowledge, and know-how you need to achieve your goals and aspiration for the future."}, {"493c": "#4 Reading Powerfully Changes Your Mindsets and Beliefs"}, {"5818": "Every heard of a mindset intervention?"}, {"7bd0": "Here’s Kelly McGonigal’s explanation from The Upside of Stress:"}, {"259b": "“Mindsets are beliefs that shape your reality, including objective physical reactions (like the strength of my arm as Crum pushed on it), and even long-term health, happiness, and success. More important, the new field of mindset science shows that a single brief intervention, designed to change how you think about something, can improve your health, happiness, and success, even years into the future. The field is full or remarkable findings that will make you think twice about your own beliefs. From placebos to self-fulfilling prophecies, perception matters.”"}, {"d398": "The goal of a mindset intervention is to change your mindset about something — in other words, how you think or feel about something. This then can lead to remarkable changes in a person’s health, happiness, and success."}, {"5cd4": "Here’s an interesting study highlighting the powerful effects such a mindset intervention can have:"}, {"61b4": "​In a study testing whether the relationship between exercise and health is moderated by one’s mind-set, 84 female room attendants working in seven different hotels were measured on physiological health variables affected by exercise. Those in the informed condition were told that the work they do (cleaning hotel rooms) is good exercise and satisfies the Surgeon General’s recommendations for an active lifestyle. Examples of how their work was exercise were provided. Subjects in the control group were not given this information. Although actual behavior did not change, 4 weeks after the intervention, the informed group perceived themselves to be getting significantly more exercise than before. As a result, compared with the control group, they showed a decrease in weight, blood pressure, body fat, waist-to-hip ratio, and body mass index."}, {"e9a7": "That’s how powerful our mindsets and beliefs are. Remember, these housekeepers didn’t consciously change a thing. All that really changed was their mindset… and just look what a crazy effect it had on their lives."}, {"644b": "Now think about it in your own life. What beliefs and mindsets might you be having that are potentially holding you back? Maybe you believe that life is tough, that women don’t like skinny guys (or fat guys), that achieving anything in this life without a college degree is impossible. Maybe you believe that losing weight is hard, or that building muscle mass is impossible, or that eating healthy is expensive, or …"}, {"b4dd": "These are all mindsets and beliefs that society has conditioned and programmed into your (subconscious) mind. These programs — that you did not choose yourself — are now running your life without you even knowing it."}, {"2b8b": "Here’s where books come into play: Reading books gives you more programs to choose from. They give you alternative views. They give you other perspectives. They show you that your narrow view of the world may not be the end-all-be-all."}, {"d8c0": "Books are nothing more than mindset interventions. And best of all, one book may contain 5, 10, 20, or even more mindset interventions. They can completely change your life by changing your beliefs, your mindsets, your entire worldview and how you see the world."}, {"e131": "Are you starting to understand how reading can be a true game-changer? How reading turns you into a fuller and more powerful human being? How reading can completely turn your life around? How it can literally create a new, better reality for you?"}, {"2feb": "Let me give you two specific beliefs I got from some of the books I’ve read…"}, {"261c": "Stress is good for you. Stress is bad for us, that’s what society tells us. Whenever I felt stressed out in the past, I made a big deal out of it. I thought it was super unhealthy and I told myself that I shouldn’t ever feel stressed. That all changed when I read The Upside of Stress by Kelly McGonigal."}, {"4ba7": "Guess what? Stress is actually good for you! It helps you perform better and makes you more resilient in the future. It’s only bad for you if you think it’s bad. Duh! Nowadays I see stress as a positive sign. As a learning opportunity. As a way to grow and become a stronger version of myself."}, {"58b7": "Anyone can get rich. I grew up in a family and culture where being rich was a bit frowned upon. I also didn’t know any rich people. Instead, I clearly remember my mother often telling us that we’re short on cash and we should be cautious when spending money. Getting rich seemed almost kind of magical and mythical — certainly it wasn’t possible for ordinary people."}, {"4249": "That changed when I read a summary of T. Harv Eker’s Secrets of the Millionaire Mind. According to him, it’s possible for anyone to become a millionaire. It’s simply a matter of having the right mindset (!). And even though I’m not rich yet, I’m 100% convinced I can be a millionaire one day… if I want to… and if I put in enough time and effort."}, {"ca31": "Oftentimes we’re not at all aware of the programs and beliefs that are running the show in our lives. And if you don’t read or learn or in any other way expose yourself to new ideas, new mindsets, new beliefs…"}, {"4218": "Then guess what? Your programs will never change… and neither will your life."}, {"7919": "Bottom line: Reading opens you up to a whole new world. It shows you new possibilities, new ways of looking at things, new ways of living. Reading gives you the freedom to choose your own way. It shows you a way out of society’s limited conditionings, programs, and worldviews."}, {"4028": "#5 Reading Inspires You to Do Great Things"}, {"1508": "Reading about other people and what they have achieved in life and how they made the world a better place is as motivating and inspiring as it gets."}, {"fd00": "Read (auto-)biographies of great people. Read Mandela’s story. Or Gandhi’s story. Or Abraham Lincoln’s story. Or Tiger Woods’ story. Or Kobe Bryant’s story. Or Elon Musk’s story."}, {"52e9": "What these people achieved is truly extraordinary. And by reading about them you will come to realize that they weren’t born special. They got to where they got because of hard work, dedication, will, perseverance, persistence, and a relentless drive to overcome any obstacle life has thrown in their way."}, {"c5f5": "And look, you don’t necessarly need to read biographies. Good books are packed with great stories of great people."}, {"fa02": "I recently read Tim Grover’s book “Relentless” (summary here). He was the personal coach of Kobe Bryant, Dwayne Wade, and other legendary basketball champs. In the book, he talks about the day Kobe was drafted. While pretty much all the others went out to celebrate, guess what Kobe did? He went to the fucking gym to practice."}, {"8c34": "A while back I read Laura Vanderkam’s book What Successful People Do Before Breakfast. Most of these people get up super early. They work out in the morning. They meditate. They journal. They start working on their hardest tasks. They get more done before breakfast than most people during an entire day. It’s pure inspiration."}, {"4918": "My point is, reading motivates and inspires you to do great things with your life."}, {"dd2c": "Bottom line: Reading about other people owning and dominating their lives makes you want to get up from your couch and do shit. It makes you want to make something happen. It makes you want to do more than just watch TV all day long. It’s pure inspiration."}, {"9048": "#6 Reading Automatically Improves You at [Insert Topic of the Book]"}, {"ee0b": "Recently I came across this quote from Marcy Shimoff’s book Happy for No Reason:"}, {"29af": "“In 1977 Dr. Michael Fordyce, a psychologist and author of `The Psychology of Happiness, published the groundbreaking results of his experiment showing that students asked to study the habits of happy people actually increased their happiness and life satisfaction by just learning about the subject.”"}, {"80aa": "Just learning about happiness makes you happier. And I’ve found this to be true for any topic."}, {"6e41": "I know this sounds too easy, but try it out for yourself. What’s one thing you want to get better at in your life? Read a book about it."}, {"79e0": "Want to be a better communicator? Read a book about it. Want to build more muscle mass? Read a book about it. Want to lose weight? Read a book about it. Want to become rich? Read a book about it. Want to travel the world? Read a book about it. Want to improve your golf score? Read a book about it."}, {"f67a": "Bottom line: The act of reading and learning about a specific topic automatically makes you better at it. Want more happiness? Read a book on how to become happier. Simple as that."}, {"b63a": "#7 Reading Upgrades Your Environment by Giving You Virtual Friends and Mentors"}, {"ba0c": "Ever heard of the following expression:"}, {"8b27": "“You are the average of the five people you spend the most time with.” — Jim Rohn"}, {"812b": "Jim Rohn goes on to explain, “You will become the combined average of the five people you hang around the most. You will have the combined attitude, health and income of the five people you hang around the most.”"}, {"597b": "We absorb other people`s personalities, habits, styles, thought patterns, mindsets, and attitudes like a sponge."}, {"d4de": "There’s the saying that criminals are made, not born. Think about it. Nobody is born a criminal. It’s a characteristic (like any other) that is developed gradually over time. It’s circumstances like unemployment, child abuse, a “bad” neighborhood that slowly turn a person into a criminal."}, {"5200": "It’s scientifically proven that children who have been abused are more likely to grow up to be criminals. They grew up with a lot of hate which is naturally absorbed into their personalities. That same child growing up with loving parents and in a “good” neighborhood might become a completely different person."}, {"ffc0": "It’s all in the environment. It’s all about the people your surround yourself with."}, {"c8b2": "Ever wondered why Silicon Valley brings out so many millionaires? It`s because the people there are surrounded by so many other successful people. Kids grow up in a society where entrepreneurship, high achievement, success, and getting rich is normal."}, {"de4a": "It`s really simple: If you want to be rich, hang around rich people. If you want to be funny, hang around funny people. If you want to be a great athlete, hang around other great athletes. If you want to be a total loser, hang around other losers."}, {"8d1b": "Now here’s the kicker: It’s not just about who you hang around with physically."}, {"6384": "If you read someone’s book, it’s almost as if you’re hanging out with that person. It’s almost as if the author is talking to you. And so you absorb his or her personality, mindsets, beliefs, and thought patterns."}, {"37c7": "If you read Mandela’s biography, it’s almost as if you’re hanging out with him. If you read Steve Jobs’ biography, it’s almost as if you’re hanging out with him. Just think for a second how powerful that is."}, {"1974": "The authors of the books you read in a way become your friends and mentors. And so you start absorbing these great people’s mindsets, beliefs, attitudes, thought patterns, and more."}, {"8dba": "Are you starting to see the magic powers behind the simple act of reading?"}, {"12c6": "Bottom line: Reading someone’s book helps you absorb that person’s beliefs, mindsets, attitudes, and thought patterns. It’s almost as if you’re actually hanging out with that person — it’s like having a virtual mentor."}, {"43ef": "Let’s Wrap This Up"}, {"7a45": "Here are 7 reasons why you may want to up your reading game:"}, {"696c": "My goal with this article is to get you to read more. Let me know if it worked in the comments below. And thanks for reading."}, {"a8c9": "Want more?"}, {"1a52": "Want additional strategies to live better and become more productive? Then download some of my top productivity hacks by clicking the link below:"}, {"36a8": "My Top 7 Productivity Hacks to Get More Done (free PDF)"}, {"a3ab": "Originally published at www.njlifehacks.com."}], "child": "823_1823_1"}