{"name": "825", "parent": "", "content": "With Winning in Mind: 8 Mental Hacks From An Olympic Gold Medalist How to Develop the Mindset of a Champion. Robert Downey Jr. — Clearly Winning In His Mind Lanny Bassham is a rockstar. Well, actually he’s an Olympic Gold Medalist (in rifle shooting) and the author of a stunning book called “With Winning in Mind” — my #1 favorite mental training book. The book is packed with great ideas on how to use our mind to win at the game of sports and at the game of life. Best of all, Lanny shares the exact mental tools he used to win at the Olympics. In this article I show 8 key ideas I learned from this book. 1. What Are You Picturing In Your Mind? “I had a baseball coach once who always said, “Whatever you do Bassham, don’t strike out.” What do you picture when I say, “Don’t strike out.” It is impossible to think about hitting the ball if you are picturing striking out.” “It is impossible to picture winning and losing at the same time. You are either picturing something that will help you or something that will hurt you.” According to Lanny, it doesn’t really matter which words we use when we think or talk. What matters is the picture that gets created in our minds. Think about it: What happens when I say, “Don’t think about a pink elephant?” Damn right, your mind pictures a pink elephant. What happens when you’re about to hit the ball and you or someone else is constantly telling you, “Don’t strike out! Don’t strike out! Don’t strike out!” Yep, you picture yourself NOT hitting the ball, but striking out instead. This is HUGELY important. We have to take control over our mental pictures. Everything we’re picturing either helps us and moves us in the right direction or harms us and moves us in the wrong direction. Just like every action and every decision you make… every mental picture you create in your mind either helps you achieve your goals or moves you further away from your goals. (Note: It doesn’t matter who creates the picture in your mind. It could be your coach, your mother, your friends, or yourself. What matters is the picture that gets created. Keep that in mind.) 2. The Mental Picture Is Formed By What You Think, Talk, Or Write About “Our conscious picture is formed from what you think about, talk about, and write about. Let’s keep this short and simple: The conscious picture is formed from what we think about, talk about, and write about. (Or, as I mentioned earlier, by what someone else talks to you about.) So controlling your mental pictures happens by controlling what you think, talk, and write about. Simple enough. Let’s go one step further. 3. Be Careful What You Wish For Picture “The more we think about, talk about, and write about something happening, we improve the probability of that thing happening!“ Now it gets real interesting. Every time you think about, talk about, or write about something happening ( → you picture something in your mind), you increase the odds of that thing happening. Are you constantly telling yourself that you’ll fail a certain exam? Well congrats! Every time you do that, you improve the probability of failing the exam. Are you telling yourself that you’ll miss the crucial penalty kick? Too bad! Every time you do that, you improve the probability of missing that penalty kick. Lanny calls this reinforcement. Every time you create a picture in your mind, you reinforce that picture and increase the likelihood of making it a reality. You can either use positive reinforcement (great idea!) or negative reinforcement (terrible idea!). Let’s further examine this… 4. Positive Reinforcement This is when you reinforce a positive behavior. Remember that the more we think about, talk about, and write about something happening, the higher the probability of that thing happening. When you reinforce a positive behavior, you increase the likelihood of that behavior happening again. The point is: Whenever you do something beneficial, you want to reinforce it. Because reinforcing it improves the likelihood of that thing happening again. That begs the question: How do you positively reinforce something? By thinking, talking, or writing about it. Here are some ways to do it: We’ll see one awesome strategy Lanny Bassham uses to positively reinforce something. 5. Negative Reinforcement “Be careful not to complain. I often hear people, in business as well as sport, complaining about their circumstances. Complaining is negative reinforcement. I teach my students not to reinforce a bad shot by getting angry. Do not reinforce a bad day at the office by complaining to your spouse. Remember something that you did well each day instead. Fill your thoughts only with your best performances and you cannot help but be successful!” Ugh… Negative reinforcement. It’s TERRIBLE. Yet, funny enough, it’s what most of us are absolute pros at. Do something right and nobody gives a sh*t. (= no positive reinforcement.) Do something wrong and people are all over you telling you what a loser you are and blablabla. (= negative reinforcement.) Ourselves, we are often the worst offenders. Somehow we were just never taught to reinforce our good behaviors, but instead we were taught to get down on us when we did something wrong. Anyway, it’s obvious that we want to reinforce our good behaviors, not our bad ones. So what are some ways we negatively reinforce our bad behaviors? Remember: Every time you think, talk, or write about a bad performance/behavior/whatever, you improve the probability of having another bad performance/behavior/whatever just like it in the future. Just look what Lanny Bassham says about his toughest competitors: “One thing I especially remember about training with them was that they never talked about their failures in front of me. If Wigger (World and Olympic Champion) had a problem, he kept it to himself. Jack Writer (World and Olympic Champion) was a talker. It was not that Jack bragged on himself, although I can understand how those who didn’t know him would think that. Jack just liked to talk. His favorite subject was shooting, and he was his favorite shooter. No matter how many low scores he shot, Jack would only talk about the high ones. The important lesson here is that Writer never reinforced a bad performance and rarely shot a low score in a big match. Margaret Murdoch (World and Olympic Silver Medalist) rarely talked at all. If she did, it was to compliment others on their performance. I wonder if she knew that every time she praised another shooter, she also improved her own chances of winning?” The point is: The top athletes do NOT negatively reinforce their bad performances. And neither should you. And neither should I. 6. Catch Yourself Doing Something Right “Stop catching yourself doing things wrong and trying to find out why you are failing. Instead, only think about your successes, never your failures. An example is the golfer. The mentally uninformed golfer hits a good shot and says, “Well, I guess I just got lucky that time.” When he hits a bad shot he says, “Why do I always do that?” The mentally informed golfer hits a bad shot. He knows it is bad, but says, “Next time I will hit a better shot.” Then he hits a good shot and says, “That’s a good shot. What did I do right?” See the difference?” First of all, congratulations! You’re now part of an exclusive club of the mentally informed. Welcome. May you enjoy your stay with us, positively reinforce your good actions, forget about the bad ones, and live a great and enjoyable life. Seriously, though, this whole positive vs. negative reinforcement stuff was a big epiphany for me. Instead of catching ourselves doing something wrong, let’s from now on catch ourselves doing something right and improve our chances of repeating that positive behavior in the future. You can catch yourself doing anything right. Be it cleaning your room, studying, reading, meditating, being kind to someone, having fun, practicing something… whatever it is: Catch yourself and pat yourself on the back. Applaud yourself. Better yet, celebrate yourself. I know it’s counterintuitive, but that’s because our society is seriously messed up. We’re all programmed to focus on the negative, to complain, to make excuses, to behave like little bitches, and to use negative reinforcement. Let’s stop that. Instead be nice to yourself and others, focus on the positive, talk about the good things in life, and positively reinforce them. 7. Mental Rehearsal “In mental rehearsal you are picturing what you want to see happen before you actually perform. You go over in your mind exactly how you want your performance to be conducted. In rifle shooting, you picture holding the rifle, looking through the sights, centering the target, and firing the shot in the ten ring. The more vivid the picture, the better the outcome. The more often you rehearse, the better the chance for success.” Mental rehearsal is simply visualizing your performance or behavior in your mind. You can mentally rehearse giving a speech, shooting a free-throw, hitting a grand slam, writing an exam, or anything else. The benefits are threefold: 1) You are practicing: Mental rehearsal is mental practice. Maybe it’s not as good as actually practicing, but Lanny says it’s a great substitute when actual training is not possible due to weather, injury, or time limitations. 2) No negative reinforcement: Because you only rehearse good performances, there is no negative reinforcement. It’s 100% purely positive reinforcement (which is almost impossible during actual training). 3) It reduces fear: This is neat. When you’ve been in a stressful situation often, the stress or fear you encounter diminishes over time. (Think about the first speech you’ve ever made. I bet you were more nervous than in your 10th speech, right?) Rehearsal reduces fear because it gives you mental experience in a pressure situation. Lanny claims that he’s competed in the Olympic Games twice physically, but thousands of times mentally. Hah, what a legend. Keep in mind that you mentally rehearse the process of your performance, NOT the outcome. Merely imagining a positive outcome would be counterproductive as I explain in this article. Anyway, want to see an awesome example that combines mental rehearsal with positive reinforcement? Here you go… 8. “That’s like me” Rehearsal + Reinforcement Rehearse that you’re the Greatest. “You can imagine far more than you currently can achieve. If you consistently rehearse what you want to achieve, what you imagine can become reality. Let me give you an example. Back in the 1970s, I was shooting good kneeling scores and began approaching the national record of 396/400. I wanted to set the record at 400, a perfect score. But I had never actually fired a 400, even in training. Nonetheless, I vividly rehearsed shooting the first 100, then another and another. I visualized each of the last ten shots building toward the record. I rehearsed what I knew would happen at that point: I would realize that I was above the record. Next, I rehearsed hearing a voice say, “That’s OK. I do this all the time.” Then I imagined shooting the final ten easily and saying to myself, “Another 400, that’s like me.” I rehearsed this sequence several times a day for two months. In my first competition since beginning the rehearsal, I started with a 100 kneeling. My next two targets were also 100s. I began my last series with ten, ten, ten, ten, ten. Only five more to go. Ten. Ten. Ten. Then reality set in. I was above the record. I heard an internal voice say, “That’s OK, I do this all the time.” I shot two additional tens, setting the national record at a perfect 400.” Did you read this? No? Do it. Yes? Awesome, huh? So he basically mentally rehearsed shooting a perfect record of 400/400. And when (in his mind) he hit the 400/400 he positively reinforced it by saying, “That’s like me” and “I do this all the time.” He’s reprogramming his mind and tells it over and over and over again that hitting a perfect 400/400 is “like him” and that he “does it all the time”. Mad cool. Oh, and he had never even actually shot a 400/400. Not even in training. But of course he then did it straight away in the next competition after using this mental rehearsal + positive reinforcement technique. Just. Like. That. Recap Phew. Let’s recap this goodness: First off, you have to take control over what you picture in your mind. Because whenever you picture something in your mind, you increase the likelihood of that thing happening in the future. You control the picture in your mind (and thus what’s happening in the future) by choosing what you think, talk, and write about. At any given time, you are either picturing something positive or something negative in your mind. You are either thinking, talking, or writing about something positive or you are thinking, talking, or writing about something negative. In other words, you are reinforcing certain behaviors. There are two kinds of reinforcement: 1. Positive Reinforcement (YES!): You reinforce something you did well such as hitting a grand slam, meditating, studying, being nice to someone, or whatever. Reinforcing this positive action makes happening it again in the future more likely. 2. Negative Reinforcement (Meh!): You reinforce something you did poorly such as missing a shot, wasting time on Facebook, getting in an argument with someone, or whatever. Reinforcing the negative action makes happening it again in the future more likely. (NOT what we’re after!) Remember: You reinforce something by thinking, talking, or writing about it. Let’s get real specific now… How to use positive reinforcement in your life (do this more often!) How to STOP using negative reinforcement in your life (stop doing this!) And that’s it! The bottom line is: Stop focusing on the negative. Stop complaining, making excuses, bitching around, or in any other way negatively reinforcing what you don’t want in life. Instead be nice to yourself and others, focus on the positive, talk about the good things in life, and just generally try to reinforce what you want more of in life. Oh, and by the way: Good job on reading this article. I’m sure you got something useful out of it. Be sure to pat yourself on the back and reinforce this behavior ✓ Want more? Want additional strategies to live better and become more productive? Then download some of my top productivity hacks by clicking the link below: My Top 7 Productivity Hacks to Get More Done (free PDF) Originally published at www.njlifehacks.com. ", "title": "With Winning in Mind: 8 Mental Hacks From An Olympic Gold Medalist", "sentences": [{"e75c": "With Winning in Mind: 8 Mental Hacks From An Olympic Gold Medalist"}, {"2f71": "How to Develop the Mindset of a Champion."}, {"48d5": "Robert Downey Jr. — Clearly Winning In His Mind"}, {"f3ad": "Lanny Bassham is a rockstar."}, {"f017": "Well, actually he’s an Olympic Gold Medalist (in rifle shooting) and the author of a stunning book called “With Winning in Mind” — my #1 favorite mental training book."}, {"4edd": "The book is packed with great ideas on how to use our mind to win at the game of sports and at the game of life."}, {"d89e": "Best of all, Lanny shares the exact mental tools he used to win at the Olympics. In this article I show 8 key ideas I learned from this book."}, {"832d": "1. What Are You Picturing In Your Mind?"}, {"e73a": "“I had a baseball coach once who always said, “Whatever you do Bassham, don’t strike out.” What do you picture when I say, “Don’t strike out.” It is impossible to think about hitting the ball if you are picturing striking out.”"}, {"6bee": "“It is impossible to picture winning and losing at the same time. You are either picturing something that will help you or something that will hurt you.”"}, {"77b6": "According to Lanny, it doesn’t really matter which words we use when we think or talk. What matters is the picture that gets created in our minds."}, {"a382": "Think about it: What happens when I say, “Don’t think about a pink elephant?” Damn right, your mind pictures a pink elephant."}, {"5dcf": "What happens when you’re about to hit the ball and you or someone else is constantly telling you, “Don’t strike out! Don’t strike out! Don’t strike out!”"}, {"7ca6": "Yep, you picture yourself NOT hitting the ball, but striking out instead. This is HUGELY important. We have to take control over our mental pictures. Everything we’re picturing either helps us and moves us in the right direction or harms us and moves us in the wrong direction."}, {"0b9d": "Just like every action and every decision you make… every mental picture you create in your mind either helps you achieve your goals or moves you further away from your goals."}, {"5432": "(Note: It doesn’t matter who creates the picture in your mind. It could be your coach, your mother, your friends, or yourself. What matters is the picture that gets created. Keep that in mind.)"}, {"ce46": "2. The Mental Picture Is Formed By What You Think, Talk, Or Write About"}, {"6031": "“Our conscious picture is formed from what you think about, talk about, and write about."}, {"8138": "Let’s keep this short and simple: The conscious picture is formed from what we think about, talk about, and write about. (Or, as I mentioned earlier, by what someone else talks to you about.)"}, {"6f0e": "So controlling your mental pictures happens by controlling what you think, talk, and write about."}, {"6d03": "Simple enough. Let’s go one step further."}, {"7c94": "3. Be Careful What You Wish For Picture"}, {"ece4": "“The more we think about, talk about, and write about something happening, we improve the probability of that thing happening!“"}, {"9f6c": "Now it gets real interesting. Every time you think about, talk about, or write about something happening ( → you picture something in your mind), you increase the odds of that thing happening."}, {"0d54": "Are you constantly telling yourself that you’ll fail a certain exam? Well congrats! Every time you do that, you improve the probability of failing the exam."}, {"a295": "Are you telling yourself that you’ll miss the crucial penalty kick? Too bad! Every time you do that, you improve the probability of missing that penalty kick."}, {"755c": "Lanny calls this reinforcement. Every time you create a picture in your mind, you reinforce that picture and increase the likelihood of making it a reality. You can either use positive reinforcement (great idea!) or negative reinforcement (terrible idea!)."}, {"7b35": "Let’s further examine this…"}, {"10ac": "4. Positive Reinforcement"}, {"24d3": "This is when you reinforce a positive behavior. Remember that the more we think about, talk about, and write about something happening, the higher the probability of that thing happening."}, {"4ab7": "When you reinforce a positive behavior, you increase the likelihood of that behavior happening again."}, {"a38d": "The point is: Whenever you do something beneficial, you want to reinforce it. Because reinforcing it improves the likelihood of that thing happening again."}, {"122f": "That begs the question: How do you positively reinforce something? By thinking, talking, or writing about it. Here are some ways to do it:"}, {"48cd": "We’ll see one awesome strategy Lanny Bassham uses to positively reinforce something."}, {"9b7f": "5. Negative Reinforcement"}, {"9dc2": "“Be careful not to complain. I often hear people, in business as well as sport, complaining about their circumstances. Complaining is negative reinforcement. I teach my students not to reinforce a bad shot by getting angry. Do not reinforce a bad day at the office by complaining to your spouse. Remember something that you did well each day instead. Fill your thoughts only with your best performances and you cannot help but be successful!”"}, {"f8bd": "Ugh… Negative reinforcement."}, {"0c83": "It’s TERRIBLE. Yet, funny enough, it’s what most of us are absolute pros at. Do something right and nobody gives a sh*t. (= no positive reinforcement.) Do something wrong and people are all over you telling you what a loser you are and blablabla. (= negative reinforcement.)"}, {"4202": "Ourselves, we are often the worst offenders. Somehow we were just never taught to reinforce our good behaviors, but instead we were taught to get down on us when we did something wrong."}, {"3585": "Anyway, it’s obvious that we want to reinforce our good behaviors, not our bad ones. So what are some ways we negatively reinforce our bad behaviors?"}, {"6779": "Remember: Every time you think, talk, or write about a bad performance/behavior/whatever, you improve the probability of having another bad performance/behavior/whatever just like it in the future."}, {"b977": "Just look what Lanny Bassham says about his toughest competitors:"}, {"347d": "“One thing I especially remember about training with them was that they never talked about their failures in front of me."}, {"eaa1": "If Wigger (World and Olympic Champion) had a problem, he kept it to himself."}, {"047e": "Jack Writer (World and Olympic Champion) was a talker. It was not that Jack bragged on himself, although I can understand how those who didn’t know him would think that. Jack just liked to talk. His favorite subject was shooting, and he was his favorite shooter. No matter how many low scores he shot, Jack would only talk about the high ones. The important lesson here is that Writer never reinforced a bad performance and rarely shot a low score in a big match."}, {"35e2": "Margaret Murdoch (World and Olympic Silver Medalist) rarely talked at all. If she did, it was to compliment others on their performance. I wonder if she knew that every time she praised another shooter, she also improved her own chances of winning?”"}, {"4aba": "The point is: The top athletes do NOT negatively reinforce their bad performances. And neither should you. And neither should I."}, {"ffb7": "6. Catch Yourself Doing Something Right"}, {"0b7a": "“Stop catching yourself doing things wrong and trying to find out why you are failing. Instead, only think about your successes, never your failures. An example is the golfer. The mentally uninformed golfer hits a good shot and says, “Well, I guess I just got lucky that time.” When he hits a bad shot he says, “Why do I always do that?” The mentally informed golfer hits a bad shot. He knows it is bad, but says, “Next time I will hit a better shot.” Then he hits a good shot and says, “That’s a good shot. What did I do right?” See the difference?”"}, {"c4c4": "First of all, congratulations!"}, {"da17": "You’re now part of an exclusive club of the mentally informed. Welcome. May you enjoy your stay with us, positively reinforce your good actions, forget about the bad ones, and live a great and enjoyable life."}, {"08e6": "Seriously, though, this whole positive vs. negative reinforcement stuff was a big epiphany for me."}, {"1d63": "Instead of catching ourselves doing something wrong, let’s from now on catch ourselves doing something right and improve our chances of repeating that positive behavior in the future."}, {"44d7": "You can catch yourself doing anything right. Be it cleaning your room, studying, reading, meditating, being kind to someone, having fun, practicing something… whatever it is: Catch yourself and pat yourself on the back."}, {"ad2a": "Applaud yourself. Better yet, celebrate yourself."}, {"9ae2": "I know it’s counterintuitive, but that’s because our society is seriously messed up. We’re all programmed to focus on the negative, to complain, to make excuses, to behave like little bitches, and to use negative reinforcement. Let’s stop that."}, {"b955": "Instead be nice to yourself and others, focus on the positive, talk about the good things in life, and positively reinforce them."}, {"83ff": "7. Mental Rehearsal"}, {"b2c3": "“In mental rehearsal you are picturing what you want to see happen before you actually perform. You go over in your mind exactly how you want your performance to be conducted. In rifle shooting, you picture holding the rifle, looking through the sights, centering the target, and firing the shot in the ten ring. The more vivid the picture, the better the outcome. The more often you rehearse, the better the chance for success.”"}, {"708c": "Mental rehearsal is simply visualizing your performance or behavior in your mind. You can mentally rehearse giving a speech, shooting a free-throw, hitting a grand slam, writing an exam, or anything else."}, {"5057": "The benefits are threefold:"}, {"a090": "1) You are practicing: Mental rehearsal is mental practice. Maybe it’s not as good as actually practicing, but Lanny says it’s a great substitute when actual training is not possible due to weather, injury, or time limitations."}, {"eb10": "2) No negative reinforcement: Because you only rehearse good performances, there is no negative reinforcement. It’s 100% purely positive reinforcement (which is almost impossible during actual training)."}, {"b0a2": "3) It reduces fear: This is neat. When you’ve been in a stressful situation often, the stress or fear you encounter diminishes over time. (Think about the first speech you’ve ever made. I bet you were more nervous than in your 10th speech, right?) Rehearsal reduces fear because it gives you mental experience in a pressure situation. Lanny claims that he’s competed in the Olympic Games twice physically, but thousands of times mentally. Hah, what a legend."}, {"876e": "Keep in mind that you mentally rehearse the process of your performance, NOT the outcome. Merely imagining a positive outcome would be counterproductive as I explain in this article."}, {"1311": "Anyway, want to see an awesome example that combines mental rehearsal with positive reinforcement? Here you go…"}, {"cbdd": "8. “That’s like me” Rehearsal + Reinforcement"}, {"8a1c": "Rehearse that you’re the Greatest."}, {"9a9e": "“You can imagine far more than you currently can achieve. If you consistently rehearse what you want to achieve, what you imagine can become reality. Let me give you an example. Back in the 1970s, I was shooting good kneeling scores and began approaching the national record of 396/400. I wanted to set the record at 400, a perfect score. But I had never actually fired a 400, even in training. Nonetheless, I vividly rehearsed shooting the first 100, then another and another. I visualized each of the last ten shots building toward the record. I rehearsed what I knew would happen at that point: I would realize that I was above the record. Next, I rehearsed hearing a voice say, “That’s OK. I do this all the time.” Then I imagined shooting the final ten easily and saying to myself, “Another 400, that’s like me.” I rehearsed this sequence several times a day for two months. In my first competition since beginning the rehearsal, I started with a 100 kneeling. My next two targets were also 100s. I began my last series with ten, ten, ten, ten, ten. Only five more to go. Ten. Ten. Ten. Then reality set in. I was above the record. I heard an internal voice say, “That’s OK, I do this all the time.” I shot two additional tens, setting the national record at a perfect 400.”"}, {"23d4": "Did you read this? No? Do it. Yes? Awesome, huh?"}, {"7d94": "So he basically mentally rehearsed shooting a perfect record of 400/400."}, {"fc21": "And when (in his mind) he hit the 400/400 he positively reinforced it by saying, “That’s like me” and “I do this all the time.” He’s reprogramming his mind and tells it over and over and over again that hitting a perfect 400/400 is “like him” and that he “does it all the time”."}, {"f9ff": "Mad cool. Oh, and he had never even actually shot a 400/400. Not even in training. But of course he then did it straight away in the next competition after using this mental rehearsal + positive reinforcement technique. Just. Like. That."}, {"9fbf": "Recap"}, {"6241": "Phew. Let’s recap this goodness: First off, you have to take control over what you picture in your mind. Because whenever you picture something in your mind, you increase the likelihood of that thing happening in the future."}, {"11a6": "You control the picture in your mind (and thus what’s happening in the future) by choosing what you think, talk, and write about."}, {"a5b5": "At any given time, you are either picturing something positive or something negative in your mind. You are either thinking, talking, or writing about something positive or you are thinking, talking, or writing about something negative."}, {"4cd8": "In other words, you are reinforcing certain behaviors. There are two kinds of reinforcement:"}, {"1b14": "1. Positive Reinforcement (YES!): You reinforce something you did well such as hitting a grand slam, meditating, studying, being nice to someone, or whatever. Reinforcing this positive action makes happening it again in the future more likely."}, {"2759": "2. Negative Reinforcement (Meh!): You reinforce something you did poorly such as missing a shot, wasting time on Facebook, getting in an argument with someone, or whatever. Reinforcing the negative action makes happening it again in the future more likely. (NOT what we’re after!)"}, {"8c85": "Remember: You reinforce something by thinking, talking, or writing about it. Let’s get real specific now… How to use positive reinforcement in your life (do this more often!)"}, {"e254": "How to STOP using negative reinforcement in your life (stop doing this!)"}, {"93b8": "And that’s it!"}, {"c660": "The bottom line is: Stop focusing on the negative. Stop complaining, making excuses, bitching around, or in any other way negatively reinforcing what you don’t want in life."}, {"2a5e": "Instead be nice to yourself and others, focus on the positive, talk about the good things in life, and just generally try to reinforce what you want more of in life."}, {"4d6e": "Oh, and by the way: Good job on reading this article. I’m sure you got something useful out of it. Be sure to pat yourself on the back and reinforce this behavior ✓"}, {"a4de": "Want more?"}, {"1a52": "Want additional strategies to live better and become more productive? Then download some of my top productivity hacks by clicking the link below:"}, {"36a8": "My Top 7 Productivity Hacks to Get More Done (free PDF)"}, {"e487": "Originally published at www.njlifehacks.com."}], "child": "825_1\t825_2\t825_3825_1\t825_2\t825_3"}