{"name": "828", "parent": "", "content": "What did you do today to get closer to your goal? The question that supercharged my personal growth. Start small I used to buy lunch every working day. Watching my bank account shrink and stomach grow, I knew I needed a change. I constantly reminded myself to save money and eat healthier but these reminders never resulted in action. This trend suddenly changed when I met with one of my mentors. He asked where I wanted to be in a month. I shared personal and professional goals including my goal to save money and eat healthier. He then asked what had I done that day to get closer to these goals. Mind blown! The answer was nothing and I felt embarrassed that I expected to change but took no accountability for daily actions to get there. This conversation prompted me to start checking in daily on the progress I’d made towards goals. Doing so forced me to start thinking smaller, setting more immediate action items vs long-term pipedreams. Over time, these action items became stepping stones towards really big accomplishments. Pack a lunch today. I wasn’t overwhelmed by the idea of packing a lunch for the rest of my life because I set this goal just for today. So I did it. I packed lunch for the day; It was cheap, delicious and healthy. Although I was quickly back to buying lunch; I was energized by the small progress I recently made. A few days later, I set the same objective to pack lunch. A few days after that I set the goal twice in a row. Soon I was packing lunch for the week and then the month. Why this works so well The worst way to end your day is to look in the mirror and tell yourself you did nothing to get closer to your goals. On the flip side, it’s energizing when you know each day you’re investing in yourself and getting closer to your growth goals. Building blocks to success With the success of packing a lunch, I started tracking other ambitions. Eating more veggies, meditating, and improving my writing. We even started asking the question at work. The team uses objectiveIQ to share snapshots of what they did that day to get them closer to their career goals. Three steps to success Goal-tracking as a challenge: It starts with a personal challenge to be accountable to yourself. Where do you want to be in a month? Put pen to paper and commit to it. Now challenge yourself to ask every day what did you do to get closer to your goal? Goal tracking as a habit: A few weeks in and you’re in a rhythm. You’ll notice that your small daily accomplishments are adding up. You’re now exceeding expectations on where you want to be in a month. Goal tracking as a lifestyle: Your growth engine is supercharged. Being accountable to yourself allows you to go anywhere you set your mind to. Getting that promotion, spending time with old friends, going on that dream vacation are now accomplishments in your rear window. You’re ready to take on bigger goals you never before thought possible. What did you do today to get closer to your goal? ", "title": "What did you do today to get closer to your goal?", "sentences": [{"8daf": "What did you do today to get closer to your goal?"}, {"7a18": "The question that supercharged my personal growth."}, {"89ec": "Start small"}, {"caec": "I used to buy lunch every working day. Watching my bank account shrink and stomach grow, I knew I needed a change. I constantly reminded myself to save money and eat healthier but these reminders never resulted in action. This trend suddenly changed when I met with one of my mentors. He asked where I wanted to be in a month. I shared personal and professional goals including my goal to save money and eat healthier. He then asked what had I done that day to get closer to these goals."}, {"a22e": "Mind blown!"}, {"3eed": "The answer was nothing and I felt embarrassed that I expected to change but took no accountability for daily actions to get there. This conversation prompted me to start checking in daily on the progress I’d made towards goals. Doing so forced me to start thinking smaller, setting more immediate action items vs long-term pipedreams. Over time, these action items became stepping stones towards really big accomplishments."}, {"bd35": "Pack a lunch today."}, {"dfa1": "I wasn’t overwhelmed by the idea of packing a lunch for the rest of my life because I set this goal just for today. So I did it. I packed lunch for the day; It was cheap, delicious and healthy. Although I was quickly back to buying lunch; I was energized by the small progress I recently made. A few days later, I set the same objective to pack lunch. A few days after that I set the goal twice in a row. Soon I was packing lunch for the week and then the month."}, {"2bc1": "Why this works so well"}, {"9cb7": "The worst way to end your day is to look in the mirror and tell yourself you did nothing to get closer to your goals. On the flip side, it’s energizing when you know each day you’re investing in yourself and getting closer to your growth goals."}, {"3182": "Building blocks to success"}, {"f909": "With the success of packing a lunch, I started tracking other ambitions. Eating more veggies, meditating, and improving my writing. We even started asking the question at work. The team uses objectiveIQ to share snapshots of what they did that day to get them closer to their career goals."}, {"9ca8": "Three steps to success"}, {"72a8": "Goal-tracking as a challenge:"}, {"1973": "It starts with a personal challenge to be accountable to yourself. Where do you want to be in a month? Put pen to paper and commit to it. Now challenge yourself to ask every day what did you do to get closer to your goal?"}, {"6ffd": "Goal tracking as a habit:"}, {"b4da": "A few weeks in and you’re in a rhythm. You’ll notice that your small daily accomplishments are adding up. You’re now exceeding expectations on where you want to be in a month."}, {"c66e": "Goal tracking as a lifestyle:"}, {"fea5": "Your growth engine is supercharged. Being accountable to yourself allows you to go anywhere you set your mind to. Getting that promotion, spending time with old friends, going on that dream vacation are now accomplishments in your rear window. You’re ready to take on bigger goals you never before thought possible."}, {"196e": "What did you do today to get closer to your goal?"}], "child": "828_1\t828_2828_1\t828_2"}