{"name": "835", "parent": "", "content": "Quick Tip: How To Use Your Mind To Build More Muscle Before we get into the meat and potatoes of this article let’s take a second and applaud Barcelona for defying the odds and putting in one of their best performances ever. On March 8 2017 Barcelona completed arguably the greatest comeback in recent history knocking out PSG and progressing on to the quarter finals of the champions league. At 3–0 we were optimistic but when Cavani pulled one back for PSG it was mission impossible, now Barca need 3 goals to win. But from the 85th minute onwards something magical happened. I’m a bit calmer right now but I still can’t believe it. There are very few things that get me that excited like the time when we had a week off of school because my teacher called in sick (I hope she’s doing well now. Its been a couple of years though) Back to the article! You want to build muscle. I want to build muscle. We all want to build muscle. With muscle mass comes confidence, strength and big biceps. The idea of sculpting your body and transforming your physique is an exciting one. Unfortunately, it is not an easy process especially after those newbie gains are gone. What are newbie gains you ask? They are all the gains you made in in your first year of lifting due to your body adapting to a new stimulus. But after that first year is up it becomes a lot more challenging to put on muscle and see the same results. You’re going to have to make some changes with your training and it starts by acquiring more knowledge relevant to your goal and putting that knowledge to action. If you’re looking to optimise muscle growth here’s one key tip that’ll help you do just that. Develop the Mind Muscle Connection Remember that guy in your school who kept rambling on and on on about ‘FEELING the muscle when lifting the weight’? He was right. Arnold Schwarzenegger talked about this mind muscle connection as well. “The weights are just a means to an end. How well you contract the muscles is what training is all about” — Arnold This isn’t some hokus pokus theory. Studies have shown that concentrating on the specific muscles significantly increases muscle activation and results in a better training effect. How Do We Do This? This mental connection between the subconscious and the weights was believed to be so advanced that only the greatest minds on the planet can acquire it. How good was Logan BTW?? Best Marvel movie ever. Luckily for us times have changed and there is light at the end of the tunnel. I’m about to go technical right now but stay with me. Every repetition consists of 2 parts: Lifting the weight (concentric) and lowering the weight (eccentric). On a bench press for example, pushing the bar away from you is the concentric phase and lowering the bar towards you is the eccentric phase. The eccentric portion is when the muscle is being stretched and lengthened. When trying to build muscle, controlling the eccentric portion of the lift is the MOST important part. Instead of using a heavy weight and relying on momentum, pick a weight you can control for the specified number of reps and try to focus fully on the muscle you’re supposed to feel when lifting and lowering the weight. Let’s say you’re doing a seated row to build your back. Whether you’re training for strength or even more importantly for size, you should work on developing this mind muscle connection every time you train. Because if you’re not feeling your biceps on a bicep curl… what’s the point? In the early stages of your muscle building journey, HOW you lift the weight is far more important than the amount you can lift. This article was originally published at fadelfitness.com If you found this article helpful hit that ‘heart’ button, comment below and share it with your friends, family, dog, and whoever needs to read it :) ", "title": "Quick Tip: How To Use Your Mind To Build More Muscle", "sentences": [{"0f7c": "Quick Tip: How To Use Your Mind To Build More Muscle"}, {"a59d": "Before we get into the meat and potatoes of this article let’s take a second and applaud Barcelona for defying the odds and putting in one of their best performances ever. On March 8 2017 Barcelona completed arguably the greatest comeback in recent history knocking out PSG and progressing on to the quarter finals of the champions league. At 3–0 we were optimistic but when Cavani pulled one back for PSG it was mission impossible, now Barca need 3 goals to win. But from the 85th minute onwards something magical happened."}, {"60a3": "I’m a bit calmer right now but I still can’t believe it. There are very few things that get me that excited like the time when we had a week off of school because my teacher called in sick (I hope she’s doing well now. Its been a couple of years though)"}, {"ef43": "Back to the article!"}, {"2631": "You want to build muscle. I want to build muscle. We all want to build muscle. With muscle mass comes confidence, strength and big biceps. The idea of sculpting your body and transforming your physique is an exciting one. Unfortunately, it is not an easy process especially after those newbie gains are gone. What are newbie gains you ask? They are all the gains you made in in your first year of lifting due to your body adapting to a new stimulus."}, {"c604": "But after that first year is up it becomes a lot more challenging to put on muscle and see the same results. You’re going to have to make some changes with your training and it starts by acquiring more knowledge relevant to your goal and putting that knowledge to action."}, {"24e9": "If you’re looking to optimise muscle growth here’s one key tip that’ll help you do just that."}, {"d174": "Develop the Mind Muscle Connection"}, {"e889": "Remember that guy in your school who kept rambling on and on on about ‘FEELING the muscle when lifting the weight’? He was right."}, {"ca5c": "Arnold Schwarzenegger talked about this mind muscle connection as well."}, {"dab3": "“The weights are just a means to an end. How well you contract the muscles is what training is all about” — Arnold"}, {"094c": "This isn’t some hokus pokus theory. Studies have shown that concentrating on the specific muscles significantly increases muscle activation and results in a better training effect."}, {"319c": "How Do We Do This?"}, {"437b": "This mental connection between the subconscious and the weights was believed to be so advanced that only the greatest minds on the planet can acquire it."}, {"3ad0": "How good was Logan BTW?? Best Marvel movie ever."}, {"3fb2": "Luckily for us times have changed and there is light at the end of the tunnel."}, {"bc08": "I’m about to go technical right now but stay with me. Every repetition consists of 2 parts: Lifting the weight (concentric) and lowering the weight (eccentric). On a bench press for example, pushing the bar away from you is the concentric phase and lowering the bar towards you is the eccentric phase. The eccentric portion is when the muscle is being stretched and lengthened."}, {"137f": "When trying to build muscle, controlling the eccentric portion of the lift is the MOST important part."}, {"eb7d": "Instead of using a heavy weight and relying on momentum, pick a weight you can control for the specified number of reps and try to focus fully on the muscle you’re supposed to feel when lifting and lowering the weight."}, {"2fdf": "Let’s say you’re doing a seated row to build your back."}, {"8a0a": "Whether you’re training for strength or even more importantly for size, you should work on developing this mind muscle connection every time you train. Because if you’re not feeling your biceps on a bicep curl… what’s the point?"}, {"6241": "In the early stages of your muscle building journey, HOW you lift the weight is far more important than the amount you can lift."}, {"6d35": "This article was originally published at fadelfitness.com"}, {"72d1": "If you found this article helpful hit that ‘heart’ button, comment below and share it with your friends, family, dog, and whoever needs to read it :)"}], "child": "835_1\t835_2"}