{"name": "837", "parent": "", "content": "How to forge a man out of yourself. Story of my life. Today I want to share with you few things that helped me become a better person than I was. It’s not some fast super-VIP method that will change you with one week, this will require from you much of work and pain. When I was a kid at age 10, I was very fearful and downtrodden, I feared of my parents, feared of people around me. I was helpless when problems come, and I fear them. I even feared to be late for school, and because of this was sleeping very bed, and looking at the watch for 10–20 times per night. I was wearing things that parents want me to wear, and not what I want. Cause I cant stand for my point of view in a dispute with them. And I was very weak physically. And in some parallel world such person still lives, but thanks to the occasion, in my case, I found people that change my life. If I’m not mistaken it was at the age of 12. They taught me few simple but hard things, which you all know very well, but I bet never think about them. First. We’re all gonna die.Some of us today, some of us at the age of 100. And you must accept this, and stop fearing this. You need to understand that many things can be much worse than death. Seeing the pain of your family from day to day, not helping someone in a critical situation and living with that… You will die, and nothing can stop this. But instead, you can choose when and how you die, and do this on your own rules. As an example, when terrorists take hostages, in most cases the number of hostages is much bigger than terrorists. And acting together, even being unarmed, they can win. But hostages always loose, ‘cause they fear death. And this fear kills them. How I accept this?I’ve started making risky things and engaging in an extreme sports. Each day I moved my fear deeper and deeper in my soul. Then I got in few situations when I could fear death and in most cases would die, or I could risk and stay alive. Second. Honor.Yeah, I know what you think. But if you look at another angle, honor is a set of your life principles which hurt you when you are trying to step over them. The main thing is that with each time when you step over your principle you step over yourself. ‘Cause this principle is you, your graphite core. And with each time some part of you dies. It’s like smoking, only that smoking will kill you, but broken principles will make your life miserable and you will beg for death. Of course, protection of one’s principles can lead to broken bones, smashed face and other not very pleasant things. But after a while, everything will heal, andthe broken principle will respond with pain in the heart for a very, very, very long time. How I achieved this?I said to myself — stop. If I can’t stand for things in which I believe then why to live, what the point? After that, I was often beaten. But with each time I was feeling more and more like a winner and not a loser. They defeated me, but didn’t break. Third. A lie is a key to progress.Let me describe you what I understand here by a lie. When you are an athlete there is a simple rule — push your limits up to 20% over your standard results. So if you are making a jump for 2 meters, then you start training to jump 2.4 meters. The same thing here. When you can do some job in a day, but instead say to people that will do it in a half of the day, this pushes you to get out of your comfort zone and work twice harder to fit in time and don’t lose your face. So you are lying about your possibilities, but this lie is pushing you to make more, faster and better. It pushes you to overcome your yesterday result, thus makes you better, step by step. And, what is even cooler, it cuts off the path for retreat. Why is this working?We all live in a society and for us, it’s very important what people say and think about us. Even if you think that it’s not important still it works. So when you commit something on public, it becomes a weapon against you if you don’t do what you promised. It is much simpler to be ugly and stupid when you live in the forest alone. But when you come to the city, where most of the people are good looking and smart, it becomes much harder. Fourth. Comfort zone is what is killing more people than drugs, guns, and cancer.It’s normal to want to be in a comfort zone when you are 60, but when you are young and full of energy you should struggle every day, ‘cause “no pain, no gain”. When the only reason for working on the current job is a fear of loosing it and your income — go and quit. Don’t wait for a new better job or winning a lottery. Your life is in your hands, and when you wait for something — you are killing yourself. Remember, that it is much better to risk and get nothing, then regret about lost opportunities. That’s one of the reasons why most of the beautiful girls at school are dating the strongest guys. That is not because they are strong, but because other guys think too much and fear of things that didn’t happen yet. Fifth. Say “Yes” to possibilities.There is a movie called “Yes Man” with Jim Carrey. At first sight, it seems to be an ordinary comedy, but looking a little deeper you will see that it is a really amazing thing. When I watched it, I though “what the hell, what I’m losing? Let’s try to live at least a week saying yes to anything.”. And you know, that was a very interesting week. I met many new friends, traveled, made few things that I shouldn’t tell about here, because of 25+ years restriction, and had much fun. Of course, I don’t say that you should live all your life like this. I’m saying, that you should always be open for something new, even if you think that it is stupid, not interesting etc. Just give it a try. Sixth. Always pay twice more.When people did something good, make something twice better for them. If people did something bad, return it to them multiplied by two. This will make good people love you, and bad people fear you. Seventh. Right decisions and then the law.Always do right things, no matter what is happening. Doing right things is much more important than you, your family, your friends, the law. No matter what happens after that. Sometimes the law can be the right decision, sometimes not, because there is nothing ideal in this world. But before you start thinking about breaking the law, you should learn it, understand it, and accept it. Cause breaking the rules is a big responsibility and should be done only when you are 200% sure. Life is pain. If not, then you are already dead. ", "title": "How to forge a man out of yourself. Story of my life.", "sentences": [{"acfb": "How to forge a man out of yourself. Story of my life."}, {"e80c": "Today I want to share with you few things that helped me become a better person than I was. It’s not some fast super-VIP method that will change you with one week, this will require from you much of work and pain."}, {"a6c1": "When I was a kid at age 10, I was very fearful and downtrodden, I feared of my parents, feared of people around me. I was helpless when problems come, and I fear them. I even feared to be late for school, and because of this was sleeping very bed, and looking at the watch for 10–20 times per night."}, {"e3dd": "I was wearing things that parents want me to wear, and not what I want. Cause I cant stand for my point of view in a dispute with them. And I was very weak physically."}, {"82a3": "And in some parallel world such person still lives, but thanks to the occasion, in my case, I found people that change my life. If I’m not mistaken it was at the age of 12. They taught me few simple but hard things, which you all know very well, but I bet never think about them."}, {"7267": "First. We’re all gonna die.Some of us today, some of us at the age of 100. And you must accept this, and stop fearing this. You need to understand that many things can be much worse than death. Seeing the pain of your family from day to day, not helping someone in a critical situation and living with that…"}, {"affc": "You will die, and nothing can stop this. But instead, you can choose when and how you die, and do this on your own rules."}, {"8570": "As an example, when terrorists take hostages, in most cases the number of hostages is much bigger than terrorists. And acting together, even being unarmed, they can win. But hostages always loose, ‘cause they fear death. And this fear kills them."}, {"13d8": "How I accept this?I’ve started making risky things and engaging in an extreme sports. Each day I moved my fear deeper and deeper in my soul. Then I got in few situations when I could fear death and in most cases would die, or I could risk and stay alive."}, {"be2a": "Second. Honor.Yeah, I know what you think. But if you look at another angle, honor is a set of your life principles which hurt you when you are trying to step over them."}, {"2747": "The main thing is that with each time when you step over your principle you step over yourself. ‘Cause this principle is you, your graphite core. And with each time some part of you dies. It’s like smoking, only that smoking will kill you, but broken principles will make your life miserable and you will beg for death."}, {"3270": "Of course, protection of one’s principles can lead to broken bones, smashed face and other not very pleasant things. But after a while, everything will heal, andthe broken principle will respond with pain in the heart for a very, very, very long time."}, {"2b72": "How I achieved this?I said to myself — stop. If I can’t stand for things in which I believe then why to live, what the point? After that, I was often beaten. But with each time I was feeling more and more like a winner and not a loser. They defeated me, but didn’t break."}, {"ac84": "Third. A lie is a key to progress.Let me describe you what I understand here by a lie. When you are an athlete there is a simple rule — push your limits up to 20% over your standard results. So if you are making a jump for 2 meters, then you start training to jump 2.4 meters."}, {"0674": "The same thing here. When you can do some job in a day, but instead say to people that will do it in a half of the day, this pushes you to get out of your comfort zone and work twice harder to fit in time and don’t lose your face. So you are lying about your possibilities, but this lie is pushing you to make more, faster and better. It pushes you to overcome your yesterday result, thus makes you better, step by step. And, what is even cooler, it cuts off the path for retreat."}, {"728b": "Why is this working?We all live in a society and for us, it’s very important what people say and think about us. Even if you think that it’s not important still it works. So when you commit something on public, it becomes a weapon against you if you don’t do what you promised."}, {"a357": "It is much simpler to be ugly and stupid when you live in the forest alone. But when you come to the city, where most of the people are good looking and smart, it becomes much harder."}, {"8beb": "Fourth. Comfort zone is what is killing more people than drugs, guns, and cancer.It’s normal to want to be in a comfort zone when you are 60, but when you are young and full of energy you should struggle every day, ‘cause “no pain, no gain”."}, {"dfde": "When the only reason for working on the current job is a fear of loosing it and your income — go and quit. Don’t wait for a new better job or winning a lottery. Your life is in your hands, and when you wait for something — you are killing yourself."}, {"5407": "Remember, that it is much better to risk and get nothing, then regret about lost opportunities."}, {"e0ad": "That’s one of the reasons why most of the beautiful girls at school are dating the strongest guys. That is not because they are strong, but because other guys think too much and fear of things that didn’t happen yet."}, {"a8ac": "Fifth. Say “Yes” to possibilities.There is a movie called “Yes Man” with Jim Carrey. At first sight, it seems to be an ordinary comedy, but looking a little deeper you will see that it is a really amazing thing. When I watched it, I though “what the hell, what I’m losing? Let’s try to live at least a week saying yes to anything.”. And you know, that was a very interesting week. I met many new friends, traveled, made few things that I shouldn’t tell about here, because of 25+ years restriction, and had much fun."}, {"196d": "Of course, I don’t say that you should live all your life like this. I’m saying, that you should always be open for something new, even if you think that it is stupid, not interesting etc. Just give it a try."}, {"7f59": "Sixth. Always pay twice more.When people did something good, make something twice better for them. If people did something bad, return it to them multiplied by two."}, {"f7e2": "This will make good people love you, and bad people fear you."}, {"f5da": "Seventh. Right decisions and then the law.Always do right things, no matter what is happening. Doing right things is much more important than you, your family, your friends, the law. No matter what happens after that."}, {"8b7d": "Sometimes the law can be the right decision, sometimes not, because there is nothing ideal in this world."}, {"023a": "But before you start thinking about breaking the law, you should learn it, understand it, and accept it. Cause breaking the rules is a big responsibility and should be done only when you are 200% sure."}, {"7c93": "Life is pain. If not, then you are already dead."}], "child": "837_1\t837_2837_1\t837_2"}