{"name": "838", "parent": "", "content": "Ways to Inspire Your Co-Workers One Sticky Note at a Time Sticky notes are one of thework world’s best inventions. Come on, admit it — you have a thing for them, too. Aside from being a really fun way to jot down ideas, did you know that they can be a highly useful tool in keeping you focused on the positive? A team member always leaves a sticky note on her computer monitor at the end of the day. I finally asked her why, and she told me that it’s a reminder to her in the morning of a goal she met the day before. A little boost first thing. I started doing this and you know what? It actually works. It can be easy to get bogged down in everything that needs to be done, making it difficult to see what has already been accomplished. Give it a try — you can even place it on your bathroom mirror or on your car’s dashboard. You’ll begin to look forward to seeing that bright little square of positivity every morning! ", "title": "Ways to Inspire Your Co-Workers", "sentences": [{"d7c1": "Ways to Inspire Your Co-Workers"}, {"c632": "One Sticky Note at a Time"}, {"1320": "Sticky notes are one of thework world’s best inventions. Come on, admit it — you have a thing for them, too. Aside from being a really fun way to jot down ideas, did you know that they can be a highly useful tool in keeping you focused on the positive?"}, {"7b28": "A team member always leaves a sticky note on her computer monitor at the end of the day. I finally asked her why, and she told me that it’s a reminder to her in the morning of a goal she met the day before. A little boost first thing. I started doing this and you know what? It actually works."}, {"6760": "It can be easy to get bogged down in everything that needs to be done, making it difficult to see what has already been accomplished. Give it a try — you can even place it on your bathroom mirror or on your car’s dashboard. You’ll begin to look forward to seeing that bright little square of positivity every morning!"}], "child": "838_1"}