{"name": "84", "parent": "", "content": "Featured Ron Baker, S.W.D. Embrace the Wichita St. product, heir to Matthew Dellavedova Photo: Bailey Carlin/TKW Illustration “He’s made of steel. He gives us everything until the tank is empty and he’s got a little reserve.” That quote is from LeBron James, in reference to a scrappy, white combo-guard filling in for Kyrie Irving on basketball’s biggest stage — the NBA Finals. With the series tied 1–1, Scrappy White Dude dropped 20 points against the Golden State Warriors and locked down America’s Most Wanted shooter Stephen Curry. After the game, S.W.D. was rushed straight to the hospital for severe exhaustion and dehydration. This was a real CBS News headline: Cavaliers guard Matthew Dellavedova played so hard he literally put himself in the hospital, and was taken by ambulance for more treatment after the Cavaliers’ Game 3 victory. via The Knicks Wall/SoundCloud Ron Baker, an undrafted rookie out of Kansas, is a also a S.W.D., and a very good one. He could be a rich man’s Delly for New York. Here’s what he brings to the Knicks: Defense Baker’s defensive awareness is okay. When defending ball-handlers, he has a tendency to tunnel in on his man, leaving him vulnerable to mazes of screens he doesn’t see coming until a half-second too late. Baker earns a steal against, who else, Matthew Dellavedova (Credit: The Knicks Channel/YouTube) He makes up for it with textbook defensive stance, and with good lateral movement around screens. You’ll never see Baker get smushed by a pick like Damian Lillard, for example. Although he’s easily blindsided and allows himself to get beat initially, Baker recovers like a bloodhound. He picks up the scent and runs full sprint to erase his mistake. Off the ball, Baker is a lot cleaner. He positions himself well and understands match-up specificities, shading toward shooters and leaving bricklayers on an island. He’s a capable help defender, and keeps his head up, ready to use turnovers to create fast breaks. Lineup Flexibility Baker has recently shown he can play either backcourt position. Like Dellavedova, Baker can run the pick-and-roll in its most basic form without turning the ball over, and just having a safe, emergency option to run an offense through is invaluable. Delly bailed the Cavaliers out in the Finals on multiple possessions, by virtue of simply avoiding blunders when the Warriors keyed in on LeBron. Baker/Dellavedova types can’t carry an offense, but they can keep it afloat. via Down To Buck/YouTube, GIF by Reid Goldsmith While Baker can play point guard for brief stretches, his bread and butter is supposed to be his shooting. His collegiate career at Wichita State was built around his catch-and-shoot ability, but he’ll have to prove he’s a threat in the pros. He’s shooting just 43.4 percent overall, 27.3 percent from three, and 65.9 percent from the line (courtesy of Basketball-Reference). However, his versatility at both backcourt positions unlocks a lot of handy lineups. Want to go small? Put Baker at shooting guard in perimeter-heavy situations. Want to go big? Baker’s got legitimate size for a point guard. None of those scenarios would work if Baker couldn’t guard both guard types, but he can and does so at a decent level. If he can get his shot in order, he becomes an extremely valuable commodity in today’s NBA — a low-usage, jack-of-all-trades combo guard. Every team needs superstars, sure, but they also need the little cogs that fit in between those stars. Photo: Phelan M. Ebenhack/AP Contagious Energy (WARNING: “intangibles” discussion alert) When I was in high school, my friend Ben had a game similar to Baker’s/Dellavedova’s. He could do three things on a basketball court: And it didn’t matter that virtually everyone we played against was more talented than him. Ben earned his way onto the court by embracing his Scrappy White Dude. He wore a mouthguard, set hard screens despite weighing barely 150 pounds, and always found a way to piss the other team off without saying a word. His varsity career reached its apex one night against our arch-rival, SAS. With just a few seconds left in the first half, one of our bigs inbounded the ball to Ben from our baseline, and he rocketed up the floor at the max speed of a semi-professional power walker. “No!” Coach screamed, but it was too late. Ben rose up in his inimitable “shooting motion,” and as the buzzer blared the ball hung in the air like the constipated pause of an actor that forgot his lines. The shot banked in, because of course it did, and Ben, along with all seven of our fans perched in the bleachers, roared — ugly and guttural. For a brief moment, we were all Scrappy White Dudes, drumming our chests not out of bravado, but primal instinct. Ben transformed us into S.W.D.’s and we won the game off that energy. Every NBA team needs a Ben, the “I’m here to fuck shit up” type of player. via GIPHY There’s a constant demand for them that will never be satisfied. It’s why Kendrick Perkins hung around long after anybody needed him to defend Dwight Howard. It’s why Udonis Haslem kept making obscene amounts of money in Miami. It’s why Pat Beverley is so important to the Rockets. Of course, first priority when constructing a roster will always be to get stars, guys that can singlehandedly alter the fate of a basketball game. Great teams, however, always prioritize the Fuck Shit Up Guys right after, because they can singlehandedly alter the attitude of a basketball game. (By the way, some teams get real lucky, and their stars are also their Fuck Shit Up Guys, e.g., Russell Westbrook, Draymond Green) Scrappy White Dude is a sub-genre of Fuck Shit Up Guy, but forget the nomenclature. My point is that there aren’t a lot of players that dictate the attitude of games, and that’s the exact function of F.S.U.G. Off the top of my head, there’s maybe 20 in the league, and Ron Baker is one of them. That’s all fine, you say, but when a team is tied 1–1 in the Finals, does all this really matter? Can a bit role player really have an impact when everything is on the line and rotations shorten to seven or eight players? via Free Dawkins/YouTube, GIF by Reid Goldsmith It does, and here’s why. There comes a point in the playoffs where the eventual champion wins a game they shouldn’t, when their stars have gone cold and they need something, from someone…else. It happens every year without fail. Steph Curry and Klay Thompson go a combined 4-of-20 from beyond the arc, or Kyrie Irving breaks his knee, or Russell Westbrook commits 80 turnovers in the second quarter, and all of a sudden an invincible contender is short a badass. I can count on one finger the number of players I’ve seen “play so hard he literally put himself in the hospital.” When everything blows up for a team — and it always does at some point in the postseason — it’s imperative to have a F.S.U.G. who’s at home amidst the rubble. The Cavs didn’t win that Finals, but Dellavedova scrapped until he could scrap no more. Ron Baker is not Game 3 Dellavedova, yet. But one day he could be, and I mean that in the best way possible. — Harrison Liao, site writer Follow The Knicks Wall on Facebook and Twitter, and listen to the TKW Podcast on SoundCloud! ", "title": "Ron Baker, S.W.D.", "sentences": [{"ee8c": "Featured"}, {"0feb": "Ron Baker, S.W.D."}, {"0ea4": "Embrace the Wichita St. product, heir to Matthew Dellavedova"}, {"3eec": "Photo: Bailey Carlin/TKW Illustration"}, {"1264": "“He’s made of steel. He gives us everything until the tank is empty and he’s got a little reserve.”"}, {"6a30": "That quote is from LeBron James, in reference to a scrappy, white combo-guard filling in for Kyrie Irving on basketball’s biggest stage — the NBA Finals. With the series tied 1–1, Scrappy White Dude dropped 20 points against the Golden State Warriors and locked down America’s Most Wanted shooter Stephen Curry. After the game, S.W.D. was rushed straight to the hospital for severe exhaustion and dehydration. This was a real CBS News headline:"}, {"5266": "Cavaliers guard Matthew Dellavedova played so hard he literally put himself in the hospital, and was taken by ambulance for more treatment after the Cavaliers’ Game 3 victory."}, {"d92e": "via The Knicks Wall/SoundCloud"}, {"e785": "Ron Baker, an undrafted rookie out of Kansas, is a also a S.W.D., and a very good one. He could be a rich man’s Delly for New York."}, {"4737": "Here’s what he brings to the Knicks:"}, {"784f": "Defense"}, {"f2c3": "Baker’s defensive awareness is okay. When defending ball-handlers, he has a tendency to tunnel in on his man, leaving him vulnerable to mazes of screens he doesn’t see coming until a half-second too late."}, {"fbce": "Baker earns a steal against, who else, Matthew Dellavedova (Credit: The Knicks Channel/YouTube)"}, {"a42d": "He makes up for it with textbook defensive stance, and with good lateral movement around screens. You’ll never see Baker get smushed by a pick like Damian Lillard, for example. Although he’s easily blindsided and allows himself to get beat initially, Baker recovers like a bloodhound. He picks up the scent and runs full sprint to erase his mistake."}, {"7416": "Off the ball, Baker is a lot cleaner. He positions himself well and understands match-up specificities, shading toward shooters and leaving bricklayers on an island. He’s a capable help defender, and keeps his head up, ready to use turnovers to create fast breaks."}, {"a9ec": "Lineup Flexibility"}, {"1687": "Baker has recently shown he can play either backcourt position. Like Dellavedova, Baker can run the pick-and-roll in its most basic form without turning the ball over, and just having a safe, emergency option to run an offense through is invaluable. Delly bailed the Cavaliers out in the Finals on multiple possessions, by virtue of simply avoiding blunders when the Warriors keyed in on LeBron. Baker/Dellavedova types can’t carry an offense, but they can keep it afloat."}, {"95eb": "via Down To Buck/YouTube, GIF by Reid Goldsmith"}, {"caa5": "While Baker can play point guard for brief stretches, his bread and butter is supposed to be his shooting. His collegiate career at Wichita State was built around his catch-and-shoot ability, but he’ll have to prove he’s a threat in the pros. He’s shooting just 43.4 percent overall, 27.3 percent from three, and 65.9 percent from the line (courtesy of Basketball-Reference)."}, {"a22a": "However, his versatility at both backcourt positions unlocks a lot of handy lineups. Want to go small? Put Baker at shooting guard in perimeter-heavy situations. Want to go big? Baker’s got legitimate size for a point guard. None of those scenarios would work if Baker couldn’t guard both guard types, but he can and does so at a decent level. If he can get his shot in order, he becomes an extremely valuable commodity in today’s NBA — a low-usage, jack-of-all-trades combo guard."}, {"a495": "Every team needs superstars, sure, but they also need the little cogs that fit in between those stars."}, {"44ec": "Photo: Phelan M. Ebenhack/AP"}, {"5daa": "Contagious Energy"}, {"ccb7": "(WARNING: “intangibles” discussion alert)"}, {"b4e4": "When I was in high school, my friend Ben had a game similar to Baker’s/Dellavedova’s. He could do three things on a basketball court:"}, {"c7ea": "And it didn’t matter that virtually everyone we played against was more talented than him. Ben earned his way onto the court by embracing his Scrappy White Dude. He wore a mouthguard, set hard screens despite weighing barely 150 pounds, and always found a way to piss the other team off without saying a word. His varsity career reached its apex one night against our arch-rival, SAS. With just a few seconds left in the first half, one of our bigs inbounded the ball to Ben from our baseline, and he rocketed up the floor at the max speed of a semi-professional power walker. “No!” Coach screamed, but it was too late. Ben rose up in his inimitable “shooting motion,” and as the buzzer blared the ball hung in the air like the constipated pause of an actor that forgot his lines. The shot banked in, because of course it did, and Ben, along with all seven of our fans perched in the bleachers, roared — ugly and guttural. For a brief moment, we were all Scrappy White Dudes, drumming our chests not out of bravado, but primal instinct. Ben transformed us into S.W.D.’s and we won the game off that energy."}, {"ab77": "Every NBA team needs a Ben, the “I’m here to fuck shit up” type of player."}, {"ad74": "via GIPHY"}, {"7ca7": "There’s a constant demand for them that will never be satisfied. It’s why Kendrick Perkins hung around long after anybody needed him to defend Dwight Howard. It’s why Udonis Haslem kept making obscene amounts of money in Miami. It’s why Pat Beverley is so important to the Rockets."}, {"d58c": "Of course, first priority when constructing a roster will always be to get stars, guys that can singlehandedly alter the fate of a basketball game. Great teams, however, always prioritize the Fuck Shit Up Guys right after, because they can singlehandedly alter the attitude of a basketball game."}, {"64c4": "(By the way, some teams get real lucky, and their stars are also their Fuck Shit Up Guys, e.g., Russell Westbrook, Draymond Green)"}, {"6ef7": "Scrappy White Dude is a sub-genre of Fuck Shit Up Guy, but forget the nomenclature. My point is that there aren’t a lot of players that dictate the attitude of games, and that’s the exact function of F.S.U.G. Off the top of my head, there’s maybe 20 in the league, and Ron Baker is one of them."}, {"5a47": "That’s all fine, you say, but when a team is tied 1–1 in the Finals, does all this really matter? Can a bit role player really have an impact when everything is on the line and rotations shorten to seven or eight players?"}, {"1b44": "via Free Dawkins/YouTube, GIF by Reid Goldsmith"}, {"09c4": "It does, and here’s why. There comes a point in the playoffs where the eventual champion wins a game they shouldn’t, when their stars have gone cold and they need something, from someone…else. It happens every year without fail. Steph Curry and Klay Thompson go a combined 4-of-20 from beyond the arc, or Kyrie Irving breaks his knee, or Russell Westbrook commits 80 turnovers in the second quarter, and all of a sudden an invincible contender is short a badass."}, {"71ec": "I can count on one finger the number of players I’ve seen “play so hard he literally put himself in the hospital.” When everything blows up for a team — and it always does at some point in the postseason — it’s imperative to have a F.S.U.G. who’s at home amidst the rubble. The Cavs didn’t win that Finals, but Dellavedova scrapped until he could scrap no more. Ron Baker is not Game 3 Dellavedova, yet. But one day he could be, and I mean that in the best way possible."}, {"931b": "— Harrison Liao, site writer"}, {"9d33": "Follow The Knicks Wall on Facebook and Twitter, and listen to the TKW Podcast on SoundCloud!"}], "child": "84_1\t84_284_1\t84_2"}