{"content": "Netflix Brings Three Tales of Crime and Punishment to SXSW 2017 Check out the first teasers for ‘Small Crimes,’ ‘Win It All,’ and ‘The Most Hated Woman in America.’ Netflix has been making exciting strides in their effort to rule the world of streaming entertainment, and most recent among them has been declaring themselves to be a strong presence in the world of film festivals. They made waves at Sundance by acquiring several high profile titles, and now they’re debuting three features at this month’s SXSW that they’ve already laid claim to. Check out the first trailers for Evan Katz’s Small Crimes, Joe Swanberg’s Win It All, and the Madalyn Murray O’Hair true-crime pic, The Most Hated Woman in America. “After serving time for the attempted murder of a District Attorney, disgraced former cop Joe Denton (Nikolaj Coster-Waldau) returns home looking for redemption. An embarrassment to his parents and abandoned by his ex-wife, it seems as if things can’t get much worse. But then Joe finds himself trapped in the mess he left behind-in the cross fire between a crooked sheriff, the vengeful DA, and a mafia kingpin who knows too much.” Writer/director Evan Katz’s Cheap Thrills is a darkly funny, wickedly cruel little film that marked him as a filmmaker to watch, and now he’s finally ready to unleash his sophomore effort. His latest looks to once again focus on a man whose down and out nature leaves him vulnerable to the less savory whims of others resulting in violence and perverse thrills. Katz has also pulled together another stellar cast including Nikolaj Coster-Waldau (Oblivion), Macon Blair (Murder Party), Robert Forster (Alligator), Gary Cole (The Town That Dreaded Sundown), Jacki Weaver (Animal Kingdom), Larry Fessenden (We Are Still Here), and Cheap Thrills’ Pat Healy. Small Crimes premiers at SXSW on March 11th and releases worldwide on Netflix on April 28th. “Jake Johnson (New Girl) stars as small time gambler Eddie Garrett, who agrees to watch a duffel bag for an acquaintance who is heading to prison. When he discovers cash in the bag, he’s unable to resist the temptation and winds up deeply in debt. When the prison release is shortened, Eddie suddenly has a small window of time to win all the money back.” Director Joe Swanberg’s last two collaborations with Jake Johnson, Drinking Buddies and Digging for Fire, are both smart, funny, honest explorations of people living the ups and downs of life. Their latest team-up seems a bit more plot-oriented, but their interest in the emotional lives of their characters appears to be intact. Johnson is joined onscreen by Keegan-Michael Key (Tomorrowland) and Jo Lo Truglio (Wet Hot American Summer) for this look at the mistakes in our lives that some of us can’t stop making. Win It All premiers at SXSW on March 11th and releases worldwide on Netflix on April 7th. “A true-crime biopic about the disappearance of Madalyn Murray O’Hair, founder of the “American Atheists” and pioneering firebrand in the political culture war, The Most Hated Woman in America captures the rise and fall of a complex character who was a controversial villain to some and an unlikely hero to others.” No one expects their life to end as a true crime mystery, but I imagine Madalyn Murray O’Hair wasn’t all that surprised to be the victim of violence. She angered millions with her push for both atheism in general and the removal of school prayer in particular, and then decades later appeared to pay a price. She always struck me as similar to PETA as representing a cause I believe in but doing so in the most aggressive way possible. Melissa Leo (Deadtime Stories) brings O’Hair to life here across the years, and she’s joined by a terrifically eclectic cast including Adam Scott (Krampus), Juno Temple (Killer Joe), Josh Lucas (Sweet Home Alabama), Vincent Kartheiser (Rango), Rory Cochrane (Empire Records), and Peter Fonda (Race With the Devil). The Most Hated Woman in America premiers at SXSW on March 14th and releases worldwide on Netflix on March 24th. ", "child": "84_1\t84_284_1\t84_284_1\t84_284_1\t84_2", "title": "Netflix Brings Three Tales of Crime and Punishment to SXSW 2017", "parent": "", "sentences": [{"773b": "Netflix Brings Three Tales of Crime and Punishment to SXSW 2017"}, {"2fd3": "Check out the first teasers for ‘Small Crimes,’ ‘Win It All,’ and ‘The Most Hated Woman in America.’"}, {"ffb5": "Netflix has been making exciting strides in their effort to rule the world of streaming entertainment, and most recent among them has been declaring themselves to be a strong presence in the world of film festivals. They made waves at Sundance by acquiring several high profile titles, and now they’re debuting three features at this month’s SXSW that they’ve already laid claim to."}, {"b02c": "Check out the first trailers for Evan Katz’s Small Crimes, Joe Swanberg’s Win It All, and the Madalyn Murray O’Hair true-crime pic, The Most Hated Woman in America."}, {"1f34": "“After serving time for the attempted murder of a District Attorney, disgraced former cop Joe Denton (Nikolaj Coster-Waldau) returns home looking for redemption. An embarrassment to his parents and abandoned by his ex-wife, it seems as if things can’t get much worse. But then Joe finds himself trapped in the mess he left behind-in the cross fire between a crooked sheriff, the vengeful DA, and a mafia kingpin who knows too much.”"}, {"2485": "Writer/director Evan Katz’s Cheap Thrills is a darkly funny, wickedly cruel little film that marked him as a filmmaker to watch, and now he’s finally ready to unleash his sophomore effort. His latest looks to once again focus on a man whose down and out nature leaves him vulnerable to the less savory whims of others resulting in violence and perverse thrills. Katz has also pulled together another stellar cast including Nikolaj Coster-Waldau (Oblivion), Macon Blair (Murder Party), Robert Forster (Alligator), Gary Cole (The Town That Dreaded Sundown), Jacki Weaver (Animal Kingdom), Larry Fessenden (We Are Still Here), and Cheap Thrills’ Pat Healy."}, {"b634": "Small Crimes premiers at SXSW on March 11th and releases worldwide on Netflix on April 28th."}, {"1e61": "“Jake Johnson (New Girl) stars as small time gambler Eddie Garrett, who agrees to watch a duffel bag for an acquaintance who is heading to prison. When he discovers cash in the bag, he’s unable to resist the temptation and winds up deeply in debt. When the prison release is shortened, Eddie suddenly has a small window of time to win all the money back.”"}, {"5e57": "Director Joe Swanberg’s last two collaborations with Jake Johnson, Drinking Buddies and Digging for Fire, are both smart, funny, honest explorations of people living the ups and downs of life. Their latest team-up seems a bit more plot-oriented, but their interest in the emotional lives of their characters appears to be intact. Johnson is joined onscreen by Keegan-Michael Key (Tomorrowland) and Jo Lo Truglio (Wet Hot American Summer) for this look at the mistakes in our lives that some of us can’t stop making."}, {"37f1": "Win It All premiers at SXSW on March 11th and releases worldwide on Netflix on April 7th."}, {"917c": "“A true-crime biopic about the disappearance of Madalyn Murray O’Hair, founder of the “American Atheists” and pioneering firebrand in the political culture war, The Most Hated Woman in America captures the rise and fall of a complex character who was a controversial villain to some and an unlikely hero to others.”"}, {"1bba": "No one expects their life to end as a true crime mystery, but I imagine Madalyn Murray O’Hair wasn’t all that surprised to be the victim of violence. She angered millions with her push for both atheism in general and the removal of school prayer in particular, and then decades later appeared to pay a price. She always struck me as similar to PETA as representing a cause I believe in but doing so in the most aggressive way possible. Melissa Leo (Deadtime Stories) brings O’Hair to life here across the years, and she’s joined by a terrifically eclectic cast including Adam Scott (Krampus), Juno Temple (Killer Joe), Josh Lucas (Sweet Home Alabama), Vincent Kartheiser (Rango), Rory Cochrane (Empire Records), and Peter Fonda (Race With the Devil)."}, {"a899": "The Most Hated Woman in America premiers at SXSW on March 14th and releases worldwide on Netflix on March 24th."}], "name": "84"}