{"name": "840", "parent": "", "content": "Mean Boys & Girls at Work There are a lot of things I thought would be left behind the moment I stepped off the stage at high school graduation — acne, low self-esteem, bad cafeteria food and cliques. Honestly, the only one that disappeared as soon as I entered adulthood was the cafeteria food (only to be replaced by copious quantities of pizza), and some of them became even more pronounced. Now in my forties, most of these things have gone by the wayside — my skin’s settled down, I don’t suffer from crippling self-esteem issues anymore, and I eat clean, healthy foods. The one that hasn’t seemed to abate over the last two-plus decades is the clique. This is why I used the word “ladies” above. We’re talking about adults — not the girls and boys of high school. Part of the Pack I understand wanting to be amongst people that have similar interests, backgrounds, or whatever might bring them together. It’s normal and healthy human behavior. What I don’t abide by is the bizarre pack mentality that seems to come with certain cliques, whether in social or work situations. What’s even stranger is when a group feels it necessary to alienate, single out or even full-out attack an individual that doesn’t fit their pre-conceived notions of “acceptable”. Much of the work bullying I see is due to attacks waged by two or more people ganging up on a co-worker. I’m talking about grown-ass adults. Many of these people go home at night to families; they correct their children when they use terms that are considered un-PC; they rant about the unfairness of the “lady tax” or gender discrepancy in wages. Then they return to work the next morning and resume their reign of terror. Just Don’t It’s tempting to be part of the “in” group, but is it worth compromising one’s integrity to be part of the “in” group? I’m not so sure that acceptance that has the hefty price tag of exclusion attached is a good investment of time and energy. The scrutiny and embarrassment this sort of behavior inflicts on the victims is just as hurtful — if not more so — than that experienced in youth. Instead, let’s try to embrace those that don’t fit into the narrow-minded parameters of clique members. Haven’t you heard? Tolerance and acceptance are the new cool. ", "title": "Mean Boys & Girls at Work", "sentences": [{"a928": "Mean Boys & Girls at Work"}, {"f6b6": "There are a lot of things I thought would be left behind the moment I stepped off the stage at high school graduation — acne, low self-esteem, bad cafeteria food and cliques. Honestly, the only one that disappeared as soon as I entered adulthood was the cafeteria food (only to be replaced by copious quantities of pizza), and some of them became even more pronounced."}, {"dbbc": "Now in my forties, most of these things have gone by the wayside — my skin’s settled down, I don’t suffer from crippling self-esteem issues anymore, and I eat clean, healthy foods. The one that hasn’t seemed to abate over the last two-plus decades is the clique. This is why I used the word “ladies” above. We’re talking about adults — not the girls and boys of high school."}, {"3c55": "Part of the Pack"}, {"2289": "I understand wanting to be amongst people that have similar interests, backgrounds, or whatever might bring them together. It’s normal and healthy human behavior. What I don’t abide by is the bizarre pack mentality that seems to come with certain cliques, whether in social or work situations. What’s even stranger is when a group feels it necessary to alienate, single out or even full-out attack an individual that doesn’t fit their pre-conceived notions of “acceptable”."}, {"c1cf": "Much of the work bullying I see is due to attacks waged by two or more people ganging up on a co-worker. I’m talking about grown-ass adults. Many of these people go home at night to families; they correct their children when they use terms that are considered un-PC; they rant about the unfairness of the “lady tax” or gender discrepancy in wages. Then they return to work the next morning and resume their reign of terror."}, {"b7b2": "Just Don’t"}, {"4137": "It’s tempting to be part of the “in” group, but is it worth compromising one’s integrity to be part of the “in” group? I’m not so sure that acceptance that has the hefty price tag of exclusion attached is a good investment of time and energy. The scrutiny and embarrassment this sort of behavior inflicts on the victims is just as hurtful — if not more so — than that experienced in youth."}, {"4c7e": "Instead, let’s try to embrace those that don’t fit into the narrow-minded parameters of clique members. Haven’t you heard? Tolerance and acceptance are the new cool."}], "child": "840_1"}