{"name": "844", "parent": "", "content": "https://barbaraschwarz.files.wordpress.com/2014/03/pot-kettle-black.jpg Pot=Kettle, both are black This, my friends, is a cautionary tale about karma and how it will come around and kick your ass when you least expect it. So, as you all know, I lost my job. I was called out of a staff meeting, taken to my classroom and told to go to the district office, tomorrow. Do not come to school before or after the meeting. Do not pass GO. Do not collect $200. As I sat there staring, my grade level team came in to see what was up. I had left all of my belongings in the library and they were bringing them to me. When I saw them, I instantly burst into tears. I didn’t know what was up, but I knew that it could not be good. My fear is that I was being fired immediately. They were all very supportive. They promised to be there for me and help me in any way that they could. In fact, one even prayed over me. After I found out that I had not been picked to continue at the school district, I asked two of them to write me letters of recommendation. “Of course,” I was told. Four weeks after officially asking them, I got a text from the one that prayed over me. “I can’t write your letter, I’ve overextended myself. Hope you asked other people.” I don’t think you can even come close to naming all of the snarky God comments that I wanted to text back. I even typed out a couple. But I deleted. I mean, how do I know that she didn’t pray about it and God told her not to help me? I can’t be that great. I’ve asked Santa for a snowboard for six years now and I am still waiting. I never make the nice list :( As I was up on my high horse thinking about how I was a person of my word and how much I value integrity, I remembered something. I have written about someone in my articles that asked me in January to not ever write about him again. In the heat of the moment, like a child being caught doing something bad, I said, “I promise!!!” And I’m sure at the time, that I meant it. But after he said, “These are the last words that you will ever hear me say,” I kind of decided that it didn’t matter. He was gone, so I could write about anything I wanted. Besides, I only said it to get me out of trouble. Yeah….and then he popped up again in February. And I had that drunken night when I wrote a story that was not technically about him, but it was like one side of a conversation, me talking to him. When you are really drunk, everything seems like a good idea. Including sending articles to people that you promised never to write about. It took about three days until he lowered the boom. The timing was perfect on his part. I had texted him that I had some questions. He texted back, “I have one for you. Why did you write about me when you promised me that you wouldn’t?” Then everything went dark and the spotlight of truth was upon me and I was sweating, people! I tried to get off on a technicality. “It wasn’t really about you, it was about me talking to you. “Sorry if you misunderstood my intent.” His response, “Sorry you misunderstood my intent for you not to write about me.” Then he called my stories, creepy and said, “Do what you want.” He’s gone for good this time. And who can blame him? So, what did I learn? You can’t break a promise and then get mad when someone breaks a promise to you. Karma. We always want it to work when it is against someone else. I don’t think anyone ever says, “Karma, bring it on!” when talking about themselves. Unless you happen to be on Santa’s nice list. And if you are, can you PLEASE ask for a snowboard for me? I mean well. Most of the time : ) ", "title": "Pot=Kettle, both are black", "sentences": [{"0ff6": "https://barbaraschwarz.files.wordpress.com/2014/03/pot-kettle-black.jpg"}, {"1fea": "Pot=Kettle, both are black"}, {"1b8d": "This, my friends, is a cautionary tale about karma and how it will come around and kick your ass when you least expect it."}, {"0aa8": "So, as you all know, I lost my job. I was called out of a staff meeting, taken to my classroom and told to go to the district office, tomorrow. Do not come to school before or after the meeting. Do not pass GO. Do not collect $200."}, {"604b": "As I sat there staring, my grade level team came in to see what was up. I had left all of my belongings in the library and they were bringing them to me. When I saw them, I instantly burst into tears. I didn’t know what was up, but I knew that it could not be good. My fear is that I was being fired immediately. They were all very supportive. They promised to be there for me and help me in any way that they could. In fact, one even prayed over me."}, {"9224": "After I found out that I had not been picked to continue at the school district, I asked two of them to write me letters of recommendation. “Of course,” I was told. Four weeks after officially asking them, I got a text from the one that prayed over me. “I can’t write your letter, I’ve overextended myself. Hope you asked other people.”"}, {"8e18": "I don’t think you can even come close to naming all of the snarky God comments that I wanted to text back. I even typed out a couple. But I deleted. I mean, how do I know that she didn’t pray about it and God told her not to help me? I can’t be that great. I’ve asked Santa for a snowboard for six years now and I am still waiting. I never make the nice list :("}, {"e730": "As I was up on my high horse thinking about how I was a person of my word and how much I value integrity, I remembered something. I have written about someone in my articles that asked me in January to not ever write about him again. In the heat of the moment, like a child being caught doing something bad, I said, “I promise!!!” And I’m sure at the time, that I meant it. But after he said, “These are the last words that you will ever hear me say,” I kind of decided that it didn’t matter. He was gone, so I could write about anything I wanted. Besides, I only said it to get me out of trouble."}, {"1571": "Yeah….and then he popped up again in February. And I had that drunken night when I wrote a story that was not technically about him, but it was like one side of a conversation, me talking to him. When you are really drunk, everything seems like a good idea. Including sending articles to people that you promised never to write about. It took about three days until he lowered the boom. The timing was perfect on his part."}, {"73a6": "I had texted him that I had some questions. He texted back, “I have one for you. Why did you write about me when you promised me that you wouldn’t?” Then everything went dark and the spotlight of truth was upon me and I was sweating, people! I tried to get off on a technicality. “It wasn’t really about you, it was about me talking to you. “Sorry if you misunderstood my intent.” His response, “Sorry you misunderstood my intent for you not to write about me.” Then he called my stories, creepy and said, “Do what you want.” He’s gone for good this time. And who can blame him?"}, {"08aa": "So, what did I learn? You can’t break a promise and then get mad when someone breaks a promise to you. Karma. We always want it to work when it is against someone else. I don’t think anyone ever says, “Karma, bring it on!” when talking about themselves. Unless you happen to be on Santa’s nice list. And if you are, can you PLEASE ask for a snowboard for me? I mean well. Most of the time : )"}], "child": "844_1\t844_2\t844_3\t844_4\t844_5\t844_6\t844_7\t844_8\t844_9"}