{"name": "846", "parent": "", "content": "What I learned from my 28 days of Productivity Challenge At the end of January, I was unhappy with my productivity. So I decide to apply some public commitment in my life. I started a challenge of 28 days of super productivity. So I define the following objectives:1. I will write one post per day on medium. Each post topic will be related personal development, productivity, life balance, etc. I will also share what I did during the day and how I’m improving my business.2. I will get 25 new clients to use my services and I will tell you how I’m doing it during the process.3. I will wake up early (6:00 AM)4. I will always create a schedule for the next day so I have a clear vision that what I need to do. 5. I will walk/run 150km this month(93.2 miles)6. Define an hour to get off the computer during the week. 8:00PM7. Become super productive This is what I accomplished 1. ✔ Write one article a day Well, I will not tell you this was an easy task. But was a surprise since I don’t expect to be able to write so much in English. I publish 26 articles in 28 days. So I fail 2 days. I can count as a win.The prize was becoming a Top Writer on Productivity tag. YEAHHH :D 2. ✘ I will get 25 new clients to use my services and I will tell you how I’m doing it during the process. I Create a tool to promote my services faster than ever and I create a database of 100k companies of my country and couple million companies I will start promotion Monday. With this tool, I can contact 1,5k companies per week with just 10 hours of work. 3. ✘ Wake up at 6 AM On this topic, I have to admit I failed. I wake up 11 times in 28 days.I really have to change that. Because when I wake up at 6 AM I felt really productive. The felling of have 2 or 3 tasks done before 9 AM it’s indescribable. 4. ✔ I will always create a schedule for the next day so I have a clear vision that what I need to do. Every single day at night I used my calendar to define my next day. This was a pretty simple task to do. I create a reminder on my cell phone at 9 PM every day. 15 minutes was enough to do it. 5. ✔ I will walk/run 150km this month(93.2 miles) Ohh yeah, baby! this one was a piece of cake. I did 215km (133 miles) in 28 days. I use Mi Band to track my steps and my runs. I define an objective of 8000 steps per day. I was able to achieve this objective 24 days in a row. Check my stats: 6. ✘ Define an hour to get off the computer during the week. 8:00PM I fail… I believe was one of the reasons I don’t wake up early. I was on the computer from 6 AM to 10 PM. At least I understand I have a problem here so I have to work on it. 7. ✔ Become super productive Here I felt a big improvement boosted by the days I wake up early, by exercise and by planning everything the day before. This software is called RescueTime. January As you can see I did 146h 49m of productive time and my productivity score was 39%. Super February On February I Did 177h 51m and productivity score of 51%. That’s a 30% improvement. So I don’t double my productivity but was a big improvement. This stats don’t count 52h 10m of Gmail, calendar, as productive. So I have another 40 to 50 hours that I can more productive. So my final thoughts about this experiment are: Make sure you fall in love the process If you like this article don’t forget to ❤ ", "title": "What I learned from my 28 days of Productivity Challenge", "sentences": [{"18d5": "What I learned from my 28 days of Productivity Challenge"}, {"09ff": "At the end of January, I was unhappy with my productivity. So I decide to apply some public commitment in my life. I started a challenge of 28 days of super productivity."}, {"ae98": "So I define the following objectives:1. I will write one post per day on medium. Each post topic will be related personal development, productivity, life balance, etc. I will also share what I did during the day and how I’m improving my business.2. I will get 25 new clients to use my services and I will tell you how I’m doing it during the process.3. I will wake up early (6:00 AM)4. I will always create a schedule for the next day so I have a clear vision that what I need to do. 5. I will walk/run 150km this month(93.2 miles)6. Define an hour to get off the computer during the week. 8:00PM7. Become super productive"}, {"6e64": "This is what I accomplished"}, {"550f": "1. ✔ Write one article a day"}, {"4038": "Well, I will not tell you this was an easy task. But was a surprise since I don’t expect to be able to write so much in English. I publish 26 articles in 28 days. So I fail 2 days. I can count as a win.The prize was becoming a Top Writer on Productivity tag."}, {"d140": "YEAHHH :D"}, {"7f4a": "2. ✘ I will get 25 new clients to use my services and I will tell you how I’m doing it during the process."}, {"710c": "I Create a tool to promote my services faster than ever and I create a database of 100k companies of my country and couple million companies I will start promotion Monday. With this tool, I can contact 1,5k companies per week with just 10 hours of work."}, {"f008": "3. ✘ Wake up at 6 AM"}, {"22af": "On this topic, I have to admit I failed. I wake up 11 times in 28 days.I really have to change that. Because when I wake up at 6 AM I felt really productive. The felling of have 2 or 3 tasks done before 9 AM it’s indescribable."}, {"c971": "4. ✔ I will always create a schedule for the next day so I have a clear vision that what I need to do."}, {"907c": "Every single day at night I used my calendar to define my next day. This was a pretty simple task to do. I create a reminder on my cell phone at 9 PM every day. 15 minutes was enough to do it."}, {"ec18": "5. ✔ I will walk/run 150km this month(93.2 miles)"}, {"3bc2": "Ohh yeah, baby! this one was a piece of cake. I did 215km (133 miles) in 28 days. I use Mi Band to track my steps and my runs. I define an objective of 8000 steps per day. I was able to achieve this objective 24 days in a row. Check my stats:"}, {"f746": "6. ✘ Define an hour to get off the computer during the week. 8:00PM"}, {"6b2d": "I fail… I believe was one of the reasons I don’t wake up early. I was on the computer from 6 AM to 10 PM. At least I understand I have a problem here so I have to work on it."}, {"5ee6": "7. ✔ Become super productive"}, {"c500": "Here I felt a big improvement boosted by the days I wake up early, by exercise and by planning everything the day before. This software is called RescueTime."}, {"9bdf": "January"}, {"cfa6": "As you can see I did 146h 49m of productive time and my productivity score was 39%."}, {"de06": "Super February"}, {"dae5": "On February I Did 177h 51m and productivity score of 51%. That’s a 30% improvement. So I don’t double my productivity but was a big improvement."}, {"c049": "This stats don’t count 52h 10m of Gmail, calendar, as productive. So I have another 40 to 50 hours that I can more productive."}, {"b0a8": "So my final thoughts about this experiment are:"}, {"c0d0": "Make sure you fall in love the process"}, {"2cbd": "If you like this article don’t forget to ❤"}], "child": "846_1\t846_2\t846_3\t846_4\t846_5"}