{"name": "848", "parent": "", "content": "How Public commitment can change your life Photo credit: CJS*64 \"Man with a camera\" via VisualHunt / CC BY-ND Your inner power can be strong but sometimes you need some external help to achieve objectives in your life. You want to wake up early… but your bed is so warm… and you snooze one time and another … you feel good in that moment but a complete shit after. It’s easy to fail on things that don’t bring you any punishment. You wake up late, you never workout, you never talks to a girl, you never work on your side project after work, you never change your diet… the years pass and guess what happen? Nothing happen… Sad but true … Nothing will happen… the punishment is just nights wasted on Netflix and video games. Don’t expect any pain … The only thing is that you will not feel greatness and that’s all. But you will not feel bad because you never taste it. You will be in the same spot year after year and call it a life. Your brain want you to be safe .. not happy .. will give you thousands of good justifications why it’s ok. So if there is no “direct” punishment for our lack of action what should we do to get some extra motivation to change? I will teach you a little trick I did to start to wake up every day at 6 AM — 7 AM and it works really well for me. This trick looks stupid but it just works. What did was told to my brother: Dude I want to wake up every day at 6 AM. During 44 days ( I read somewhere that was a time we need to build a habit). If I fail more than 4 times I will give you 100€ if I don’t fail you don’t have to give me anything. Of course, he accepts the offer really fast. Nothing to lose? HELL YEAH! Easiest 100€ of my life. During first 11 days I fail 4 times to get up at 6 AM. I remember to feel really bad. My brain starts to give me reasons to give up. “If I don’t sleep I will have problems blah blah blah” But I didn’t want to lose the money. After that 11 days, I get up 33 days at 6 AM straight. Not a single fail. And to be honest, after 20 ~ 25 days it’s easy, you don’t even think about it. It makes part of you. That initial external pressure helped me to build discipline. Nowadays, even if I fail sometimes I have enough discipline to apply changes in my life. And actually, i fall in love with the process of slowly getting better. So my advice is if you don’t feel that you have enough inner power to do it alone, tell everyone you will do it. Make bets with someone that you are sure will ask you the money if you fail. Make sure you put an amount you don’t wanna lose. Another idea: Quit Smoking? Open your facebook and Instagram and post there. I will stop smoking. Public commitment is a great idea. If someone comment “ You can’t do it!” Show them that they are WRONG! Maybe you will tell me: OH, Carlos but that’s so stupid, you will bet with someone to act has your parent and pressure you. You should do the things because you want to not because you have external pressure. Yeah, thats a great concept but that’s not true until you have some discipline. Your parent’s force you to shower, to study, to clean your room.Your boss force to finish your work faster. Your bills force to work on that shitty job you hate. And you are telling me that you don’t need external pressure to do something that you are not forced to do it and don’t give you immediate results? Think again. ", "title": "How Public commitment can change your life", "sentences": [{"6578": "How Public commitment can change your life"}, {"a9d4": "Photo credit: CJS*64 \"Man with a camera\" via VisualHunt / CC BY-ND"}, {"180a": "Your inner power can be strong but sometimes you need some external help to achieve objectives in your life. You want to wake up early… but your bed is so warm… and you snooze one time and another … you feel good in that moment but a complete shit after. It’s easy to fail on things that don’t bring you any punishment."}, {"f164": "You wake up late, you never workout, you never talks to a girl, you never work on your side project after work, you never change your diet… the years pass and guess what happen?"}, {"8eb4": "Nothing happen… Sad but true … Nothing will happen… the punishment is just nights wasted on Netflix and video games. Don’t expect any pain … The only thing is that you will not feel greatness and that’s all. But you will not feel bad because you never taste it. You will be in the same spot year after year and call it a life. Your brain want you to be safe .. not happy .. will give you thousands of good justifications why it’s ok."}, {"6888": "So if there is no “direct” punishment for our lack of action what should we do to get some extra motivation to change?"}, {"d855": "I will teach you a little trick I did to start to wake up every day at 6 AM — 7 AM and it works really well for me. This trick looks stupid but it just works."}, {"d632": "What did was told to my brother:"}, {"607e": "Dude I want to wake up every day at 6 AM. During 44 days ( I read somewhere that was a time we need to build a habit). If I fail more than 4 times I will give you 100€ if I don’t fail you don’t have to give me anything."}, {"ce71": "Of course, he accepts the offer really fast. Nothing to lose? HELL YEAH! Easiest 100€ of my life."}, {"fae3": "During first 11 days I fail 4 times to get up at 6 AM. I remember to feel really bad. My brain starts to give me reasons to give up. “If I don’t sleep I will have problems blah blah blah” But I didn’t want to lose the money. After that 11 days, I get up 33 days at 6 AM straight. Not a single fail. And to be honest, after 20 ~ 25 days it’s easy, you don’t even think about it. It makes part of you."}, {"9b3c": "That initial external pressure helped me to build discipline. Nowadays, even if I fail sometimes I have enough discipline to apply changes in my life. And actually, i fall in love with the process of slowly getting better."}, {"8f7d": "So my advice is if you don’t feel that you have enough inner power to do it alone, tell everyone you will do it. Make bets with someone that you are sure will ask you the money if you fail. Make sure you put an amount you don’t wanna lose. Another idea: Quit Smoking? Open your facebook and Instagram and post there."}, {"cb6a": "I will stop smoking."}, {"9b00": "Public commitment is a great idea. If someone comment “ You can’t do it!” Show them that they are WRONG!"}, {"2cc2": "Maybe you will tell me:"}, {"102a": "OH, Carlos but that’s so stupid, you will bet with someone to act has your parent and pressure you. You should do the things because you want to not because you have external pressure."}, {"9f49": "Yeah, thats a great concept but that’s not true until you have some discipline."}, {"5154": "Your parent’s force you to shower, to study, to clean your room.Your boss force to finish your work faster. Your bills force to work on that shitty job you hate."}, {"49a8": "And you are telling me that you don’t need external pressure to do something that you are not forced to do it and don’t give you immediate results?"}, {"2650": "Think again."}], "child": "848_1\t848_2"}