{"name": "85", "parent": "", "content": "Featured Word to the Wise: Don’t Overlook the Second Round The surplus of talent in the 2017 NBA Draft can be benefited by the Knicks with two second round picks Photo: Bailey Carlin/TKW Illustration In a relatively unimpressive season yet again for the New York Knicks, the team is set to find themselves in a position that is rare for them in recent memory. Going into the NBA Draft on June 22, 2017, the team will possess not only a lottery-bound first round pick, but also two picks in the second round. Appearing to be a draft class loaded with talent, the Knicks have the ability not only to strengthen their starting five through the first round, but add viable bench depth in the second round with two picks at their disposal. The second round has proven to be fruitful at times over the years, producing talents such as Isaiah Thomas, Marc Gasol, Paul Millsap, and most famously, Manu Ginobili. via The Knicks Wall/SoundCloud Below are some of the options the Knicks could take a look at in the second round with the conclusion of the NCAA men’s Division I basketball season. Frank Mason III Let’s be clear — the only reason Frank Mason III is not higher up on the draft boards is because of the mundane senior stigma that exists in college basketball. Being a four-year player decreases your draft stock due to your age (22–23) entering the league, meaning you have less time in your career as well as a shorter adjustment period. Mason III will not need an adjustment period. The 5'11\", 190 pound point guard out of the University of Kansas has averaged 20.9 points per game, 5.2 assists per game, 4.2 rebounds per game, and 1.3 steals per game on 49 percent shooting from the field and 47.1 percent shooting from three-point range (per ESPN). The Naismith Award winner this past season, Mason III has received criticism for his size, but his toughness at the basket is unprecedented by other guards in college. An efficient scorer, Mason III has been a dominant force in college basketball since he began getting consistent minutes since his sophomore season. Now, tasked with the uphill battle of securing an NBA roster spot, the man who led Kansas to an 84–17 record in his three years starting, is a viable option for a New York team that needs all the help it can get at the point guard position. Dillon Brooks Don’t let a mediocre NCAA Tournament sway you away from Dillon Brooks’ strong junior season. Utilized as a power forward for the University of Oregon, Brooks would likely enter the league as a tweener, playing the bulk of his minutes at small forward. Garnering a career low 25.3 minutes per game this season, due to a talent stacked University of Oregon team, Brooks has starred, averaging 16.1 points per game, 3.2 rebounds per game, 2.7 assists per game, and 1.1 steals per game (via ESPN). Brooks is a dynamic scorer, averaging 48.8 percent shooting from the field and 40.1 percent shooting from three-point range and is utilized to create mismatches on the perimeter on offense. A true competitor, Brooks is an aggressive threat defensively, despite his rebounding numbers dropping a net 2.4 rebounds per game from his sophomore to junior year — a drop that can largely be explained through Brooks’ coinciding drop in minutes. The reason behind Brooks’ fall to the second round can be defined by position, or lack thereof, in the NBA game. Despite that, the Knicks would benefit from a two-way threat, who can provide a scoring touch off of the bench, despite the inconsistencies in his positioning. Josh Hart A member of the 2015–16 Villanova University NCAA Tournament-winning team, Josh Hart is yet another senior projected to slip into the second round of the NBA Draft, despite being the Big East Player of the Year. A proficient scorer at the collegiate level, Hart averaged 18.7 points per game, 6.4 rebounds per game, 2.9 assists per game, and 1.6 steals per game in his senior year at Villanova University, while posting two solid performances at the NCAA Tournament in his games against Mount St. Mary’s University and the University of Wisconsin. The Silver Linings Playbook for New York’s Losing SeasonLet’s look at what gets Knicks fans out of bed during this dismal seasontheknickswall.com Hart’s problems, though, have been heavily emphasized during his four years as we’ve seen he is unable make separation when attempting to shoot, thus stagnating the offense while also struggling with his vision when driving to the rim. This is down to his poor ability as a ball handler. The positive of that, though, is that Hart figures to be a shooting guard at the professional level with his 6'6\", 204 pound frame. Hart would likely play off the ball for the most part, using his efficient scoring touch that we saw in college to his advantage. At times this season, both Courtney Lee and Justin Holliday have looked like viable role players, but inconsistencies have riddled the Knicks at the two guard and a consistent shooter like Hart could provide a sense of stability if he’s not tasked with doing a lot on the ball outside of utilizing his shot. via YouTube/Reid Goldsmith Allonzo Trier It goes without saying, but Allonzo Trier made a smart decision forgoing the NBA Draft last season and returning to the University of Arizona for his sophomore season. Tasked with replacing now-Detroit Piston Stanley Johnson, Trier had the weight of the university on his shoulders and he didn’t handle it in the best way. Trier was forced to sit out the University of Arizona’s first 19 games of this season after testing positive for a Performance Enhancing Drug. Coming back for the team’s final 18 games, Trier managed to post 17.2 points per game, 5.3 rebounds per game, and 2.7 assists per game on 46 percent shooting from the field and 39.1 percent shooting from behind the arc (via ESPN). Trier’s draft stock plummeting is largely a result of his failed drug test, but if we can safely say that his 18 game sophomore season sample size is without the substance in his system, Trier is a steal in the second round. A gifted scorer, Trier can get score at the rim and draw fouls (as professed by his 6.4 free-throw attempts per game) with tenacity and has had an effective jump shot at the collegiate level. Though the jump shot might not translate in its full extent, Trier is young enough to develop it further. With his primary fault being his ball handling ability, he figures to be a shooting guard with his 6'6\" wingspan, but would prove to be a liability if asked to take on the role of combo guard. The score-first sophomore could be another viable shooting option off of the bench at a depleted shooting guard spot for the Knicks. The Knicks have of options, and thankfully draft picks, giving them the flexibility of grabbing potentially two of these players. In this talent heavy draft class, there is the potential to find steals in the second round and with the team’s cap space figuring to be $77,277,733 entering free agency (via Hoops Hype), building depth through the draft would give the Knicks that much more flexibility moving forward. — Ankit Mehra, site writer Follow The Knicks Wall on Facebook and Twitter, and listen to the TKW Podcast on SoundCloud! ", "title": "Word to the Wise: Don’t Overlook the Second Round", "sentences": [{"18da": "Featured"}, {"fc84": "Word to the Wise: Don’t Overlook the Second Round"}, {"5317": "The surplus of talent in the 2017 NBA Draft can be benefited by the Knicks with two second round picks"}, {"2b2c": "Photo: Bailey Carlin/TKW Illustration"}, {"ba9f": "In a relatively unimpressive season yet again for the New York Knicks, the team is set to find themselves in a position that is rare for them in recent memory. Going into the NBA Draft on June 22, 2017, the team will possess not only a lottery-bound first round pick, but also two picks in the second round."}, {"8056": "Appearing to be a draft class loaded with talent, the Knicks have the ability not only to strengthen their starting five through the first round, but add viable bench depth in the second round with two picks at their disposal. The second round has proven to be fruitful at times over the years, producing talents such as Isaiah Thomas, Marc Gasol, Paul Millsap, and most famously, Manu Ginobili."}, {"875a": "via The Knicks Wall/SoundCloud"}, {"3653": "Below are some of the options the Knicks could take a look at in the second round with the conclusion of the NCAA men’s Division I basketball season."}, {"d33b": "Frank Mason III"}, {"1a8a": "Let’s be clear — the only reason Frank Mason III is not higher up on the draft boards is because of the mundane senior stigma that exists in college basketball."}, {"4315": "Being a four-year player decreases your draft stock due to your age (22–23) entering the league, meaning you have less time in your career as well as a shorter adjustment period."}, {"a95d": "Mason III will not need an adjustment period. The 5'11\", 190 pound point guard out of the University of Kansas has averaged 20.9 points per game, 5.2 assists per game, 4.2 rebounds per game, and 1.3 steals per game on 49 percent shooting from the field and 47.1 percent shooting from three-point range (per ESPN). The Naismith Award winner this past season, Mason III has received criticism for his size, but his toughness at the basket is unprecedented by other guards in college."}, {"85e4": "An efficient scorer, Mason III has been a dominant force in college basketball since he began getting consistent minutes since his sophomore season. Now, tasked with the uphill battle of securing an NBA roster spot, the man who led Kansas to an 84–17 record in his three years starting, is a viable option for a New York team that needs all the help it can get at the point guard position."}, {"03ca": "Dillon Brooks"}, {"a2fe": "Don’t let a mediocre NCAA Tournament sway you away from Dillon Brooks’ strong junior season. Utilized as a power forward for the University of Oregon, Brooks would likely enter the league as a tweener, playing the bulk of his minutes at small forward. Garnering a career low 25.3 minutes per game this season, due to a talent stacked University of Oregon team, Brooks has starred, averaging 16.1 points per game, 3.2 rebounds per game, 2.7 assists per game, and 1.1 steals per game (via ESPN)."}, {"fc83": "Brooks is a dynamic scorer, averaging 48.8 percent shooting from the field and 40.1 percent shooting from three-point range and is utilized to create mismatches on the perimeter on offense. A true competitor, Brooks is an aggressive threat defensively, despite his rebounding numbers dropping a net 2.4 rebounds per game from his sophomore to junior year — a drop that can largely be explained through Brooks’ coinciding drop in minutes. The reason behind Brooks’ fall to the second round can be defined by position, or lack thereof, in the NBA game. Despite that, the Knicks would benefit from a two-way threat, who can provide a scoring touch off of the bench, despite the inconsistencies in his positioning."}, {"2c52": "Josh Hart"}, {"17cd": "A member of the 2015–16 Villanova University NCAA Tournament-winning team, Josh Hart is yet another senior projected to slip into the second round of the NBA Draft, despite being the Big East Player of the Year."}, {"53fc": "A proficient scorer at the collegiate level, Hart averaged 18.7 points per game, 6.4 rebounds per game, 2.9 assists per game, and 1.6 steals per game in his senior year at Villanova University, while posting two solid performances at the NCAA Tournament in his games against Mount St. Mary’s University and the University of Wisconsin."}, {"27f5": "The Silver Linings Playbook for New York’s Losing SeasonLet’s look at what gets Knicks fans out of bed during this dismal seasontheknickswall.com"}, {"5178": "Hart’s problems, though, have been heavily emphasized during his four years as we’ve seen he is unable make separation when attempting to shoot, thus stagnating the offense while also struggling with his vision when driving to the rim. This is down to his poor ability as a ball handler. The positive of that, though, is that Hart figures to be a shooting guard at the professional level with his 6'6\", 204 pound frame. Hart would likely play off the ball for the most part, using his efficient scoring touch that we saw in college to his advantage. At times this season, both Courtney Lee and Justin Holliday have looked like viable role players, but inconsistencies have riddled the Knicks at the two guard and a consistent shooter like Hart could provide a sense of stability if he’s not tasked with doing a lot on the ball outside of utilizing his shot."}, {"ee33": "via YouTube/Reid Goldsmith"}, {"6bdc": "Allonzo Trier"}, {"2f9c": "It goes without saying, but Allonzo Trier made a smart decision forgoing the NBA Draft last season and returning to the University of Arizona for his sophomore season. Tasked with replacing now-Detroit Piston Stanley Johnson, Trier had the weight of the university on his shoulders and he didn’t handle it in the best way. Trier was forced to sit out the University of Arizona’s first 19 games of this season after testing positive for a Performance Enhancing Drug."}, {"c253": "Coming back for the team’s final 18 games, Trier managed to post 17.2 points per game, 5.3 rebounds per game, and 2.7 assists per game on 46 percent shooting from the field and 39.1 percent shooting from behind the arc (via ESPN). Trier’s draft stock plummeting is largely a result of his failed drug test, but if we can safely say that his 18 game sophomore season sample size is without the substance in his system, Trier is a steal in the second round."}, {"e6a7": "A gifted scorer, Trier can get score at the rim and draw fouls (as professed by his 6.4 free-throw attempts per game) with tenacity and has had an effective jump shot at the collegiate level. Though the jump shot might not translate in its full extent, Trier is young enough to develop it further. With his primary fault being his ball handling ability, he figures to be a shooting guard with his 6'6\" wingspan, but would prove to be a liability if asked to take on the role of combo guard. The score-first sophomore could be another viable shooting option off of the bench at a depleted shooting guard spot for the Knicks."}, {"fe22": "The Knicks have of options, and thankfully draft picks, giving them the flexibility of grabbing potentially two of these players. In this talent heavy draft class, there is the potential to find steals in the second round and with the team’s cap space figuring to be $77,277,733 entering free agency (via Hoops Hype), building depth through the draft would give the Knicks that much more flexibility moving forward."}, {"21cb": "— Ankit Mehra, site writer"}, {"f761": "Follow The Knicks Wall on Facebook and Twitter, and listen to the TKW Podcast on SoundCloud!"}], "child": "85_185_185_185_185_185_1"}