{"name": "850", "parent": "", "content": "Apartment 308 A Tribute to Emilia Veron Apartment 308 was an unassuming place, a small apartment in a rent-assisted senior citizen complex just off a commercial street in a New Jersey city of 125,000 souls, most of whom are Hispanic and predominately from Colombian origins. Stepping off the elevator on the third floor, 308 was just to your left. From the hallway, it looked like every other apartment in the building. But, inside, it was an exceptional home — not a place, not an apartment, but a sanctuary of food, music, and conversation. A place to love and be loved. If you, on your daily travels a few years ago, happened to be standing outside Apartment 308, you would surely hear music — perhaps some chamamé, the folklore of northeastern Argentina from the provinces of Misiones, Corrientes, and Entre Rios, maybe the songs of Mario Millan Medina or Ernesto Montiel. If the words are familiar, you can’t resist singing along to “La Guampada” or “El Recluta.” Or, perhaps your body sways to the tangos that escape that little apartment— the music of Carlos Gardel, Juan d’Arienzo or Alfredo de Angelis. Your feet tap along with a bolero such as “Quizas, Quizas, Quizas” or your ears catch long ago recordings by Caminemos, Lucho Gatica, or Los Panchos. Mixed with the music, you hear the sounds of conversation, usually loud, or rollicking laughter, or maybe an overzealous discussion; in the background, perhaps the TV cacophony of a telenovela or a comedy from Argentina. And, swirled, curled, and weaved with all these sounds is one voice, the boisterous voice of a woman, a voice overflowing with love, joy, amusement, and comfort. Wafting out to the hallway, along with the music, are the aromas of foods — baked, broiled, grilled, sauteed, fried, roasted, simmered, boiled, steamed, and stewed foods, all prepared with love, all created from memory. If your day is lucky, you are invited in to eat tortilla de papas, fideos a la manteca, puchero, polenta or gnocchis with Italian sauce, empanadas, pasta flora, flan, or buñuelos. Empanadas On this lucky day, when you enter Apartment 308, aromas and sounds bombard your senses, and you immediately feel warmth and love. A short, stout woman wearing an apron over a simple dress welcomes you with a generous hug and a kiss on the cheek. She chatters in Argentinian Spanish or broken English as she waves you into her small, cozy apartment. Tortilla de Papas She offers you food, and there is always food, and perhaps a glass of Argentinian or Chilean wine. If you are fluent in Spanish, she sits and talks with you for hours. If like me, English is your only language of communication, she entertains you with music and feeds you as much as your stomach can hold, periodically patting your knee or shoulder saying “Welcome, welcome!” or “More, more!” You sit on the too-soft sofa and see the family photos that sit on shelves below the television and hang on walls in the entryway. You notice the room is slightly darker than it should be due to a multitude of flowers and plants that fill the wide window ledge. Mementos of trips to Argentina sit on available surfaces and dangle from walls on either side of the pass-through kitchen opening. Gnocchi Peeking into the kitchen, you spy an area too small, you think, to accommodate all the cooking that takes place there. How can one roll out the dough for pasta flora on such a stingy piece of counter space? Where would one stand and curl the pasta flour into those little football-like shapes known as gnocchi? Can that little stove hold all the pots and pans necessary to make the culinary delights that cover the dining table? But, somehow, in such a dinky space, that exceptional woman creates meals delicious enough to make you cry. Pasta Flora The woman who cooks, sings, laughs, hugs, and makes everyone feel welcome in her modest home had a simple beginning, as is often the case of those with the biggest hearts. Her name: Emilia Veron. Emilia was born on a farm in Felipe Yofre in the Corrientes province in northeastern Argentina. Her parents, a struggling young couple, lived with Emilia’s maternal grandmother. Two more children were born on the farm that could not support six, so Emilia’s father and mother left to look for work. What happened is uncertain, but Emilia’s parents separated, and her mother settled in the Chaco province, leaving her three children on the farm. Later, she would give birth to two more children. Emilia would not locate her two youngest siblings until she was fifty. Due to economic hardships, Emilia was forced to leave school after third grade and was sent to the city of Mercedes to be a nanny for the children of a doctor. At eighteen, she married a man ten years her senior, and they settled in Santa Fe. A year later, their first child, a son, was born. Seven more children would follow, one about every two years. Emilia’s husband was a mason with strong engineering skills, enabling him to provide modestly, but better than many, for his family, and his work led them to Buenos Aires. At the age of 51, Emilia, her husband, and their two youngest children immigrated to the United States to join their six adult kids already living in New Jersey. She left behind all that she knew and understood to reunite her family and in hopes of finding economic stability. Other than her childhood job of nannying, Emilia did not work outside her home until she was fifty-two when she found employment in a plastic factory. Having a job gave her freedoms and friendships she never imagined possible. Because her income was not needed to pay the bills, she happily saved the money, sending most of it back to Argentina to support family struggling in a troubled and turbulent economy. Widowed at 64, Emilia retired from her job and spent many years helping to raise grandchildren, spending time in Orlando, Miami, and Rochester, NY. She took her culinary skills wherever she went, cooking the foods of her homeland for grandchildren living in the land of McDonalds and Pizza Huts. She sang her songs and told her stories, giving her grandchildren connections to a country some would visit, and others would never see. As the younger generation aged and her child-rearing skills were less in demand, Emilia returned to New Jersey and settled in Apartment 308. For several years, I was honored to be among the fortunate ones invited into Apartment 308. I was hugged and fed and loved by the most amazing woman I ever met. Emilia was my mother-in-law, my mother when I lost mine, and my friend. Arriving at Apartment 308 always felt like coming home. Emilia felt like home. One year ago today, her body left this world, but her spirit lives on. It lives in my husband who cries for her nearly every day. It lives in each of her children, grandchildren, great-grandchildren, and the family members still in Argentina. It lives in me. Her spirit lives in the stories we tell, the songs we sing, the foods we cook, but can never prepare as well as she did. Apartment 308 is still there to the left when you step off the elevator, but it’s not the same place anymore. The heart and soul of Apartment 308 left more than two years ago when Emilia went to live with her daughter and granddaughter in Florida. If you stand in the hallway in front of Apartment 308 today, I doubt if you will hear the music or smell the food of Argentina. But, then again, if you are very still, perhaps you can — quizas, quizas, quizas. ", "title": "Apartment 308", "sentences": [{"fa59": "Apartment 308"}, {"a4bd": "A Tribute to Emilia Veron"}, {"5d4a": "Apartment 308 was an unassuming place, a small apartment in a rent-assisted senior citizen complex just off a commercial street in a New Jersey city of 125,000 souls, most of whom are Hispanic and predominately from Colombian origins. Stepping off the elevator on the third floor, 308 was just to your left. From the hallway, it looked like every other apartment in the building. But, inside, it was an exceptional home — not a place, not an apartment, but a sanctuary of food, music, and conversation. A place to love and be loved."}, {"6293": "If you, on your daily travels a few years ago, happened to be standing outside Apartment 308, you would surely hear music — perhaps some chamamé, the folklore of northeastern Argentina from the provinces of Misiones, Corrientes, and Entre Rios, maybe the songs of Mario Millan Medina or Ernesto Montiel. If the words are familiar, you can’t resist singing along to “La Guampada” or “El Recluta.” Or, perhaps your body sways to the tangos that escape that little apartment— the music of Carlos Gardel, Juan d’Arienzo or Alfredo de Angelis. Your feet tap along with a bolero such as “Quizas, Quizas, Quizas” or your ears catch long ago recordings by Caminemos, Lucho Gatica, or Los Panchos."}, {"2265": "Mixed with the music, you hear the sounds of conversation, usually loud, or rollicking laughter, or maybe an overzealous discussion; in the background, perhaps the TV cacophony of a telenovela or a comedy from Argentina. And, swirled, curled, and weaved with all these sounds is one voice, the boisterous voice of a woman, a voice overflowing with love, joy, amusement, and comfort."}, {"08f2": "Wafting out to the hallway, along with the music, are the aromas of foods — baked, broiled, grilled, sauteed, fried, roasted, simmered, boiled, steamed, and stewed foods, all prepared with love, all created from memory. If your day is lucky, you are invited in to eat tortilla de papas, fideos a la manteca, puchero, polenta or gnocchis with Italian sauce, empanadas, pasta flora, flan, or buñuelos."}, {"af54": "Empanadas"}, {"0738": "On this lucky day, when you enter Apartment 308, aromas and sounds bombard your senses, and you immediately feel warmth and love. A short, stout woman wearing an apron over a simple dress welcomes you with a generous hug and a kiss on the cheek. She chatters in Argentinian Spanish or broken English as she waves you into her small, cozy apartment."}, {"698b": "Tortilla de Papas"}, {"9d59": "She offers you food, and there is always food, and perhaps a glass of Argentinian or Chilean wine. If you are fluent in Spanish, she sits and talks with you for hours. If like me, English is your only language of communication, she entertains you with music and feeds you as much as your stomach can hold, periodically patting your knee or shoulder saying “Welcome, welcome!” or “More, more!”"}, {"0615": "You sit on the too-soft sofa and see the family photos that sit on shelves below the television and hang on walls in the entryway. You notice the room is slightly darker than it should be due to a multitude of flowers and plants that fill the wide window ledge. Mementos of trips to Argentina sit on available surfaces and dangle from walls on either side of the pass-through kitchen opening."}, {"021d": "Gnocchi"}, {"ba3e": "Peeking into the kitchen, you spy an area too small, you think, to accommodate all the cooking that takes place there. How can one roll out the dough for pasta flora on such a stingy piece of counter space? Where would one stand and curl the pasta flour into those little football-like shapes known as gnocchi? Can that little stove hold all the pots and pans necessary to make the culinary delights that cover the dining table? But, somehow, in such a dinky space, that exceptional woman creates meals delicious enough to make you cry."}, {"4d75": "Pasta Flora"}, {"a72a": "The woman who cooks, sings, laughs, hugs, and makes everyone feel welcome in her modest home had a simple beginning, as is often the case of those with the biggest hearts. Her name: Emilia Veron."}, {"850c": "Emilia was born on a farm in Felipe Yofre in the Corrientes province in northeastern Argentina. Her parents, a struggling young couple, lived with Emilia’s maternal grandmother. Two more children were born on the farm that could not support six, so Emilia’s father and mother left to look for work. What happened is uncertain, but Emilia’s parents separated, and her mother settled in the Chaco province, leaving her three children on the farm. Later, she would give birth to two more children. Emilia would not locate her two youngest siblings until she was fifty."}, {"4fa0": "Due to economic hardships, Emilia was forced to leave school after third grade and was sent to the city of Mercedes to be a nanny for the children of a doctor. At eighteen, she married a man ten years her senior, and they settled in Santa Fe. A year later, their first child, a son, was born. Seven more children would follow, one about every two years."}, {"69de": "Emilia’s husband was a mason with strong engineering skills, enabling him to provide modestly, but better than many, for his family, and his work led them to Buenos Aires."}, {"906a": "At the age of 51, Emilia, her husband, and their two youngest children immigrated to the United States to join their six adult kids already living in New Jersey. She left behind all that she knew and understood to reunite her family and in hopes of finding economic stability."}, {"74b7": "Other than her childhood job of nannying, Emilia did not work outside her home until she was fifty-two when she found employment in a plastic factory. Having a job gave her freedoms and friendships she never imagined possible. Because her income was not needed to pay the bills, she happily saved the money, sending most of it back to Argentina to support family struggling in a troubled and turbulent economy."}, {"5bed": "Widowed at 64, Emilia retired from her job and spent many years helping to raise grandchildren, spending time in Orlando, Miami, and Rochester, NY. She took her culinary skills wherever she went, cooking the foods of her homeland for grandchildren living in the land of McDonalds and Pizza Huts. She sang her songs and told her stories, giving her grandchildren connections to a country some would visit, and others would never see."}, {"b5a5": "As the younger generation aged and her child-rearing skills were less in demand, Emilia returned to New Jersey and settled in Apartment 308."}, {"3f3d": "For several years, I was honored to be among the fortunate ones invited into Apartment 308. I was hugged and fed and loved by the most amazing woman I ever met. Emilia was my mother-in-law, my mother when I lost mine, and my friend. Arriving at Apartment 308 always felt like coming home. Emilia felt like home."}, {"7672": "One year ago today, her body left this world, but her spirit lives on. It lives in my husband who cries for her nearly every day. It lives in each of her children, grandchildren, great-grandchildren, and the family members still in Argentina. It lives in me. Her spirit lives in the stories we tell, the songs we sing, the foods we cook, but can never prepare as well as she did."}, {"8e10": "Apartment 308 is still there to the left when you step off the elevator, but it’s not the same place anymore. The heart and soul of Apartment 308 left more than two years ago when Emilia went to live with her daughter and granddaughter in Florida."}, {"e790": "If you stand in the hallway in front of Apartment 308 today, I doubt if you will hear the music or smell the food of Argentina. But, then again, if you are very still, perhaps you can — quizas, quizas, quizas."}], "child": "850_1\t850_2\t850_3\t850_4\t850_5\t850_6"}