{"name": "852", "parent": "", "content": "Longfellow and Me Or The Reader’s Guide to Housework It was 1960-something, and I was eight and a good student but not yet an outstanding one. The only parent in our home was my father, a college graduate, and devoted reader. My eldest sister, living on her own in a state north of ours, chose a secretarial position over college. Sharry, seven years my senior and who still lived at home, would be lucky to graduate high school. Much to my father’s dismay, neither of his first-born daughters were readers.  On a cold, dreary winter Saturday, as on every Saturday, my sister and I were cleaning house. My duties consisted of cleaning my room, doing laundry, and dusting. My favorite responsibility was dusting, solely because of my father’s bookcase, an antique wooden stand-alone cabinet with seven shelves, the upper three hovering above my head. Glass doors encased in wood protected the shelves lined with books, many from my father’s college days. Every Saturday I lingered as I dusted the shelves and books. Fearing his disapproval and reprisal, I dared not touch the tomes that tempted me. I only paused to read titles and names of authors as I gently, and very slowly, glided my dust rag over each book. On this particular day, just as I finished my laundry duties, my sister, having completed her Saturday chores, left with a friend but not before warning me ominously, “All your work better be done by the time I get home, or I’m telling Dad.” Sharry considered herself to be the housework czar, always scrutinizing my finished work and tattling to our father if something was not done to her satisfaction or was not done fast enough. With Sharry gone and my dad working in his boat-building shop outside, I was alone in the house. I turned on some Nat King Cole music and grabbed my dusting rag. Listening to Red Sails in the Sunset, I dusted the lower part of the bookcase, containing books I’d already keenly inspected but, of course, had not removed. Still, I had memorized the titles and authors of each. To reach the higher shelves, I climbed up on a chair. Because of their height, I hadn’t spent much time perusing those shelves and was mostly unfamiliar with the books that occupied them, but they were about to meet my acquaintance. My cloth drifted over several college business course books. I moved on quickly because they did not interest me. Then, along came a literature book on Chaucer and I had no idea who he was. The next was a book about expository writing, and that sounded too much like schoolwork. Following that was a thick red leather book trimmed in gold, the binding a bit worn, the ends tattered. Along the spine, I read “The Complete Poetical Works of Longfellow.” I stared intently at the book. Didn’t Longfellow write “The Midnight Ride of Paul Revere” that my teacher recently read in class? I liked that — I liked it a lot. I fingered the leather. It was dry and cracked in places. I laid my palm on the spine, and I could almost feel a heartbeat radiating from the book. I jumped down off the chair and ran to the door, looking across our property to my father’s shop. Through a small window, I saw him busily working on the boat he was building. He’d be there for hours. Back on the chair, with the sounds of Nat King Cole crooning When I Fall in Love, I laid my left index finger on the top of the book and pulled it forward. My breath was shallow and sweat formed at my hairline. Cautiously and delicately, I reached up with my right hand and pulled the book from the shelf. Unconsciously, I looked over my shoulder to confirm that I was still alone. I stepped down off the chair, holding the book against my chest, and walked to the living room sofa. Sitting with my legs tucked under me, I opened the book, running my hand over the first page. The paper felt thin and delicate, unlike any pages I’d ever touched. I took in a deep breath to calm my nerves and began moving forward in the book. There was a photo of Mr. Longfellow. He seemed like a serious and noble gent, I thought. I turned the pages, one-by-one, going through the publication information until reaching the poetry. That is when I lost time. For two hours I read poem after poem. Delighting in “Hymn to the Night”, “Footsteps of Angels”, “Woods in Winter”, and many others — reading each silently first and then out loud just to hear the spoken words. After reading at least twenty of Mr. Longfellow’s poems, I returned to “A Psalm of Life”, my favorite. Also a favorite of my father’s as I could tell by his notes in the margins. I read it again and again. I wanted that poem to be mine forever, to be part of me. So, I memorized it. Verse by verse, I committed it to memory, never to be lost. I did not hear the door open. I did not hear footsteps. I did hear this, “What are you doing? You aren’t allowed to touch Dad’s books! He is going to be so mad!” my sister said almost gleefully. She glanced toward the book cabinet, saw the chair, saw the open doors. “You haven’t even finished your chores! You are sitting here, and you haven’t done your work! Wow, you are in big trouble.” I said nothing. My sister grabbed the book from my hand, “This is evidence.” I returned to the chair and the cabinet, finished my dusting there and in the rest of the house, retiring to my room after, feeling sad that the book of poetry could not go with me. An hour later, I heard Dad’s voice bellow from the living room, “Becky, come here!” My father sat in the only chair he ever used in the living room, a La-Z-Boy recliner. In his right hand was “The Complete Poetical Works of Longfellow”. An insane urge swept over me to grab the book and run. “So, Sharry tells me you were reading this book rather than doing your work,” he said sternly. Sharry interrupted, “I didn’t say she was actually reading the book. She was holding it. No way she could read a book like that!” With indignation I burst out, “I did so read it! Most of it. Except for the really long poems like “Hiawatha”.” “Yeah, right!” Sharry sneered, “I can’t even read that book. Besides you were supposed to be working. Right, Dad? She was supposed to be doing her work, and no one is allowed to touch your books. Right?” My father, generally prone to yelling, was silent. He studied me carefully before asking in a soft voice that was almost as scary as his yelling voice, “Did you honestly read most of these poems?” “Yes,” I said definitively, “I did.” My sister’s face turned red as she screamed in a voice that scared our cat out of the room, “She’s a liar! She’s lazy, and she’s a liar!” I glared at her and turned to my father saying, “I can prove it. I memorized “A Psalm of Life”. The whole thing. I can recite it for you.” Dad raised a hand in Sharry’s direction as if to stop the interruption he knew was coming. “Okay, “ he said, “Recite it.” I stood tall, and I started, “Tell me not, in mournful numbers, Life is but an empty dream.” And, I kept on going, reciting all nine verses perfectly. No one spoke for several seconds after the last word left my lips. My father smiled faintly. My sister’s lips were pursed, and she looked confused, totally confused, as though I’d been reciting words from another language. “Well, big deal,” Sharry said with contempt, “Who cares if you can recite some stupid poem. Right, Dad? Reciting a poem is nothing. You weren’t supposed to touch the book. She is in trouble for taking your book, isn’t she, Daddy?” My father handed the red leather book to me. My hand closed over it as I waited breathlessly. “Here,” Dad said, “Keep the book until you read everything in it. I know you will love “The Song of Hiawatha”. All I ask is that you take care of the book and put it back on the shelf when you’re done. In fact, you can read any of the books in the cabinet that you want.” I was speechless, but my sister was not. “What! Isn’t she getting punished? Just because she read a stupid book, she isn’t getting in trouble?” “Sharry, Becky got her work done, correct? And, she managed to read a book that is way above her grade level, and one, but the way, that is not stupid. And, she memorized a lengthy poem. I think she had a good day. Maybe you should start reading more and worrying about your sister less,” Dad said. Little did I know that day would be one of my favorite childhood memories and the start of a life-long love affair with books and poetry. My sister did not learn the lesson that Dad tried to teach her and, sadly, never became much of a reader. And, to this day, more than fifty years later, I can still recite every verse of “A Psalm of Life”. Inspired by Meg and The Book Barn ", "title": "Longfellow and Me", "sentences": [{"02e8": "Longfellow and Me"}, {"bfbf": "Or The Reader’s Guide to Housework"}, {"3765": "It was 1960-something, and I was eight and a good student but not yet an outstanding one. The only parent in our home was my father, a college graduate, and devoted reader. My eldest sister, living on her own in a state north of ours, chose a secretarial position over college. Sharry, seven years my senior and who still lived at home, would be lucky to graduate high school. Much to my father’s dismay, neither of his first-born daughters were readers.  On a cold, dreary winter Saturday, as on every Saturday, my sister and I were cleaning house. My duties consisted of cleaning my room, doing laundry, and dusting. My favorite responsibility was dusting, solely because of my father’s bookcase, an antique wooden stand-alone cabinet with seven shelves, the upper three hovering above my head. Glass doors encased in wood protected the shelves lined with books, many from my father’s college days. Every Saturday I lingered as I dusted the shelves and books. Fearing his disapproval and reprisal, I dared not touch the tomes that tempted me. I only paused to read titles and names of authors as I gently, and very slowly, glided my dust rag over each book."}, {"0a1b": "On this particular day, just as I finished my laundry duties, my sister, having completed her Saturday chores, left with a friend but not before warning me ominously, “All your work better be done by the time I get home, or I’m telling Dad.” Sharry considered herself to be the housework czar, always scrutinizing my finished work and tattling to our father if something was not done to her satisfaction or was not done fast enough."}, {"fb5a": "With Sharry gone and my dad working in his boat-building shop outside, I was alone in the house. I turned on some Nat King Cole music and grabbed my dusting rag."}, {"7a1e": "Listening to Red Sails in the Sunset, I dusted the lower part of the bookcase, containing books I’d already keenly inspected but, of course, had not removed. Still, I had memorized the titles and authors of each. To reach the higher shelves, I climbed up on a chair. Because of their height, I hadn’t spent much time perusing those shelves and was mostly unfamiliar with the books that occupied them, but they were about to meet my acquaintance."}, {"afe4": "My cloth drifted over several college business course books. I moved on quickly because they did not interest me. Then, along came a literature book on Chaucer and I had no idea who he was. The next was a book about expository writing, and that sounded too much like schoolwork. Following that was a thick red leather book trimmed in gold, the binding a bit worn, the ends tattered. Along the spine, I read “The Complete Poetical Works of Longfellow.”"}, {"464e": "I stared intently at the book. Didn’t Longfellow write “The Midnight Ride of Paul Revere” that my teacher recently read in class? I liked that — I liked it a lot. I fingered the leather. It was dry and cracked in places. I laid my palm on the spine, and I could almost feel a heartbeat radiating from the book."}, {"716b": "I jumped down off the chair and ran to the door, looking across our property to my father’s shop. Through a small window, I saw him busily working on the boat he was building. He’d be there for hours."}, {"0928": "Back on the chair, with the sounds of Nat King Cole crooning When I Fall in Love, I laid my left index finger on the top of the book and pulled it forward. My breath was shallow and sweat formed at my hairline. Cautiously and delicately, I reached up with my right hand and pulled the book from the shelf. Unconsciously, I looked over my shoulder to confirm that I was still alone."}, {"199b": "I stepped down off the chair, holding the book against my chest, and walked to the living room sofa. Sitting with my legs tucked under me, I opened the book, running my hand over the first page. The paper felt thin and delicate, unlike any pages I’d ever touched. I took in a deep breath to calm my nerves and began moving forward in the book. There was a photo of Mr. Longfellow. He seemed like a serious and noble gent, I thought."}, {"e05e": "I turned the pages, one-by-one, going through the publication information until reaching the poetry. That is when I lost time. For two hours I read poem after poem. Delighting in “Hymn to the Night”, “Footsteps of Angels”, “Woods in Winter”, and many others — reading each silently first and then out loud just to hear the spoken words."}, {"4feb": "After reading at least twenty of Mr. Longfellow’s poems, I returned to “A Psalm of Life”, my favorite. Also a favorite of my father’s as I could tell by his notes in the margins. I read it again and again. I wanted that poem to be mine forever, to be part of me. So, I memorized it. Verse by verse, I committed it to memory, never to be lost."}, {"f6f7": "I did not hear the door open. I did not hear footsteps. I did hear this, “What are you doing? You aren’t allowed to touch Dad’s books! He is going to be so mad!” my sister said almost gleefully. She glanced toward the book cabinet, saw the chair, saw the open doors. “You haven’t even finished your chores! You are sitting here, and you haven’t done your work! Wow, you are in big trouble.”"}, {"f156": "I said nothing. My sister grabbed the book from my hand, “This is evidence.”"}, {"25c3": "I returned to the chair and the cabinet, finished my dusting there and in the rest of the house, retiring to my room after, feeling sad that the book of poetry could not go with me."}, {"79b8": "An hour later, I heard Dad’s voice bellow from the living room, “Becky, come here!”"}, {"ed32": "My father sat in the only chair he ever used in the living room, a La-Z-Boy recliner. In his right hand was “The Complete Poetical Works of Longfellow”. An insane urge swept over me to grab the book and run."}, {"bd07": "“So, Sharry tells me you were reading this book rather than doing your work,” he said sternly."}, {"e659": "Sharry interrupted, “I didn’t say she was actually reading the book. She was holding it. No way she could read a book like that!”"}, {"3600": "With indignation I burst out, “I did so read it! Most of it. Except for the really long poems like “Hiawatha”.”"}, {"9488": "“Yeah, right!” Sharry sneered, “I can’t even read that book. Besides you were supposed to be working. Right, Dad? She was supposed to be doing her work, and no one is allowed to touch your books. Right?”"}, {"fd7f": "My father, generally prone to yelling, was silent. He studied me carefully before asking in a soft voice that was almost as scary as his yelling voice, “Did you honestly read most of these poems?”"}, {"10cd": "“Yes,” I said definitively, “I did.”"}, {"4c55": "My sister’s face turned red as she screamed in a voice that scared our cat out of the room, “She’s a liar! She’s lazy, and she’s a liar!”"}, {"6057": "I glared at her and turned to my father saying, “I can prove it. I memorized “A Psalm of Life”. The whole thing. I can recite it for you.”"}, {"15ef": "Dad raised a hand in Sharry’s direction as if to stop the interruption he knew was coming. “Okay, “ he said, “Recite it.”"}, {"5fde": "I stood tall, and I started, “Tell me not, in mournful numbers, Life is but an empty dream.” And, I kept on going, reciting all nine verses perfectly."}, {"cc65": "No one spoke for several seconds after the last word left my lips. My father smiled faintly. My sister’s lips were pursed, and she looked confused, totally confused, as though I’d been reciting words from another language."}, {"e632": "“Well, big deal,” Sharry said with contempt, “Who cares if you can recite some stupid poem. Right, Dad? Reciting a poem is nothing. You weren’t supposed to touch the book. She is in trouble for taking your book, isn’t she, Daddy?”"}, {"6cfb": "My father handed the red leather book to me. My hand closed over it as I waited breathlessly. “Here,” Dad said, “Keep the book until you read everything in it. I know you will love “The Song of Hiawatha”. All I ask is that you take care of the book and put it back on the shelf when you’re done. In fact, you can read any of the books in the cabinet that you want.”"}, {"1187": "I was speechless, but my sister was not. “What! Isn’t she getting punished? Just because she read a stupid book, she isn’t getting in trouble?”"}, {"bd3a": "“Sharry, Becky got her work done, correct? And, she managed to read a book that is way above her grade level, and one, but the way, that is not stupid. And, she memorized a lengthy poem. I think she had a good day. Maybe you should start reading more and worrying about your sister less,” Dad said."}, {"0ffb": "Little did I know that day would be one of my favorite childhood memories and the start of a life-long love affair with books and poetry. My sister did not learn the lesson that Dad tried to teach her and, sadly, never became much of a reader."}, {"2d20": "And, to this day, more than fifty years later, I can still recite every verse of “A Psalm of Life”."}, {"b55b": "Inspired by Meg and The Book Barn"}], "child": "852_1\t852_2"}