{"name": "853", "parent": "", "content": "Winter Content But how did you do this? How did this happen? Her smile would return. It was still there, sort of, belied by signature furrow and squint. I wouldn’t make her wait for an answer. No joking around this time. I would tell her everything. Four hours earlier, I woke her to another frigid morning. Cocooned in heavy quilt, she breathed in deep and exhaled. Time for work? Not today. She opened her eyes and focused as best she could. No need for glasses. She knew something had changed. What is it? Get dressed. We need to go soon. She was never one for surprises. Past attempts at concealment were futile, eventually abandoned from duress brought on by the incessant tell me and tell me now. Not this time. Just this once she’d need to play along. Then, I would never surprise her again. My confidence must have given her comfort. Sure, she was nervous when she’d seen packed luggage by the door. She was understandably shaky when the taxi pulled up. But each time she looked to me, she’d return to calm. My face, how I was standing — the way I carried myself was putting her at ease. The kids ate breakfast earlier. Time to go. She held my hand in the cab. She slept on the plane. On the balcony, overlooking our daughters playing on the beach, she began to smile. She brushed sand off a white shell one of the girls brought her and held it up to me. How did this happen? Electric was the last of the bills. I intentionally kept setting it aside, leaving it to the end. I picked it up to go over the numbers again. Reaching for the calculator, a fingernail from the pile pricked my hand. I changed course and went for the pen. I signed the check quickly, sloppily and sealed it away. Four postage stamps remained from the sheet. I tore one out, looking at it this time. I wondered what made her pick seashells. I dipped the tip of my finger in the cold coffee and wet the stamp. I grabbed the stack, walked to the sink and dumped the mug. Time to go. I woke her to another frigid morning. She breathed in deeply and exhaled. “Time for work?” “Yes.” I leaned and kissed the top of her head. Her eyes stay closed. I stood there, watching her. This time, for a little longer. I walked to the door, stopped and looked back. “You know, maybe tonight I can find a good copy of Moana on that website. We can make it a movie night.” “You know I don’t like it when you do that. It’s illegal.” Her eyes stay closed. “Yeah, well, it’s free too.” No response. “OK. See you tonight.” No response. “Aloha.” No response. I closed the door behind me. ", "title": "Winter Content", "sentences": [{"f7f2": "Winter Content"}, {"eb81": "But how did you do this? How did this happen?"}, {"fa15": "Her smile would return. It was still there, sort of, belied by signature furrow and squint. I wouldn’t make her wait for an answer. No joking around this time. I would tell her everything."}, {"2973": "Four hours earlier, I woke her to another frigid morning. Cocooned in heavy quilt, she breathed in deep and exhaled."}, {"7565": "Time for work?"}, {"3866": "Not today."}, {"32a9": "She opened her eyes and focused as best she could. No need for glasses. She knew something had changed."}, {"c65a": "What is it?"}, {"facb": "Get dressed. We need to go soon."}, {"6d0d": "She was never one for surprises. Past attempts at concealment were futile, eventually abandoned from duress brought on by the incessant tell me and tell me now. Not this time. Just this once she’d need to play along. Then, I would never surprise her again."}, {"f2c3": "My confidence must have given her comfort. Sure, she was nervous when she’d seen packed luggage by the door. She was understandably shaky when the taxi pulled up. But each time she looked to me, she’d return to calm. My face, how I was standing — the way I carried myself was putting her at ease."}, {"114a": "The kids ate breakfast earlier. Time to go."}, {"b296": "She held my hand in the cab."}, {"59d7": "She slept on the plane."}, {"596f": "On the balcony, overlooking our daughters playing on the beach, she began to smile. She brushed sand off a white shell one of the girls brought her and held it up to me."}, {"c0e8": "How did this happen?"}, {"7934": "Electric was the last of the bills. I intentionally kept setting it aside, leaving it to the end. I picked it up to go over the numbers again. Reaching for the calculator, a fingernail from the pile pricked my hand. I changed course and went for the pen. I signed the check quickly, sloppily and sealed it away."}, {"e059": "Four postage stamps remained from the sheet. I tore one out, looking at it this time. I wondered what made her pick seashells. I dipped the tip of my finger in the cold coffee and wet the stamp. I grabbed the stack, walked to the sink and dumped the mug."}, {"4944": "Time to go."}, {"0a10": "I woke her to another frigid morning. She breathed in deeply and exhaled."}, {"b59e": "“Time for work?”"}, {"675b": "“Yes.” I leaned and kissed the top of her head. Her eyes stay closed."}, {"d359": "I stood there, watching her. This time, for a little longer. I walked to the door, stopped and looked back."}, {"6509": "“You know, maybe tonight I can find a good copy of Moana on that website. We can make it a movie night.”"}, {"12be": "“You know I don’t like it when you do that. It’s illegal.” Her eyes stay closed."}, {"7d50": "“Yeah, well, it’s free too.”"}, {"29da": "No response."}, {"d4fe": "“OK. See you tonight.”"}, {"3c86": "No response."}, {"740e": "“Aloha.”"}, {"c552": "No response."}, {"97eb": "I closed the door behind me."}], "child": "853_1\t853_2\t853_3\t853_4\t853_5\t853_6853_1\t853_2\t853_3\t853_4\t853_5\t853_6"}