{"name": "860", "parent": "", "content": "Speaking of My Brother Larry, before Iraq How do I write this without further breaking the hearts of people I love? I don’t think I can. But here I am anyway, putting it out there for the world to see. A book that I think of often is called SPEAKER FOR THE DEAD. Written by Orson Scott Card, a “Speaker for the Dead” is someone called after a death, who didn’t know the deceased but takes on the job of researching their lives and “speaking” the complete truth about them publicly after their death. The idea is that they tell the whole truth, good and bad, so that the complete person is known — not just the lows and certainly not just the highs. So that is what this is. A speaking. Except in this case, I know the person I speak of. I was four years old when my brother Larry was born. He weighed 10 pounds and 10 ounces. Before he was home from the hospital, a neighbor told me I had a “big brother” and I cried, thinking that he would be tall with hair under his arms like the big teenagers down the street instead of the cuddly little baby I had hoped for. He was a rowdy kid, loud and funny. He moved full steam ahead at all times - running, jumping, karate-chopping everything in his path. He adored our dad and imitated his every move. Dad was in law enforcement — a federal officer with the Treasury Department specializing in narcotics— and my brother’s favorite playtime exploits involved chasing down the bad guys just like Dad. Larry, Stephen, Myke and Dad We lived in Florida when we were young and it was the 70’s — a crazy time and place for someone to be in the drug-busting business. We grew up hearing about all of the dangerous criminals Dad faced everyday — we saw pictures of Dad posing with guns confiscated and bricks of cocaine stacked up like Legos. There was never any doubt Larry was going to grow up to be a cop like Dad. At 19, he got a job as a bailiff in a small town in Texas. He married and divorced a beautiful Italian girl, and had two adorable kids to show for it. He skipped college, as every kid in our family did, for reasons that had a lot to do with a combination of our parents not having gone, learning disabilities, and an inability to sit still for any length of time that definitely ran in the family. There was tragedy in our family background — shifting family cohesiveness, divorce, alcohol, and more. Two of our younger brothers fell into homelessness and hard drugs. Stephen, our youngest and everyone’s favorite, died at 19 in a fire in an abandoned building in Hollywood, California, too drunk to wake up and escape the flames. Our other younger brother, Myke, was by then very far gone into drugs and the street life as well, ultimately spending 15 years in and out of prison, homeless, and on heroin. Through it all, Larry was building his life brick by brick, as a law enforcement officer and a father. He remarried, this time to a lovely smart blonde Texan and fellow law enforcement officer named Cyndi that he met over an accident scene. They had a son together, a doppelganger for Larry who ran full-speed ahead at everything in his path. Eventually Larry was a homicide detective with Williamson County, Texas, one of the most conservative law-and-order beats in an already conservative God-and-Guns state. Our brother Myke was once arrested in Williamson County, and it hurt Larry so much to see how far Myke had fallen into addiction and despair. Always either on the streets or in prison, Myke missed all of the big family events, and with me and my sister living in other states, Larry became the one that my mom leaned on the most. Larry and Mom Larry and Cyndi bought a few acres out in the country and stocked it with enough animals to call it a real ranch. Larry, an avid hunter his whole life, could bow hunt right on the property, a dream come true. They put what they could afford on it — a trailer — but saved up for their dream house, hoping to build the home they’d leave to their children. All of that fell apart when Larry became involved in a whistle-blower case involving the Sheriff’s department in Williamson County. He, along with a few others from his department, gave information to their new sheriff about misdeeds within the department. They trusted the sheriff to clean up the department, and shared their concerns about fellow department members. They campaigned publicly for the sheriff — but when he didn’t win the election, the whistle-blowers quickly fell out of favor with his successor, who knew about their loyalty. Larry was demoted, down from a detective to a patrolman. He lost years of seniority in one fell swoop. Everything he had worked for was taken away in the blink of an eye, with one command of the man who was quite literally “the new sheriff in town.” Helpless to regain what he had lost, he filed a lawsuit along with the other whistle-blowers. But in the meantime, he had bills to pay and a dream to get back on course. He had the plans for his new house already drawn up and no means to make his trailer payment, much less build the house of his dreams. Somewhere in here, my dad died. His many mistakes — including an addiction to prescription pain medication — had led to most of his kids turning away in self-preservation years before. But not Larry. He was loyal — if frustrated — to the end, and dug my dad’s grave in the ancient family cemetery by himself, way out in the Texas countryside, alone. During this time, the war in Iraq was raging. Money was pouring into the private contractor industry — and they began recruiting small town Texas law enforcement. Larry, with no military training but years of local law training, was recruited heavily — along with hundreds of other men. The pay was beyond anything they could have ever earned back home. Within a few months, he was vetted and contracted — and headed to Iraq. It would be the first deer-season opening day he had ever missed. But it was a new adventure, one that would allow him to forget the humiliation of the demotion and allow him enough money — if he survived — to build the house and secure his future. We cried when he left, unsure if we’d lose him to the job. But it was a lot of money — especially to someone without a college degree and not a lot of prospects in the field he’d spent his life in. He served three contracts, training Iraqi policemen. He reveled in the work, feeling like he had missed his calling by not joining the army when he was young. He was proud of what he was doing and interested in everything around him. He sent back photos of the food, the tents, the men he trained. He wrote emails about his daily life with only the occasional complaint about the heat or the cramped quarters, “My room is ten foot by five foot. Needless to say, you feel like you’re in prison.” He sent the money home to Cyndi, who moved into a tiny RV on the land and supervised the construction of their home. As he skyped in from the Iraqi desert, the shape of his dream came into existence — a big sprawling family home, with room enough for all of his kids, a place to host family holidays and rise up to become the patriarch of the family. The dream house almost finished When Larry finally came home for good, his home was ready. It should have been the high point of his life. The dream home was built, the family all gathered, he had enough in the bank left over to take some time off and plan out his next phase. But the war had done something to Larry. He had always been an antsy kid, and an active man, with more plans than any one person could fit into a lifetime. But now that feverish brain went into overdrive. He couldn’t sit still for a moment. He roamed the house with a bottle of cleaner and paper towels in hand, scrubbing every surface. Every item in the pantry was arranged perfectly. My former slobby baby brother who once left a tuna sandwich under his bed until it was green and fuzzy was a clean freak beyond anything I could possibly imagine. He couldn’t relax, his brainwiring tripped into hyper-awareness. He had hurt his back while on duty overseas, and the new pills the doctor prescribed were the only things that seemed to calm him down. The pills were oxycontin, a pain drug once reserved only for end-of-life cancer cases. But there was “new evidence” that showed that Americans were drastically undertreated for pain and a famous study showed that “less than 1% of opioid users become addicted to the drugs.” That “study” was actually only a single paragraph of a letter written in a 1980 medical journal by two doctors, Porter & Jick. That single paragraph — along with an insanely aggressive marketing campaign — launched a generation of new junkies, people suffering from physical ailments that were easier to focus on than their untreatable deep unease over diminishing job prospects and 2008-era financial worries. The drugs took hold in Larry, a man who had rarely even finished a beer before. As he began to take more and more, life took a turn none of us saw coming: our younger brother Myke found his way out of decades of heroin and jail. For a brief moment, Myke’s rise and Larry’s decline crossed as they invested together in a tattoo parlor Myke started. Myke went on to greater and greater success, and Larry just sunk deeper. Larry tried to get another job in law enforcement but suspected he was black-balled because of the whistle-blower lawsuit he had launched before he left for Iraq. His identity, which had always been as a law-and-order man, was gone and he floundered for something, anything to shore him up. Bad decisions on every front — financial, relationship — followed. The fall was swift. Larry rarely expressed remorse, moving as headstrong into destruction as he had into everything else he had done his whole life. Cyndi left, preserving herself and protecting their son. Larry tried to keep the house and moved in roommates but eventually had to let it go. We all worried about the environment Larry was exposing his son to, and the decisions he was making. At one point I called him, furious because I heard that he was keeping a live rattlesnake in a glass coffee table enclosure in a small rental house he was sharing with a new very young girlfriend. He promised me he would let it go, but told me he had it under control and I was silly to worry about it. We felt helpless to catch his fall, to stop this man who had always been so headstrong from moving full-force to destroying his whole life. His children grew bitter and one day, I got a frantic phone call from Cyndi, begging me to confront Larry. She was certain he was using drugs — not just oxycontin — but something much stronger. She said he was thin beyond recognition and she knew it was just a matter of time until he died. Myke had by this time built a remarkable life for himself — and was one of the most well-respected celebrity tattoo artists in the US. His meteoric rise had been centered around his determination to help others climb out of the darkness he had lived in — his remarkable story inspired legions of fans and he personally reached out and helped hundreds get clean. But Larry, still holding on to his image as the law-and-order good son, refused to admit he had a problem. This next part went both so very slowly and much too quickly — and will be familiar to anyone who has ever struggled with a family member caught in addiction: scenes of all of us begging Larry to get help, texting him frequently offering rehab, flying into town to confront him, arguing with my mother and sister about whether he was using prescription drugs or meth or heroin, watching him descend further and further down. One of the last times I saw Larry — over three years ago now— I cried and said goodbye. The once 250 pound man was now a skeleton. His front teeth were gone. He terrified me. And it saddened me to my core because I thought he was a dead man walking, because he was much too proud to ever face what he had become. He would not be shaken enough by his condition to ever get clean, because he would deny it forever. He finally admitted he was on too many prescription drugs but nothing stronger. He was shaken by my tearful goodbye, enough to go to his doctor and tell him that he wanted to “cut down” on the prescription meds. I know only because he called me and put the entire exchange on speaker phone. But I knew that was just for show, to try to prove that he wasn’t a street drug criminal and convince me that he was still the good son. Even without teeth and weighing a fraction of a normal weight, he was still trying to manage my impression of him. As anyone who has dealt with this knows, it only ends in one of two places: death or prison. Last Friday, I landed from a trip to Europe to a text from Myke, with a link to a news story. And this is as far as this story goes for now. Caught with stolen guns and meth — and facing many many years behind bars. I don’t know details beyond what I read online. What we do know is that the address where the guns were stolen was down the street from Larry’s old house. He knew the man who owned them. My brother is technically not deceased. But I feel as though the person he once was isn’t recognizable as the man in that photo. To have such a dramatic reversal of circumstance is like a death in many ways. It is shocking and sickening and sad. I am deeply sorry for the pain he has caused — and for the pain he is clearly in. I would do anything to change what has happened and make everything right for him, his family, the people affected by the monster he has become. I was not planning to write anything about this because I know it hurts his kids to know how public this has already become in their small hometown. But when I read the articles about him — and made the terrible mistake of clicking down to read the comments — I needed to respond to the people who casually typed things like “Deport this scum” or “This guy should be shot 39 times.” Behind every one of these stories of a terrible fall into addiction is someone who once had dreams and hopes and plans just like yours. He is a brother, a father, was once a cherished husband. He is still a much loved son by a mother who has had her heart broken more than once by the children she raised. His is a story of a fall from grace, pride, addiction, pharma corporate greed, American ambition, military aggression, small town politics, economic depression, few options due to lack of education, and more. It’s a story of far too many people now, one of our particular time in history. But it’s also the story of a single human life, a person I love and mourn with every fiber of my heart. He’s not just another junkie on the street, a skeleton without a conscience. None of them are. Somewhere in there, in those sad clouded hazel eyes, my brother is alive. And for now, I’m speaking for him until maybe one day, he’ll speak again for himself. ", "title": "Speaking of My Brother", "sentences": [{"f5a5": "Speaking of My Brother"}, {"7f91": "Larry, before Iraq"}, {"c2fa": "How do I write this without further breaking the hearts of people I love? I don’t think I can. But here I am anyway, putting it out there for the world to see."}, {"c3c3": "A book that I think of often is called SPEAKER FOR THE DEAD. Written by Orson Scott Card, a “Speaker for the Dead” is someone called after a death, who didn’t know the deceased but takes on the job of researching their lives and “speaking” the complete truth about them publicly after their death. The idea is that they tell the whole truth, good and bad, so that the complete person is known — not just the lows and certainly not just the highs."}, {"a228": "So that is what this is. A speaking. Except in this case, I know the person I speak of."}, {"60be": "I was four years old when my brother Larry was born. He weighed 10 pounds and 10 ounces. Before he was home from the hospital, a neighbor told me I had a “big brother” and I cried, thinking that he would be tall with hair under his arms like the big teenagers down the street instead of the cuddly little baby I had hoped for."}, {"ba11": "He was a rowdy kid, loud and funny. He moved full steam ahead at all times - running, jumping, karate-chopping everything in his path. He adored our dad and imitated his every move. Dad was in law enforcement — a federal officer with the Treasury Department specializing in narcotics— and my brother’s favorite playtime exploits involved chasing down the bad guys just like Dad."}, {"1ffc": "Larry, Stephen, Myke and Dad"}, {"4384": "We lived in Florida when we were young and it was the 70’s — a crazy time and place for someone to be in the drug-busting business. We grew up hearing about all of the dangerous criminals Dad faced everyday — we saw pictures of Dad posing with guns confiscated and bricks of cocaine stacked up like Legos."}, {"f9d8": "There was never any doubt Larry was going to grow up to be a cop like Dad."}, {"86f9": "At 19, he got a job as a bailiff in a small town in Texas. He married and divorced a beautiful Italian girl, and had two adorable kids to show for it. He skipped college, as every kid in our family did, for reasons that had a lot to do with a combination of our parents not having gone, learning disabilities, and an inability to sit still for any length of time that definitely ran in the family."}, {"7b2f": "There was tragedy in our family background — shifting family cohesiveness, divorce, alcohol, and more. Two of our younger brothers fell into homelessness and hard drugs. Stephen, our youngest and everyone’s favorite, died at 19 in a fire in an abandoned building in Hollywood, California, too drunk to wake up and escape the flames. Our other younger brother, Myke, was by then very far gone into drugs and the street life as well, ultimately spending 15 years in and out of prison, homeless, and on heroin."}, {"9209": "Through it all, Larry was building his life brick by brick, as a law enforcement officer and a father. He remarried, this time to a lovely smart blonde Texan and fellow law enforcement officer named Cyndi that he met over an accident scene. They had a son together, a doppelganger for Larry who ran full-speed ahead at everything in his path."}, {"71c9": "Eventually Larry was a homicide detective with Williamson County, Texas, one of the most conservative law-and-order beats in an already conservative God-and-Guns state. Our brother Myke was once arrested in Williamson County, and it hurt Larry so much to see how far Myke had fallen into addiction and despair. Always either on the streets or in prison, Myke missed all of the big family events, and with me and my sister living in other states, Larry became the one that my mom leaned on the most."}, {"e5a0": "Larry and Mom"}, {"a70d": "Larry and Cyndi bought a few acres out in the country and stocked it with enough animals to call it a real ranch. Larry, an avid hunter his whole life, could bow hunt right on the property, a dream come true. They put what they could afford on it — a trailer — but saved up for their dream house, hoping to build the home they’d leave to their children."}, {"6bd3": "All of that fell apart when Larry became involved in a whistle-blower case involving the Sheriff’s department in Williamson County. He, along with a few others from his department, gave information to their new sheriff about misdeeds within the department. They trusted the sheriff to clean up the department, and shared their concerns about fellow department members. They campaigned publicly for the sheriff — but when he didn’t win the election, the whistle-blowers quickly fell out of favor with his successor, who knew about their loyalty. Larry was demoted, down from a detective to a patrolman. He lost years of seniority in one fell swoop. Everything he had worked for was taken away in the blink of an eye, with one command of the man who was quite literally “the new sheriff in town.”"}, {"18d7": "Helpless to regain what he had lost, he filed a lawsuit along with the other whistle-blowers. But in the meantime, he had bills to pay and a dream to get back on course. He had the plans for his new house already drawn up and no means to make his trailer payment, much less build the house of his dreams. Somewhere in here, my dad died. His many mistakes — including an addiction to prescription pain medication — had led to most of his kids turning away in self-preservation years before. But not Larry. He was loyal — if frustrated — to the end, and dug my dad’s grave in the ancient family cemetery by himself, way out in the Texas countryside, alone."}, {"72cd": "During this time, the war in Iraq was raging. Money was pouring into the private contractor industry — and they began recruiting small town Texas law enforcement. Larry, with no military training but years of local law training, was recruited heavily — along with hundreds of other men. The pay was beyond anything they could have ever earned back home."}, {"ff93": "Within a few months, he was vetted and contracted — and headed to Iraq. It would be the first deer-season opening day he had ever missed. But it was a new adventure, one that would allow him to forget the humiliation of the demotion and allow him enough money — if he survived — to build the house and secure his future."}, {"3482": "We cried when he left, unsure if we’d lose him to the job. But it was a lot of money — especially to someone without a college degree and not a lot of prospects in the field he’d spent his life in."}, {"6959": "He served three contracts, training Iraqi policemen. He reveled in the work, feeling like he had missed his calling by not joining the army when he was young. He was proud of what he was doing and interested in everything around him. He sent back photos of the food, the tents, the men he trained. He wrote emails about his daily life with only the occasional complaint about the heat or the cramped quarters, “My room is ten foot by five foot. Needless to say, you feel like you’re in prison.”"}, {"b8d6": "He sent the money home to Cyndi, who moved into a tiny RV on the land and supervised the construction of their home. As he skyped in from the Iraqi desert, the shape of his dream came into existence — a big sprawling family home, with room enough for all of his kids, a place to host family holidays and rise up to become the patriarch of the family."}, {"26e2": "The dream house almost finished"}, {"dd25": "When Larry finally came home for good, his home was ready. It should have been the high point of his life. The dream home was built, the family all gathered, he had enough in the bank left over to take some time off and plan out his next phase."}, {"447d": "But the war had done something to Larry. He had always been an antsy kid, and an active man, with more plans than any one person could fit into a lifetime. But now that feverish brain went into overdrive. He couldn’t sit still for a moment. He roamed the house with a bottle of cleaner and paper towels in hand, scrubbing every surface. Every item in the pantry was arranged perfectly. My former slobby baby brother who once left a tuna sandwich under his bed until it was green and fuzzy was a clean freak beyond anything I could possibly imagine."}, {"d01d": "He couldn’t relax, his brainwiring tripped into hyper-awareness. He had hurt his back while on duty overseas, and the new pills the doctor prescribed were the only things that seemed to calm him down. The pills were oxycontin, a pain drug once reserved only for end-of-life cancer cases. But there was “new evidence” that showed that Americans were drastically undertreated for pain and a famous study showed that “less than 1% of opioid users become addicted to the drugs.” That “study” was actually only a single paragraph of a letter written in a 1980 medical journal by two doctors, Porter & Jick. That single paragraph — along with an insanely aggressive marketing campaign — launched a generation of new junkies, people suffering from physical ailments that were easier to focus on than their untreatable deep unease over diminishing job prospects and 2008-era financial worries."}, {"43f8": "The drugs took hold in Larry, a man who had rarely even finished a beer before. As he began to take more and more, life took a turn none of us saw coming: our younger brother Myke found his way out of decades of heroin and jail. For a brief moment, Myke’s rise and Larry’s decline crossed as they invested together in a tattoo parlor Myke started. Myke went on to greater and greater success, and Larry just sunk deeper."}, {"afd0": "Larry tried to get another job in law enforcement but suspected he was black-balled because of the whistle-blower lawsuit he had launched before he left for Iraq. His identity, which had always been as a law-and-order man, was gone and he floundered for something, anything to shore him up."}, {"2d5c": "Bad decisions on every front — financial, relationship — followed. The fall was swift. Larry rarely expressed remorse, moving as headstrong into destruction as he had into everything else he had done his whole life. Cyndi left, preserving herself and protecting their son. Larry tried to keep the house and moved in roommates but eventually had to let it go. We all worried about the environment Larry was exposing his son to, and the decisions he was making. At one point I called him, furious because I heard that he was keeping a live rattlesnake in a glass coffee table enclosure in a small rental house he was sharing with a new very young girlfriend. He promised me he would let it go, but told me he had it under control and I was silly to worry about it."}, {"20c4": "We felt helpless to catch his fall, to stop this man who had always been so headstrong from moving full-force to destroying his whole life. His children grew bitter and one day, I got a frantic phone call from Cyndi, begging me to confront Larry. She was certain he was using drugs — not just oxycontin — but something much stronger. She said he was thin beyond recognition and she knew it was just a matter of time until he died."}, {"1872": "Myke had by this time built a remarkable life for himself — and was one of the most well-respected celebrity tattoo artists in the US. His meteoric rise had been centered around his determination to help others climb out of the darkness he had lived in — his remarkable story inspired legions of fans and he personally reached out and helped hundreds get clean. But Larry, still holding on to his image as the law-and-order good son, refused to admit he had a problem."}, {"c21e": "This next part went both so very slowly and much too quickly — and will be familiar to anyone who has ever struggled with a family member caught in addiction: scenes of all of us begging Larry to get help, texting him frequently offering rehab, flying into town to confront him, arguing with my mother and sister about whether he was using prescription drugs or meth or heroin, watching him descend further and further down."}, {"d250": "One of the last times I saw Larry — over three years ago now— I cried and said goodbye. The once 250 pound man was now a skeleton. His front teeth were gone. He terrified me. And it saddened me to my core because I thought he was a dead man walking, because he was much too proud to ever face what he had become. He would not be shaken enough by his condition to ever get clean, because he would deny it forever."}, {"b96b": "He finally admitted he was on too many prescription drugs but nothing stronger. He was shaken by my tearful goodbye, enough to go to his doctor and tell him that he wanted to “cut down” on the prescription meds. I know only because he called me and put the entire exchange on speaker phone. But I knew that was just for show, to try to prove that he wasn’t a street drug criminal and convince me that he was still the good son. Even without teeth and weighing a fraction of a normal weight, he was still trying to manage my impression of him."}, {"19fa": "As anyone who has dealt with this knows, it only ends in one of two places: death or prison."}, {"919c": "Last Friday, I landed from a trip to Europe to a text from Myke, with a link to a news story."}, {"df6f": "And this is as far as this story goes for now. Caught with stolen guns and meth — and facing many many years behind bars. I don’t know details beyond what I read online. What we do know is that the address where the guns were stolen was down the street from Larry’s old house. He knew the man who owned them."}, {"cc53": "My brother is technically not deceased. But I feel as though the person he once was isn’t recognizable as the man in that photo. To have such a dramatic reversal of circumstance is like a death in many ways. It is shocking and sickening and sad."}, {"7211": "I am deeply sorry for the pain he has caused — and for the pain he is clearly in. I would do anything to change what has happened and make everything right for him, his family, the people affected by the monster he has become."}, {"ccd0": "I was not planning to write anything about this because I know it hurts his kids to know how public this has already become in their small hometown. But when I read the articles about him — and made the terrible mistake of clicking down to read the comments — I needed to respond to the people who casually typed things like “Deport this scum” or “This guy should be shot 39 times.”"}, {"76de": "Behind every one of these stories of a terrible fall into addiction is someone who once had dreams and hopes and plans just like yours. He is a brother, a father, was once a cherished husband. He is still a much loved son by a mother who has had her heart broken more than once by the children she raised."}, {"e107": "His is a story of a fall from grace, pride, addiction, pharma corporate greed, American ambition, military aggression, small town politics, economic depression, few options due to lack of education, and more. It’s a story of far too many people now, one of our particular time in history."}, {"6753": "But it’s also the story of a single human life, a person I love and mourn with every fiber of my heart. He’s not just another junkie on the street, a skeleton without a conscience. None of them are. Somewhere in there, in those sad clouded hazel eyes, my brother is alive. And for now, I’m speaking for him until maybe one day, he’ll speak again for himself."}], "child": "860_1\t860_2\t860_3\t860_4\t860_5\t860_6\t860_7\t860_8\t860_9\t860_10"}