{"name": "861", "parent": "", "content": "When You Can Say “I Have No More Time Allotted for Work” The Washington Post profiles Dutch parenting and Dutch workplaces. Yes, even though I am a single adult without children, I still immediately clicked on this story about how to raise happy children the Dutch way: Opinion | The key to raising happy kids? The latest trend says do as the Dutch do.What's wrong with the American way of parenting?www.washingtonpost.com I’m always fascinated by different parenting styles—I read Bringing Up Bébé: One American Mother Discovers the Wisdom of French Parenting when it came out in 2012—and I just put a library hold on the book featured in this article: The Happiest Kids in the World: How Dutch Parents Help Their Kids (and Themselves) by Doing Less. But this post isn’t about parenting. It’s about these three sentences, tantalizingly placed halfway down the article: A telling anecdote comes from the American professors behind that two-hour sleep-gap study. When they were collecting data in the Netherlands, they realized they needed a few extra interviews with Dutch families. But their Dutch research assistants refused to help them with any additional tasks: They had no more time allotted for work. THEY HAD NO MORE TIME ALLOTTED FOR WORK. They could say no to scope creep, or poor planning, or that whole “maybe we could make our study a little better if we added just three more interviews” thing. (Yes, I’m aware that there might have been a legitimate reason for needing more data.) It’s also worth noting the power imbalance in this relationship; research assistants—any kind of assistants—in America are often expected to go the extra mile, stay the extra hour, prove that they’re willing to do anything their bosses need. It’s the cost of entry into the profession; something we pay back in exchange for the privilege of having a job. But, even despite the power imbalance, the Dutch assistants still had the power to say no. This is where I acknowledge that I have no idea what went into this situation beyond the three sentences I read in the Washington Post—and, like parents who might read The Happiest Kids in the World and assume that “Dutch-style parenting” is the way to go, there are a lot of additional factors that most of us either won’t consider or won’t have the cultural understanding to consider since… you know… most of us aren’t actually Dutch. But I think we’d all like to be able to say “I have no more time allotted for work” sometimes. ", "title": "When You Can Say “I Have No More Time Allotted for Work”", "sentences": [{"bbf8": "When You Can Say “I Have No More Time Allotted for Work”"}, {"8577": "The Washington Post profiles Dutch parenting and Dutch workplaces."}, {"4271": "Yes, even though I am a single adult without children, I still immediately clicked on this story about how to raise happy children the Dutch way:"}, {"435d": "Opinion | The key to raising happy kids? The latest trend says do as the Dutch do.What's wrong with the American way of parenting?www.washingtonpost.com"}, {"93e1": "I’m always fascinated by different parenting styles—I read Bringing Up Bébé: One American Mother Discovers the Wisdom of French Parenting when it came out in 2012—and I just put a library hold on the book featured in this article: The Happiest Kids in the World: How Dutch Parents Help Their Kids (and Themselves) by Doing Less."}, {"37d3": "But this post isn’t about parenting. It’s about these three sentences, tantalizingly placed halfway down the article:"}, {"1ab1": "A telling anecdote comes from the American professors behind that two-hour sleep-gap study. When they were collecting data in the Netherlands, they realized they needed a few extra interviews with Dutch families. But their Dutch research assistants refused to help them with any additional tasks: They had no more time allotted for work."}, {"0c84": "THEY HAD NO MORE TIME ALLOTTED FOR WORK."}, {"d42b": "They could say no to scope creep, or poor planning, or that whole “maybe we could make our study a little better if we added just three more interviews” thing. (Yes, I’m aware that there might have been a legitimate reason for needing more data.)"}, {"7d28": "It’s also worth noting the power imbalance in this relationship; research assistants—any kind of assistants—in America are often expected to go the extra mile, stay the extra hour, prove that they’re willing to do anything their bosses need. It’s the cost of entry into the profession; something we pay back in exchange for the privilege of having a job."}, {"3665": "But, even despite the power imbalance, the Dutch assistants still had the power to say no."}, {"d164": "This is where I acknowledge that I have no idea what went into this situation beyond the three sentences I read in the Washington Post—and, like parents who might read The Happiest Kids in the World and assume that “Dutch-style parenting” is the way to go, there are a lot of additional factors that most of us either won’t consider or won’t have the cultural understanding to consider since… you know… most of us aren’t actually Dutch."}, {"f321": "But I think we’d all like to be able to say “I have no more time allotted for work” sometimes."}], "child": "861_1\t861_2\t861_3\t861_4\t861_5\t861_6\t861_7\t861_8"}