{"name": "864", "parent": "", "content": "Remembering His House James Baldwin’s Niece Writes About the Fight to Save her late Uncle’s Former Home in St. Paul de Vence. Photo Credit — Kali-Ma Nazarene There has been a quiet fire burning for several decades involving the former home of my late uncle, James Baldwin. His former respite, located in Saint Paul du Vence in the south of France, is now owned by a development company, which purchased the property with the idea of building luxury villas. I don’t think the developers — or any of us, for that matter — anticipated the fact that Uncle Jimmy would rise to the status of resurrected saint. His popularity among a new generation who are discovering his work has led to everything from academic conferences in the United States and abroad to a yearlong celebration dedicated to examining his oft-ignored contribution to the American literary Canon and his influence on artists of various types. My uncle is experiencing a renaissance of sorts that is similar to the one that occurred in the 90s involving the life of his friend and fellow freedom fighter Malcolm X. The resurgence in his popularity has caught many by surprise, as zeitgeists are often difficult to foresee or measure. Hence, it is causing a frenzy as newly dubbed “Baldwinites” make a mad dash to preserve what they feel is an important part of his legacy-the house in which he lived and wrote. This new generation is equipped with the ability to create entire movements overnight on the internet, such as the one that seems to be causing a dilemma for the developers who now own the home. The idea to turn my uncle’s former home into a writer’s retreat and monument to his work is not new. Many of us second generation Baldwins have thought about it and even discussed the idea with the older generation. After we lost the years-long court battle to one Madam Bazzini, the idea was never met with a sense of urgency. My mother Gloria — the executor of the estate tried desperately to save the house from this alleged ‘heir’ of the owner, Madame Faure, who bequeathed the house to my uncle for the “continuation of his life’s work.” The entire process was painful and debilitating, to say the least, especially since none of us were French citizens, spoke French, or planned on living in France. We fought for something that we knew was rightfully ours, but at the time felt hard to lay claim. In our eyes, even though my uncle left the US and moved to France in his early 20’s, and before his death received the prestigious Legion of Honor, France’s highest civilian honor, he still remained a son of Harlem. His mother, my grandmother, to whom Madame Faure left the house, was a Black woman, former domestic from the eastern shore of Maryland, who raised her family in Harlem. She knew of France and that my uncle found peace and was able to write there. Aside from the stories that her children brought back to her of this lovely place to which Uncle Jimmy brought a piece of Harlem, there was really no other connection for her. Many of us, my aunts, uncles, cousins, and parents, traveled there and spent time with Uncle Jimmy and Uncle David and the many colorful guests who dined at “The Welcome Table.” We knew that we always had a place to go and viewed it as our place too. This was mostly due to the fact that he was there. His presence was essential and it was what made the place special to us as well as those who traveled from near and far to be with him. His place in Provence was not just his place, it was a communal place, where family, friends, lovers, confidants and fellow artists could share stories, break bread together, drink, and yes party! It was a very special place. This home represents a continuation of a Black tradition, begun in the South, brought to the North and spread through The Great Migration. That tradition was rooted in extended family and the practice of taking in travelers mid-journey, feeding those who stopped in, and giving them a place to lay their weary heads. It was my uncle’s way of recreating what he was forced to painfully leave behind in order to find peace. Growing up in a similar environment and having my grandmother and extended family present, I am very aware of the magic that existed in his villa in St. Paul because it was the same at 46 W. 131st and 137 W. 71st Streets. This why the town’s people welcomed the stranger in their midst. There was a sense that he belonged, because he too was raised in a village, that of Harlem. He took a piece of that with him wherever he went. Now that the endeavor to save this home has reached somewhat of a feverish pitch with petitions, websites, and even pilgrimages being made, I think it is important to think about what is truly at stake here and if the people involved in these activities understand fully who my uncle truly was. I ask that those who think they are preserving his legacy by collecting money with the desire to try and recreate his sacred dwelling to consider that he was more than just a literary icon. He was a man who deeply loved his family and always came home to visit. He was someone who practiced a very high level of integrity and cautioned his fellow artists about the importance of such practice when he penned the essay The Artist’s Struggle for Integrity. He didn’t step over others in order to get to where he felt he wanted to go. He was not interested in fame. He had a calling to respond to and the words that he so eloquently wrote remain prescient. He wanted most of all to be able to care for his family, especially his mother, my grandmother Berdis with whom he shared an indelible bond. I can tell you without doubt that he would never approve of the drive to save his former home without his family’s acknowledgement, blessing, and input. He would have considered these unauthorized campaigns a slap in the face to everything for which he stood. He understood that, in his own words, he was “worth more dead than alive.” Now that his star has risen to shine a light on those stumbling in the darkness, it is imperative that both reverence and respect be shown for the entirety of his legacy, not just what some think should be preserved. It is also of utmost importance that in a mad dash to preserve something seen as worthy of saving, that something else is not destroyed in the process. To quote scripture “You cannot serve two masters. For you will either hate one and love the other.” So many claim to love James Baldwin. If so, one has to walk the talk as he did. Allow his writing to become the transformative force that it was meant to be and simply ask yourselves “What would James Baldwin do?” What would he do faced with a situation like this? Certain people feel that his family is irrelevant, which is understandable because their interactions with The Estate of James Baldwin have not yielded the results that they sought in a desired time frame. We are dealing with generational differences and yes, intergenerational trauma. But please, do not take that to mean that loved ones who stand as a vanguard to protect what we deem sacred do not exist. We are the living estate. Not only was my uncle a patriarch but someone who gave many of us in the younger generation a way and a means of existing in complete fullness and with freedom. He told us, “Your crown is already bought and paid for. All you have to do is wear it.” We take those sacrifices very seriously and we wear our crowns with great pride and dignity. Although you may claim to not know who we are — we are here gatekeeping. In most ancient African spiritual traditions — it is acknowledged that those who have crossed over continue to exist amongst us and are ever present, helping to guide us. We feel and acknowledge their presences as well as give them due respect. This may be hard to grasp for those who do not follow this tradition but for us — James Arthur Baldwin lives on in our hearts and minds as part of us and we hold him in the highest esteem. He is not a cottage industry for those who seek to lay claim to his genius. Honor him, yes. Continue his work, yes. Write like him, if you must. Hijack his legacy and claim to be a disciple for your own means and purposes — no. It’s simple — if you seek to save something that you feel is important, there are methods that embrace all that he stood for that reach far beyond a cause celebre. There is so much history and personal memories that surround his former dwelling that it would behoove those interested in saving his former home to look into those stories. The bearers and witnesses of those stories are here and are willing to share if you come correct. ", "title": "Remembering His House", "sentences": [{"b56a": "Remembering His House"}, {"8130": "James Baldwin’s Niece Writes About the Fight to Save her late Uncle’s Former Home in St. Paul de Vence."}, {"bcbb": "Photo Credit — Kali-Ma Nazarene"}, {"db63": "There has been a quiet fire burning for several decades involving the former home of my late uncle, James Baldwin. His former respite, located in Saint Paul du Vence in the south of France, is now owned by a development company, which purchased the property with the idea of building luxury villas. I don’t think the developers — or any of us, for that matter — anticipated the fact that Uncle Jimmy would rise to the status of resurrected saint."}, {"2b9f": "His popularity among a new generation who are discovering his work has led to everything from academic conferences in the United States and abroad to a yearlong celebration dedicated to examining his oft-ignored contribution to the American literary Canon and his influence on artists of various types. My uncle is experiencing a renaissance of sorts that is similar to the one that occurred in the 90s involving the life of his friend and fellow freedom fighter Malcolm X."}, {"3da2": "The resurgence in his popularity has caught many by surprise, as zeitgeists are often difficult to foresee or measure. Hence, it is causing a frenzy as newly dubbed “Baldwinites” make a mad dash to preserve what they feel is an important part of his legacy-the house in which he lived and wrote. This new generation is equipped with the ability to create entire movements overnight on the internet, such as the one that seems to be causing a dilemma for the developers who now own the home."}, {"ad4f": "The idea to turn my uncle’s former home into a writer’s retreat and monument to his work is not new. Many of us second generation Baldwins have thought about it and even discussed the idea with the older generation. After we lost the years-long court battle to one Madam Bazzini, the idea was never met with a sense of urgency."}, {"0d0c": "My mother Gloria — the executor of the estate tried desperately to save the house from this alleged ‘heir’ of the owner, Madame Faure, who bequeathed the house to my uncle for the “continuation of his life’s work.” The entire process was painful and debilitating, to say the least, especially since none of us were French citizens, spoke French, or planned on living in France. We fought for something that we knew was rightfully ours, but at the time felt hard to lay claim. In our eyes, even though my uncle left the US and moved to France in his early 20’s, and before his death received the prestigious Legion of Honor, France’s highest civilian honor, he still remained a son of Harlem."}, {"ba46": "His mother, my grandmother, to whom Madame Faure left the house, was a Black woman, former domestic from the eastern shore of Maryland, who raised her family in Harlem. She knew of France and that my uncle found peace and was able to write there. Aside from the stories that her children brought back to her of this lovely place to which Uncle Jimmy brought a piece of Harlem, there was really no other connection for her."}, {"26fa": "Many of us, my aunts, uncles, cousins, and parents, traveled there and spent time with Uncle Jimmy and Uncle David and the many colorful guests who dined at “The Welcome Table.” We knew that we always had a place to go and viewed it as our place too. This was mostly due to the fact that he was there. His presence was essential and it was what made the place special to us as well as those who traveled from near and far to be with him. His place in Provence was not just his place, it was a communal place, where family, friends, lovers, confidants and fellow artists could share stories, break bread together, drink, and yes party! It was a very special place."}, {"101c": "This home represents a continuation of a Black tradition, begun in the South, brought to the North and spread through The Great Migration. That tradition was rooted in extended family and the practice of taking in travelers mid-journey, feeding those who stopped in, and giving them a place to lay their weary heads. It was my uncle’s way of recreating what he was forced to painfully leave behind in order to find peace."}, {"1e02": "Growing up in a similar environment and having my grandmother and extended family present, I am very aware of the magic that existed in his villa in St. Paul because it was the same at 46 W. 131st and 137 W. 71st Streets. This why the town’s people welcomed the stranger in their midst. There was a sense that he belonged, because he too was raised in a village, that of Harlem. He took a piece of that with him wherever he went."}, {"6594": "Now that the endeavor to save this home has reached somewhat of a feverish pitch with petitions, websites, and even pilgrimages being made, I think it is important to think about what is truly at stake here and if the people involved in these activities understand fully who my uncle truly was."}, {"fe4a": "I ask that those who think they are preserving his legacy by collecting money with the desire to try and recreate his sacred dwelling to consider that he was more than just a literary icon. He was a man who deeply loved his family and always came home to visit. He was someone who practiced a very high level of integrity and cautioned his fellow artists about the importance of such practice when he penned the essay The Artist’s Struggle for Integrity. He didn’t step over others in order to get to where he felt he wanted to go. He was not interested in fame. He had a calling to respond to and the words that he so eloquently wrote remain prescient. He wanted most of all to be able to care for his family, especially his mother, my grandmother Berdis with whom he shared an indelible bond."}, {"b420": "I can tell you without doubt that he would never approve of the drive to save his former home without his family’s acknowledgement, blessing, and input. He would have considered these unauthorized campaigns a slap in the face to everything for which he stood. He understood that, in his own words, he was “worth more dead than alive.” Now that his star has risen to shine a light on those stumbling in the darkness, it is imperative that both reverence and respect be shown for the entirety of his legacy, not just what some think should be preserved."}, {"d251": "It is also of utmost importance that in a mad dash to preserve something seen as worthy of saving, that something else is not destroyed in the process. To quote scripture “You cannot serve two masters. For you will either hate one and love the other.” So many claim to love James Baldwin. If so, one has to walk the talk as he did. Allow his writing to become the transformative force that it was meant to be and simply ask yourselves “What would James Baldwin do?” What would he do faced with a situation like this?"}, {"152a": "Certain people feel that his family is irrelevant, which is understandable because their interactions with The Estate of James Baldwin have not yielded the results that they sought in a desired time frame. We are dealing with generational differences and yes, intergenerational trauma. But please, do not take that to mean that loved ones who stand as a vanguard to protect what we deem sacred do not exist. We are the living estate. Not only was my uncle a patriarch but someone who gave many of us in the younger generation a way and a means of existing in complete fullness and with freedom."}, {"6e95": "He told us, “Your crown is already bought and paid for. All you have to do is wear it.” We take those sacrifices very seriously and we wear our crowns with great pride and dignity. Although you may claim to not know who we are — we are here gatekeeping."}, {"e8f7": "In most ancient African spiritual traditions — it is acknowledged that those who have crossed over continue to exist amongst us and are ever present, helping to guide us. We feel and acknowledge their presences as well as give them due respect. This may be hard to grasp for those who do not follow this tradition but for us — James Arthur Baldwin lives on in our hearts and minds as part of us and we hold him in the highest esteem. He is not a cottage industry for those who seek to lay claim to his genius. Honor him, yes. Continue his work, yes. Write like him, if you must. Hijack his legacy and claim to be a disciple for your own means and purposes — no."}, {"a145": "It’s simple — if you seek to save something that you feel is important, there are methods that embrace all that he stood for that reach far beyond a cause celebre. There is so much history and personal memories that surround his former dwelling that it would behoove those interested in saving his former home to look into those stories. The bearers and witnesses of those stories are here and are willing to share if you come correct."}], "child": "864_1\t864_2"}