{"name": "866", "parent": "", "content": "Gritty and gripping photos of the NYC subway at its most dangerous Watch the closing doors, but they may be the least of your worries New York City in the 1980s. Back in the day. The die-hard era. Much about that decade gets romanticized. And we hear you: the city was realer pre-Giuliani, pre-Dinkins. Or maybe just before the 20th century turned everyone soft. When photographer Brian Young arrived in New York in 1984, the city was still shaking from the previous decade’s fiscal crisis. Streets were littered with burned out cars and soot-stained buildings. Muggings were a way of life. The subway system, once heralded as the world’s largest, was sputtering after two decades of neglect. Service reliability was at a tenth of where it was in the 60s, and budgetary woes had led to closed lines, deferred maintenance, and a shortage of repairmen. “It was a bleak time; it was Gotham,” writes Young in the introduction to his 2016 book, The Train, NYC 1984. © Brian Young/Damiani Young may have been new to town, but the Canadian was undeterred by New York’s gritty underground. And descending into the infamous subway system provided an opportunity for new kinds of photographs. Atmospheric, brutal, anxiety-ridden, Young’s pictures relay the dirt-caked textures he found there—steel and skin. His images are rough, refreshingly resistant of the preciousness which plagues so much New York street photography of the time. Any number of snappers could have entered the fray of Manhattan that year seeking to recreate the “decisive” moments of their photographic idols. Young went the other way, ladening his pictures with frenetic indecision. His are grainy odes to the sights, sounds, and smells of a subway system where any sane person would feel afraid to point a camera. But things were about to change. The next year an $18 billion rehabilitation program would kick into high gear. Train cars got air conditioning, tracks were repaired. Policing was increased. Most dramatically, a massive anti-graffiti initiative began. By 1989 the rolling stock would be scrubbed clean and resurfaced as graffiti-proof—the first stop on its way to the gleaming, approachable metro system it is today. All photographs from The Train, NYC 1984 by Brian Young, published by Damiani. “From where I stood and watched the trains pull in and out I thought, how could a human being have his name on every car.” — Zephyr, graffiti writer, ‘Style Wars’ (1983) © Brian Young/Damiani “The object is more. Not the biggest and the beautifulest, but more. A little piece on every car is what counts.” — Cap, graffiti writer, ‘Style Wars’ (1983) “New York is a city that will be replaced by another city.” — Rem Koolhaas ", "title": "Gritty and gripping photos of the NYC subway at its most dangerous", "sentences": [{"a1b5": "Gritty and gripping photos of the NYC subway at its most dangerous"}, {"8b53": "Watch the closing doors, but they may be the least of your worries"}, {"d323": "New York City in the 1980s. Back in the day. The die-hard era. Much about that decade gets romanticized. And we hear you: the city was realer pre-Giuliani, pre-Dinkins. Or maybe just before the 20th century turned everyone soft."}, {"9006": "When photographer Brian Young arrived in New York in 1984, the city was still shaking from the previous decade’s fiscal crisis. Streets were littered with burned out cars and soot-stained buildings. Muggings were a way of life. The subway system, once heralded as the world’s largest, was sputtering after two decades of neglect. Service reliability was at a tenth of where it was in the 60s, and budgetary woes had led to closed lines, deferred maintenance, and a shortage of repairmen. “It was a bleak time; it was Gotham,” writes Young in the introduction to his 2016 book, The Train, NYC 1984."}, {"7178": "© Brian Young/Damiani"}, {"7940": "Young may have been new to town, but the Canadian was undeterred by New York’s gritty underground. And descending into the infamous subway system provided an opportunity for new kinds of photographs. Atmospheric, brutal, anxiety-ridden, Young’s pictures relay the dirt-caked textures he found there—steel and skin. His images are rough, refreshingly resistant of the preciousness which plagues so much New York street photography of the time. Any number of snappers could have entered the fray of Manhattan that year seeking to recreate the “decisive” moments of their photographic idols. Young went the other way, ladening his pictures with frenetic indecision. His are grainy odes to the sights, sounds, and smells of a subway system where any sane person would feel afraid to point a camera."}, {"2085": "But things were about to change. The next year an $18 billion rehabilitation program would kick into high gear. Train cars got air conditioning, tracks were repaired. Policing was increased. Most dramatically, a massive anti-graffiti initiative began. By 1989 the rolling stock would be scrubbed clean and resurfaced as graffiti-proof—the first stop on its way to the gleaming, approachable metro system it is today."}, {"9041": "All photographs from The Train, NYC 1984 by Brian Young, published by Damiani."}, {"1981": "“From where I stood and watched the trains pull in and out I thought, how could a human being have his name on every car.”"}, {"6577": "— Zephyr, graffiti writer, ‘Style Wars’ (1983)"}, {"5c75": "© Brian Young/Damiani"}, {"86dd": "“The object is more. Not the biggest and the beautifulest, but more. A little piece on every car is what counts.”"}, {"1015": "— Cap, graffiti writer, ‘Style Wars’ (1983)"}, {"a9c1": "“New York is a city that will be replaced by another city.”"}, {"c30d": "— Rem Koolhaas"}], "child": "866_1866_1"}