{"name": "868", "parent": "", "content": "Introducing My New Erudite Blog About Moving To New York City And Being Single And Different From Everyone I Went to High School With And Just Very Sarcastic And Interesting I’m Not Just Another Girl In NYC. My name is Laura, I’m 23, but I am going by Lor now. I am interesting and quirky because my hair is brown and I am dating a lot and am quirky!!!!!!!!! I know this is going to sound pretty quirky and off the wall, but I have wanted to live in New York City since I was a teenager. I always knew I was different from all the other harpies in my central Jersey town. They were all so small-minded, but I cared about big ideas. They wanted to gossip, but I wanted real conversations. They read makeup magazines and I read real books, and not the vampire crap. They watched Jersey Shore, and I watched Daria and hated Jersey Shore. They shopped at Forever 21, but I shopped at H&M. Plus, they were a bunch of backstabbing wh*res, and I was a feminist, interested in the big picture and adventuring out in the big wide world. Suffice to say….my upbringing was extremely stifling. I lived in one of those suburban neighborhoods where every house looked the same. If I had to stay there another minute, I might die of boredom. …I shudder to think I actually grew up in a place this facile and petty and full of the same ideas over and over. Unless you grew up in one of those places, you can’t imagine the unendurable suffering, where everyone was so perfect but I just wanted to listen to music on my headphones and read a real book of short stories or poetry. That’s why last year, when I graduated from college, I knew I didn’t have it in me to move back there. That’s right. Unlike much of my generation, I did whatever I could to not move home. To not be another person living in her parents’ basement. It would be simply too hard from being an independent, free-spirited college student who also cares about world issues, to going back to a shitty suburban town where everyone votes for those Republicans and only cares about “the next big purse” on sale at a designer store, or at WalMart. I think it would have destroyed me. So I did what I call the brave thing: with almost nothing to my name (except the $3,000 college graduation gift from my parents) I packed my things up in the used 2009 Volkswagon Rabbit I got for high school graduation, and drove the endless-seeming 45 minutes from my parents’ house to Brooklyn. I faced a lot of adversities but… it was worth it. And there’s a lot of fakes (and “phonies” — Catcher in the Rye, anyone? Read it?) here but nearly as many as there are in suburbia hell. New York is the place after college that really unlocked the soul of me. I foresook the trivial suburban comforts of my peers and moved into an apartment in Bushwick, Brooklyn, the sort of place that would scare most of the girls I went to high school with but I really like it. I paid for it myself and cover my own rent except my parents paid the first-last-security. But really I doubt the whor*s from high school could even write the check on their own. They would not know what to do and would turn their prissy noses up. My neighborhood is so so sketchy but it is perfect for me. You do have to be careful but it feels “real old New York like from the 70s.” It has a certain grittiness to it… a certain realness… I’m one of the only white girls in my neighborhood, and while I don’t think that this makes me special, per se, it does make me different and interesting and a little more “real” in a lot of ways. I don’t really talk to any of my neighbors (except for my friends who I will talk about in a future post) but I think sitting near people who are different from me has given me something of a “big picture” type of “worldview.” I’ve been here almost a year now, coming up on my 23rd birthday, and decided that: this is the time of my life. And also, I imagine a lot of people back home are wondering what I am up to and are asking my mom about it in the grocery store: “Oh, what is Laura up to?” Well foremost I want to correct them that I am Lor, Laura is the name my parents chose for me but Lor is the name I chose for myself. And also, I am a writer, a real writer. My college degree was in English and my minor was in Creative Writing, so I am a writer at heart. I am interested in getting a novel published one day, maybe a coming of age story about a girl who comes to New York with nothing and discovers facets of herself. But I really truly think my life would make an interesting book of personal essays and maybe eventually a TV show. Think of it as GIRLS but more down to earth and real, or Broad City with more realistic situations and a little bit more serious with more of a “wry” and “sarcastic” sensibility. Now. I bet you are wondering. “Laura, (although I am going by Lor now) Lor, why would I read a blog like this? You don’t seem very interesting up front. You’re just another girl in the big city.” And… can I just say… that’s so, so wrong. I’m the most interesting person who graduated from my high school in my year, possibly ever. But I think there are some critical things that separate me from the rest of the chaff blogs and cacophony of superficiality on apps such as instagram: (1) I have brown hair, not blonde or dyed. I am not superficially pretty like all the other fake girls in Brooklyn. I would never do “hombre” in my hair or colors or infantile attentions (2) I live in Bushwick, not Williamsburg. Williamsburg is all fake now but Bushwick is just, still, very, gritty. (3) I’m single! That’s right! I don’t have a boyfriend. I think it’s because I would rather eat snacks than eat a salad, and like pizza more than boys. Nonetheless, I am going on dates — Tinder dates of be specific — and I think a lot of people don’t understand what that’s like so, I have that interesting eye-opening kind of new perspective. There are a lot of fake girls on Tinder — but I am using it to find, what can I say, real love? And have good experiences. I am a romantic. (4) It’s about the writing. For me, I will be writing a lot, and also tackling some of the real questions. Don’t get me wrong: I am hyperattuned to the trivialities and the day to day. Low culture fascinates me from a critical standpoint of objectivity and remove — I view a lot of things intellectually as a “scholarly pursuit.” But I will also tackle real issues with liquidity and fluidity of prose and style. (5) But above all… I am relatable. I am down to earth and real and my real, down-to-earth voice will be relatable for a certain kind of dreamer who works hard and is also a little sarcastic. {1} Gosh, The Trains?I Bet You Never Even Notice The Trains In This Citymedium.com That’s me. A little snarky. A little imperfect. Unlike other girls, I am single, and don’t have my shit together. And my hair is brown and not dyed any colors…...and yes.….I wish there was a Tinder for pizza. I’m a bit of an introvert and my heart has actually been broken by the strain of the world I am holding in my non-manicured hands with chipped nailpolish I painted on myself. Black, not that it matters. I hope you’ll follow along with me. XOXO Lor ", "title": "Introducing My New Erudite Blog About Moving To New York City And Being Single And Different From Everyone I Went to High School With And Just Very Sarcastic And Interesting", "sentences": [{"3f5d": "Introducing My New Erudite Blog About Moving To New York City And Being Single And Different From Everyone I Went to High School With And Just Very Sarcastic And Interesting"}, {"7e66": "I’m Not Just Another Girl In NYC. My name is Laura, I’m 23, but I am going by Lor now. I am interesting and quirky because my hair is brown and I am dating a lot and am quirky!!!!!!!!!"}, {"13d6": "I know this is going to sound pretty quirky and off the wall, but I have wanted to live in New York City since I was a teenager. I always knew I was different from all the other harpies in my central Jersey town. They were all so small-minded, but I cared about big ideas. They wanted to gossip, but I wanted real conversations. They read makeup magazines and I read real books, and not the vampire crap. They watched Jersey Shore, and I watched Daria and hated Jersey Shore. They shopped at Forever 21, but I shopped at H&M. Plus, they were a bunch of backstabbing wh*res, and I was a feminist, interested in the big picture and adventuring out in the big wide world."}, {"f88b": "Suffice to say….my upbringing was extremely stifling. I lived in one of those suburban neighborhoods where every house looked the same. If I had to stay there another minute, I might die of boredom."}, {"ffa9": "…I shudder to think I actually grew up in a place this facile and petty and full of the same ideas over and over. Unless you grew up in one of those places, you can’t imagine the unendurable suffering, where everyone was so perfect but I just wanted to listen to music on my headphones and read a real book of short stories or poetry."}, {"e9cf": "That’s why last year, when I graduated from college, I knew I didn’t have it in me to move back there. That’s right. Unlike much of my generation, I did whatever I could to not move home. To not be another person living in her parents’ basement."}, {"7a29": "It would be simply too hard from being an independent, free-spirited college student who also cares about world issues, to going back to a shitty suburban town where everyone votes for those Republicans and only cares about “the next big purse” on sale at a designer store, or at WalMart."}, {"a138": "I think it would have destroyed me."}, {"c32c": "So I did what I call the brave thing: with almost nothing to my name (except the $3,000 college graduation gift from my parents) I packed my things up in the used 2009 Volkswagon Rabbit I got for high school graduation, and drove the endless-seeming 45 minutes from my parents’ house to Brooklyn."}, {"9452": "I faced a lot of adversities but… it was worth it. And there’s a lot of fakes (and “phonies” — Catcher in the Rye, anyone? Read it?) here but nearly as many as there are in suburbia hell."}, {"e36a": "New York is the place after college that really unlocked the soul of me. I foresook the trivial suburban comforts of my peers and moved into an apartment in Bushwick, Brooklyn, the sort of place that would scare most of the girls I went to high school with but I really like it. I paid for it myself and cover my own rent except my parents paid the first-last-security. But really I doubt the whor*s from high school could even write the check on their own. They would not know what to do and would turn their prissy noses up. My neighborhood is so so sketchy but it is perfect for me. You do have to be careful but it feels “real old New York like from the 70s.” It has a certain grittiness to it… a certain realness… I’m one of the only white girls in my neighborhood, and while I don’t think that this makes me special, per se, it does make me different and interesting and a little more “real” in a lot of ways. I don’t really talk to any of my neighbors (except for my friends who I will talk about in a future post) but I think sitting near people who are different from me has given me something of a “big picture” type of “worldview.”"}, {"f576": "I’ve been here almost a year now, coming up on my 23rd birthday, and decided that: this is the time of my life."}, {"a369": "And also, I imagine a lot of people back home are wondering what I am up to and are asking my mom about it in the grocery store: “Oh, what is Laura up to?” Well foremost I want to correct them that I am Lor, Laura is the name my parents chose for me but Lor is the name I chose for myself. And also, I am a writer, a real writer. My college degree was in English and my minor was in Creative Writing, so I am a writer at heart. I am interested in getting a novel published one day, maybe a coming of age story about a girl who comes to New York with nothing and discovers facets of herself. But I really truly think my life would make an interesting book of personal essays and maybe eventually a TV show. Think of it as GIRLS but more down to earth and real, or Broad City with more realistic situations and a little bit more serious with more of a “wry” and “sarcastic” sensibility."}, {"0498": "Now. I bet you are wondering. “Laura, (although I am going by Lor now) Lor, why would I read a blog like this? You don’t seem very interesting up front. You’re just another girl in the big city.”"}, {"f9cf": "And… can I just say… that’s so, so wrong. I’m the most interesting person who graduated from my high school in my year, possibly ever. But I think there are some critical things that separate me from the rest of the chaff blogs and cacophony of superficiality on apps such as instagram:"}, {"99a8": "(1) I have brown hair, not blonde or dyed. I am not superficially pretty like all the other fake girls in Brooklyn. I would never do “hombre” in my hair or colors or infantile attentions"}, {"fabd": "(2) I live in Bushwick, not Williamsburg. Williamsburg is all fake now but Bushwick is just, still, very, gritty."}, {"8c3a": "(3) I’m single! That’s right! I don’t have a boyfriend. I think it’s because I would rather eat snacks than eat a salad, and like pizza more than boys. Nonetheless, I am going on dates — Tinder dates of be specific — and I think a lot of people don’t understand what that’s like so, I have that interesting eye-opening kind of new perspective. There are a lot of fake girls on Tinder — but I am using it to find, what can I say, real love? And have good experiences. I am a romantic."}, {"ef78": "(4) It’s about the writing. For me, I will be writing a lot, and also tackling some of the real questions. Don’t get me wrong: I am hyperattuned to the trivialities and the day to day. Low culture fascinates me from a critical standpoint of objectivity and remove — I view a lot of things intellectually as a “scholarly pursuit.” But I will also tackle real issues with liquidity and fluidity of prose and style."}, {"b26f": "(5) But above all… I am relatable. I am down to earth and real and my real, down-to-earth voice will be relatable for a certain kind of dreamer who works hard and is also a little sarcastic."}, {"3d78": "{1} Gosh, The Trains?I Bet You Never Even Notice The Trains In This Citymedium.com"}, {"7b24": "That’s me. A little snarky. A little imperfect. Unlike other girls, I am single, and don’t have my shit together. And my hair is brown and not dyed any colors…...and yes.….I wish there was a Tinder for pizza. I’m a bit of an introvert and my heart has actually been broken by the strain of the world I am holding in my non-manicured hands with chipped nailpolish I painted on myself. Black, not that it matters. I hope you’ll follow along with me."}, {"9077": "XOXO Lor"}], "child": "868_1\t868_2\t868_3\t868_4"}