{"name": "869", "parent": "", "content": "LOL. Protesting is soooo much fun! Pepsi Issued an Apology, But It Was Only To Kendall Jenner Here’s what they should’ve said: So, there is no need to rehash the past 24 hours, and to be honest — I was determined not to even touch this mess for many reasons. Mainly because I’m convinced that my recent offerings have graphically illustrated why there is an intense disconnect between those whose lives matter, and those of us who have to fiercely fight for the exact same privilege. The folks at Pepsi did not accidentally dream up a socially conscious advertisement that aimed to evoke the vibes of “We Are The World” or any of the other campaigns that reached heights of recognition and appreciation. This was a thoroughly planned attack that featured a White supermodel/reality star/social media gem/Vogue ambassador — in the starring role of a musical that had the lives of dead Black children as the invisible but vividly poetic backdrop. Once the link to the ad started to circulate — shit hit the fan, and as with any situation that requires immediate action — there was a visceral reaction to a piece of work that was unbelievably vile in its delivery and pathetically generic in its tone. Pepsi eventually issued an apology or I guess what they consider to be the only way to atone for the sins of greed, ignorance and callousness. “Pepsi was trying to project a global message of unity, peace and understanding. Clearly we missed the mark, and we apologize. We did not intend to make light of any serious issue. We are removing the content and halting any further rollout. We also apologize for putting Kendall Jenner in this position.” So, after reading that shit— I felt compelled to give in to my urges. Pepsi basically apologized to Kendall Jenner, and failed to extend the courtesy beyond acknowledging that a fully grown adult who was paid handsomely for exploiting the delicate strings of #BlackLivesMatter— was unknowingly comprised by a company that did very little to coerce her participation. Hours before the ill-fated premiere — Jenner and her momager teased about the ad’s arrival by boasting the fact that this will be the first major collaboration between Pepsi and a supermodel since Cindy Crawford’s entry back in 1992. Of course the mother and daughter duo have since removed any evidence of referencing how psyched they were that Kendall had been erected — “Cindy” of the modern era. Cowards. The point is that Kendall Jenner isn’t a young activist or even someone who cares at all about the racial strife in the country that has made her very rich and extremely likable. She fills her timeline and sheets of adulation with tweets and shares — that focus solely on the high profile and glamorous projects that have either already been tackled or are waiting to be devoured. She is just another number in the crowd of handpicked socialites who have the ability to give vultures another incentive to pollute their portfolios with the expectation that once the name is attached — the money train will be stalled long enough to empty the gold — as they begin the search for the other White girl with the globally mandated template — that is also up for the assignment of playing make-believe in the midst of real life woes. Pepsi will not be the last company to pretend that the idea of mocking societal mishaps for the sake of the almighty dollar was just an innocent plea for world peace. Before all hell broke loose — the company verified that: “Kendall is the latest impactful line-up of global icons to work with Pepsi and she exemplifies owning ‘Live for Now’ moments.” Call me crazy but there is zero evidence that Kendall Jenner is globally impactful other than the fact that she is quite savvy at managing a ton of makeup and yards of tulle like a pro. The worst part of this mess has to be the realization that Black Lives will most likely never Matter in my lifetime. The natural order of things dictates that if you are far removed from other people’s suffering — it will take your adherence to empathy and a strong desire to connect with mankind in order for you to be able to fathom what is happening outside the walls of your relatively stable existence. The now dazed and confused executives at Pepsi are not sorry for what they did. They are pissed at all the revenue that is currently filtering down the drain. They could give less than a damn about the fuck up they offered to the activists who willingly surrender their lives to what continues to seem like a lost cause. In order to be remorseful — there has to be an overwhelmingly heartfelt salute to the heart of the matter, which was coldly ripped apart by the misguided notion that you can be globally relevant by turning a social movement into a Milllennial-infused street fair with the regulatory White mascot: If Pepsi truly felt like shit about what just went down — here’s what we would have read: Pepsi truly and deeply extends a heartfelt apology to all those who were offended by what was clearly a glaring lack in judgment. We pride ourselves as a company that always strives for excellence, and in the quest to maintain this mission, we misrepresented our best intentions, which regrettably has led to a dire misunderstanding at the expense of individuals and organizations that are heralded for their adherence to justice and the never ending quest for basic rights — for all. Pepsi remains firmly in support of those endeavors and will strive to prove that pledge through future actions. Again, we are terribly sorry and are truly remorseful about the outcome of our embarrassing actions. We will make it our endearing mission to overcome our unfortunate mishap. Now, that’s an apology. ", "title": "Pepsi Issued an Apology, But It Was Only To Kendall Jenner", "sentences": [{"ece0": "LOL. Protesting is soooo much fun!"}, {"cbd8": "Pepsi Issued an Apology, But It Was Only To Kendall Jenner"}, {"9454": "Here’s what they should’ve said:"}, {"71e8": "So, there is no need to rehash the past 24 hours, and to be honest — I was determined not to even touch this mess for many reasons."}, {"2d77": "Mainly because I’m convinced that my recent offerings have graphically illustrated why there is an intense disconnect between those whose lives matter, and those of us who have to fiercely fight for the exact same privilege."}, {"9c87": "The folks at Pepsi did not accidentally dream up a socially conscious advertisement that aimed to evoke the vibes of “We Are The World” or any of the other campaigns that reached heights of recognition and appreciation."}, {"22ee": "This was a thoroughly planned attack that featured a White supermodel/reality star/social media gem/Vogue ambassador — in the starring role of a musical that had the lives of dead Black children as the invisible but vividly poetic backdrop."}, {"cf74": "Once the link to the ad started to circulate — shit hit the fan, and as with any situation that requires immediate action — there was a visceral reaction to a piece of work that was unbelievably vile in its delivery and pathetically generic in its tone."}, {"2555": "Pepsi eventually issued an apology or I guess what they consider to be the only way to atone for the sins of greed, ignorance and callousness."}, {"76bf": "“Pepsi was trying to project a global message of unity, peace and understanding. Clearly we missed the mark, and we apologize. We did not intend to make light of any serious issue. We are removing the content and halting any further rollout. We also apologize for putting Kendall Jenner in this position.”"}, {"4cee": "So, after reading that shit— I felt compelled to give in to my urges."}, {"3ea0": "Pepsi basically apologized to Kendall Jenner, and failed to extend the courtesy beyond acknowledging that a fully grown adult who was paid handsomely for exploiting the delicate strings of #BlackLivesMatter— was unknowingly comprised by a company that did very little to coerce her participation."}, {"ce33": "Hours before the ill-fated premiere — Jenner and her momager teased about the ad’s arrival by boasting the fact that this will be the first major collaboration between Pepsi and a supermodel since Cindy Crawford’s entry back in 1992."}, {"83db": "Of course the mother and daughter duo have since removed any evidence of referencing how psyched they were that Kendall had been erected — “Cindy” of the modern era."}, {"7e7d": "Cowards."}, {"7b07": "The point is that Kendall Jenner isn’t a young activist or even someone who cares at all about the racial strife in the country that has made her very rich and extremely likable. She fills her timeline and sheets of adulation with tweets and shares — that focus solely on the high profile and glamorous projects that have either already been tackled or are waiting to be devoured."}, {"56d8": "She is just another number in the crowd of handpicked socialites who have the ability to give vultures another incentive to pollute their portfolios with the expectation that once the name is attached — the money train will be stalled long enough to empty the gold — as they begin the search for the other White girl with the globally mandated template — that is also up for the assignment of playing make-believe in the midst of real life woes."}, {"a4ed": "Pepsi will not be the last company to pretend that the idea of mocking societal mishaps for the sake of the almighty dollar was just an innocent plea for world peace."}, {"1753": "Before all hell broke loose — the company verified that: “Kendall is the latest impactful line-up of global icons to work with Pepsi and she exemplifies owning ‘Live for Now’ moments.”"}, {"1fbd": "Call me crazy but there is zero evidence that Kendall Jenner is globally impactful other than the fact that she is quite savvy at managing a ton of makeup and yards of tulle like a pro."}, {"02d1": "The worst part of this mess has to be the realization that Black Lives will most likely never Matter in my lifetime."}, {"374b": "The natural order of things dictates that if you are far removed from other people’s suffering — it will take your adherence to empathy and a strong desire to connect with mankind in order for you to be able to fathom what is happening outside the walls of your relatively stable existence."}, {"0622": "The now dazed and confused executives at Pepsi are not sorry for what they did. They are pissed at all the revenue that is currently filtering down the drain."}, {"38d7": "They could give less than a damn about the fuck up they offered to the activists who willingly surrender their lives to what continues to seem like a lost cause."}, {"5487": "In order to be remorseful — there has to be an overwhelmingly heartfelt salute to the heart of the matter, which was coldly ripped apart by the misguided notion that you can be globally relevant by turning a social movement into a Milllennial-infused street fair with the regulatory White mascot:"}, {"8f45": "If Pepsi truly felt like shit about what just went down — here’s what we would have read:"}, {"f828": "Pepsi truly and deeply extends a heartfelt apology to all those who were offended by what was clearly a glaring lack in judgment. We pride ourselves as a company that always strives for excellence, and in the quest to maintain this mission, we misrepresented our best intentions, which regrettably has led to a dire misunderstanding at the expense of individuals and organizations that are heralded for their adherence to justice and the never ending quest for basic rights — for all."}, {"241e": "Pepsi remains firmly in support of those endeavors and will strive to prove that pledge through future actions. Again, we are terribly sorry and are truly remorseful about the outcome of our embarrassing actions."}, {"6542": "We will make it our endearing mission to overcome our unfortunate mishap."}, {"f2fb": "Now, that’s an apology."}], "child": "869_1\t869_2\t869_3\t869_4\t869_5\t869_6\t869_7\t869_8\t869_9\t869_10\t869_11\t869_12\t869_13\t869_14\t869_15\t869_16\t869_17\t869_18\t869_19\t869_20\t869_21\t869_22\t869_23\t869_24\t869_25"}