{"name": "871", "parent": "", "content": "Professional Clowns Are All Kinds of Pissed About the ‘IT’ Remake Clowns say the film will only further diminish their imperiled profession Warner Bros. released the trailer for its IT remake last week, and if first impressions are any indication, the film stands to be even more terrifying than the original: The trailer broke records for number of views (197 million) in 24 hours, according to Slashfilm, and fans of the original 1990 miniseries are already ecstatic about the new rendition that’s set to scare the shit out of them in September. But one special interest group is pissed about the remake: clowns. As in real-life clowns. The kind you’d see at a circus or hire for a children’s birthday party. The new IT film is going to inspire yet another wave of anti-clown paranoia in our country, they say, and can only harm the already-drooping clowning industry. “It’s gonna be bad for clowns,” says Guilford Adams, a 42-year-old L.A. resident who has performed as “Gilly” for 20 years. “It’s ruining our business,” adds 33-year-old Nick Kane of L.A. (Clown name: “Mr. Nick.”) Roger Fojas, a 48-year-old clown whose characters include “Ringmaster Roger” and “Humpy Pumpy,” worries IT will make kids so terrified of clowns that their parents will stop booking clowns for birthday parties. Kane says he’s already experiencing the negative effects of the IT remake: He noticed a considerable drop in traffic to his Yelp page in the days immediately following the trailer’s release. It’s never been harder to be a clown, all of them say. Clowns were once a source of entertainment and even joy, but their depiction in the media has robbed them of their wholesomeness and transformed them into something children fear. The contemporary “creepy clown” motif dates back to the early 1980s with John Wayne Gacy, the Chicago-based serial killer who raped and murdered dozens of boys and young men during the 1970s, and who, it was later revealed, spent his free time entertaining neighborhood children as Pogo the Clown. While Gacy was executed by lethal injection in 1994, his legacy lives on today in the form of a widespread cultural aversion to clowns. And his negative impact on clowns was cemented by Stephen King’s 1986 horror novel IT—a 1,000-page tome about Pennywise, a child-killing clown who lives in the sewers and terrorizes the tiny town of Derry, Maine; and the plucky group of youngsters who set out to vanquish him once and for all. The novel was an enormous hit, even by King’s standards; a Rolling Stone readers’ poll placed it as his second-best book of all time, ahead of The Shining and behind The Stand. Many only know IT from its original adaption, a 1990 miniseries that put a horrifying face on Pennywise, and solidified in the public consciousness that clowns were evil beings who use makeup and balloons to lure in gullible children and murder them. Films such as Poltergeist and Killer Clowns From Outer Space further deepened our cultural fear of clowns, says Fojas. The cultural aversion to clowns is now so intense that Fojas likens it to racism. He was cast as a creepy clown on a reality TV show last year, and he says crew members treated him as if he were an African-American in the 1950s South. “I wouldn’t say it’s racist, per se, but it creates that kind of visceral reaction.” Indeed, clowns in London recently cried “racism” over a no-clowns sign placed in a bookstore window. (Yes, some clowns apparently don’t understand what racism is.) Anti-clown sentiment hit its peak last fall when reports of pranksters dressed as creepy clowns poured in from all over the country. People were so terrified of clowns that Kane got the cops called on him while he was just walking to a gig. “We just experienced a nice break from the scary clown meme from last October,” Kane says. “And just when things are starting to normalize, the IT trailer comes and it’s like, ‘Here we go again.’” More generally, the fear of clowns has created a nationwide clown shortage. There simply aren’t enough young people going into clowning to sustain the profession, as membership in clowning trade organizations has plummeted over the past several years. “It’s a dying profession. And the people who do it and scrape together a living have to grapple with the fact that it’s cool and hip not to like clowns,” Adams says. “The ultimate prick in this [IT movie] is that it’s going to turn young consumers away from an art form that’s sweet and nice and not about the Kardashians and Minecraft.” But the injury cuts deeper than just business. IT has largely ruined the emotional upside of being a clown, they say. Many got into clowning because they loved bringing joy and laughter to children, and films like IT make it nearly impossible to elicit that kind of warm emotional reaction. Adams, for instance, got into clowning because he wanted to delight people the way his heroes Charlie Chaplin, Buster Keaton and the Marx Brothers once did. Instead, he finds himself in a culture that’s been conditioned to be terrified of him—and the upcoming IT film is only going to further reinforce that idea, if not introduce it to an entirely new generation of clown-haters. “No one sticks up for a clown. The only thing cooler to dislike is a mime. It’s silly and stupid, and I wish people would focus on the good clowns out there.” John McDermott is a staff writer at MEL. He last wrote about the rise and fall of the University of South Carolina “Cocks” hat. More clowns: The RNC, the Gathering of the Juggalos, My Long-Lost Little Brother and MeHe showed up unexpected at my door with a homemade sword; I, in turn, took him to Ohio for a mix of Trumpalos and…melmagazine.com Joey Salads Is the Alt-Right’s Johnny KnoxvilleThe prankster’s politics are as shocking as his stuntsmelmagazine.com Trump Tried to Nickname Himself ‘The Closer’ (Which Is the Lamest Thing Ever)Nicknames are meant to be given; they’re never self-appointedmelmagazine.com ", "title": "Professional Clowns Are All Kinds of Pissed About the ‘IT’ Remake", "sentences": [{"5c40": "Professional Clowns Are All Kinds of Pissed About the ‘IT’ Remake"}, {"c0f7": "Clowns say the film will only further diminish their imperiled profession"}, {"6df1": "Warner Bros. released the trailer for its IT remake last week, and if first impressions are any indication, the film stands to be even more terrifying than the original:"}, {"ada3": "The trailer broke records for number of views (197 million) in 24 hours, according to Slashfilm, and fans of the original 1990 miniseries are already ecstatic about the new rendition that’s set to scare the shit out of them in September."}, {"0e54": "But one special interest group is pissed about the remake: clowns. As in real-life clowns. The kind you’d see at a circus or hire for a children’s birthday party. The new IT film is going to inspire yet another wave of anti-clown paranoia in our country, they say, and can only harm the already-drooping clowning industry."}, {"1046": "“It’s gonna be bad for clowns,” says Guilford Adams, a 42-year-old L.A. resident who has performed as “Gilly” for 20 years."}, {"b445": "“It’s ruining our business,” adds 33-year-old Nick Kane of L.A. (Clown name: “Mr. Nick.”)"}, {"a691": "Roger Fojas, a 48-year-old clown whose characters include “Ringmaster Roger” and “Humpy Pumpy,” worries IT will make kids so terrified of clowns that their parents will stop booking clowns for birthday parties. Kane says he’s already experiencing the negative effects of the IT remake: He noticed a considerable drop in traffic to his Yelp page in the days immediately following the trailer’s release."}, {"e3db": "It’s never been harder to be a clown, all of them say. Clowns were once a source of entertainment and even joy, but their depiction in the media has robbed them of their wholesomeness and transformed them into something children fear."}, {"e9ea": "The contemporary “creepy clown” motif dates back to the early 1980s with John Wayne Gacy, the Chicago-based serial killer who raped and murdered dozens of boys and young men during the 1970s, and who, it was later revealed, spent his free time entertaining neighborhood children as Pogo the Clown."}, {"ea53": "While Gacy was executed by lethal injection in 1994, his legacy lives on today in the form of a widespread cultural aversion to clowns."}, {"a237": "And his negative impact on clowns was cemented by Stephen King’s 1986 horror novel IT—a 1,000-page tome about Pennywise, a child-killing clown who lives in the sewers and terrorizes the tiny town of Derry, Maine; and the plucky group of youngsters who set out to vanquish him once and for all. The novel was an enormous hit, even by King’s standards; a Rolling Stone readers’ poll placed it as his second-best book of all time, ahead of The Shining and behind The Stand."}, {"0d1f": "Many only know IT from its original adaption, a 1990 miniseries that put a horrifying face on Pennywise, and solidified in the public consciousness that clowns were evil beings who use makeup and balloons to lure in gullible children and murder them."}, {"7ad7": "Films such as Poltergeist and Killer Clowns From Outer Space further deepened our cultural fear of clowns, says Fojas. The cultural aversion to clowns is now so intense that Fojas likens it to racism. He was cast as a creepy clown on a reality TV show last year, and he says crew members treated him as if he were an African-American in the 1950s South. “I wouldn’t say it’s racist, per se, but it creates that kind of visceral reaction.”"}, {"54c1": "Indeed, clowns in London recently cried “racism” over a no-clowns sign placed in a bookstore window. (Yes, some clowns apparently don’t understand what racism is.)"}, {"75e0": "Anti-clown sentiment hit its peak last fall when reports of pranksters dressed as creepy clowns poured in from all over the country. People were so terrified of clowns that Kane got the cops called on him while he was just walking to a gig."}, {"2a25": "“We just experienced a nice break from the scary clown meme from last October,” Kane says. “And just when things are starting to normalize, the IT trailer comes and it’s like, ‘Here we go again.’”"}, {"e2f8": "More generally, the fear of clowns has created a nationwide clown shortage. There simply aren’t enough young people going into clowning to sustain the profession, as membership in clowning trade organizations has plummeted over the past several years."}, {"5a70": "“It’s a dying profession. And the people who do it and scrape together a living have to grapple with the fact that it’s cool and hip not to like clowns,” Adams says. “The ultimate prick in this [IT movie] is that it’s going to turn young consumers away from an art form that’s sweet and nice and not about the Kardashians and Minecraft.”"}, {"539d": "But the injury cuts deeper than just business. IT has largely ruined the emotional upside of being a clown, they say. Many got into clowning because they loved bringing joy and laughter to children, and films like IT make it nearly impossible to elicit that kind of warm emotional reaction."}, {"d795": "Adams, for instance, got into clowning because he wanted to delight people the way his heroes Charlie Chaplin, Buster Keaton and the Marx Brothers once did. Instead, he finds himself in a culture that’s been conditioned to be terrified of him—and the upcoming IT film is only going to further reinforce that idea, if not introduce it to an entirely new generation of clown-haters."}, {"8e1f": "“No one sticks up for a clown. The only thing cooler to dislike is a mime. It’s silly and stupid, and I wish people would focus on the good clowns out there.”"}, {"d50f": "John McDermott is a staff writer at MEL. He last wrote about the rise and fall of the University of South Carolina “Cocks” hat."}, {"9c16": "More clowns:"}, {"23e1": "The RNC, the Gathering of the Juggalos, My Long-Lost Little Brother and MeHe showed up unexpected at my door with a homemade sword; I, in turn, took him to Ohio for a mix of Trumpalos and…melmagazine.com"}, {"37f3": "Joey Salads Is the Alt-Right’s Johnny KnoxvilleThe prankster’s politics are as shocking as his stuntsmelmagazine.com"}, {"e4e4": "Trump Tried to Nickname Himself ‘The Closer’ (Which Is the Lamest Thing Ever)Nicknames are meant to be given; they’re never self-appointedmelmagazine.com"}], "child": "871_1\t871_2\t871_3\t871_4\t871_5\t871_6\t871_7"}