{"name": "873", "parent": "", "content": "When Your Partner Has a Tattoo of Their Ex It’s a tale as old as time: You fall in love, and all you can think is, I gotta commemorate this moment with a giant permanent tattoo of my lover’s face or name on my body so I never forget. But then you break up, and now you’re a guy with a giant permanent tattoo of your ex’s face or name on your body. Or it happens the other way around: You’ve met someone you really like, and it’s time to get intimate. This is when you notice a name or a face splashed across a chest or bicep, and have to decide how much you care that they have a piece of their past embedded in their skin. There’s no easy answer here. For starters, it’s hard to estimate how many people do this sort of love tattooing, or how it shakes out between men and women. A recent Harris poll found that some three in 10 Americans (and half of millennials) have tattoos. Among the tattooed’s top regrets? Inking the name of someone you’re longer with. The anecdotes from people wrestling with a new partner’s tattoo of an ex seem to be overwhelmingly women complaining about men who, for whatever reason, choose to keep a permanent visual roster of their past lovers. The internet is filled with forums and columns where advice-seekers need backup on this issue: Am I supposed to care about this dude’s tattoo of his baby mama? Is he supposed to fix it out of respect to us? Or is it no big deal? The letters are strikingly identical, give or take a few details. A 29-year-old woman asks Washington Post advice columnist Carolyn Hax about how to deal with the tattoo of her 37-year-old divorced boyfriend’s ex-wife on his bicep. They’ve been dating a month, but already she can’t take this thing. She writes: From what I understand, they were married 10 years ago and he doesn’t speak to her, but I kinda feel like I need to know at least part of the story. I also feel like it will come out naturally and that if I press, it will undo the excellent foundation we’ve laid. I’m so happy the way things are, I really don’t want to rock the boat, but that tattoo . . . “Is this petty?” another woman asks the site Madame Noire. “He won’t get the tattoo of his ex’s name covered up.” Here, the boyfriend — whom advice-seeker Kam has been seeing seven months — has his ex’s and (baby mama’s) name in “gaudy cursive” on his arm. “Kam has tried not to let the tattoo bother her, but she says that when they have sex, it’s always there in her face. And when she notices it, in and out of bed, she’s immediately turned off,” Victoria Uwumarogie writes. Men also query the internet on what to do about finding out a new girlfriend has a tattoo of her ex. “Let’s say you’ve started dating this new girlfriend,” a guy asks on the forum Mixed Martial Arts. “You like her enough to go on a few dates before having sex, and when you finally get to do the dirty with her, you discover she has a tattoo of her ex boyfriends name. She tells you that ex was the love of her life and that he died while they were still together, and while not yet married, had plans to spend their entire lives together. She has no intentions of ever having it removed. Do you shut up and deal with it or do you bail?” The advice given in all scenarios boils down to four main options. You ask them to cover it up; you ask or hope that they add you to the roster; you get over it; or you don’t date this person (a lot of people think those who get tattoos of lovers are bad news in the first place). Let’s say you can’t just get over it, but you want to stay in the relationship. Covering the tat seems like a good choice. Our best go-to in this, and so many life choices, is obviously Johnny Depp, who famously altered his “Winona Forever” tattoo to “Wino Forever” after he and Ryder split. Somehow he went ahead and got another tattoo when he fell in love with Amber Heard — the word “Slim” (Heard’s nickname) on his knuckles, and a tattoo of her head on his bicep. When they crashed and burned last year, he changed “Slim” to “Scum” and has covered up her likeness with a blackout tattoo, according to US Weekly. Covering the tattoos seems to have been Depp’s own call, not something he did at the request of a new lover — so unless a partner decides to get rid of the evidence of their own accord, the real work of convincing or putting up with it will fall on the next partner. There’s a distinct queasiness to the issue, because it’s not only about whether tattoos of lovers past are bad; we also wonder what it says about someone who needs to declare their love in this way. It’s also about jealousy. We all know we’re the product of all the previous relationships we’ve had, but most of us don’t go carrying them around with us so literally — forcing other people to re-read their name or gaze upon their faces over and over and over. Exes are hard enough to deal with in real life, and we may all have an old box full of pictures of our high school boyfriend or girlfriend somewhere in a closet. But who wants a visual reminder you can never escape? Nothing says someone is not really out of the picture like having to look at a literal picture of them on your lover’s body. Perhaps the best perspective is from tattoo artists themselves. Last year, New York magazine’s “The Cut” interviewed tattoo artist-to-the-stars Scott Campbell, asking him specifically about getting the tattoos of old lovers removed. He admitted to covering up or removing tattoos of some of his exes, but not all, and he doesn’t necessarily advocate for it. “They don’t bother me,” he said. “There’s an honesty in it. If it made my wife uncomfortable, I would. Tattoos take away the luxury of denial. We all have exes and people who broke our hearts and people whose hearts we broke. It forces you to accept it and understand it and understand the things that happened before now.” Tracy Moore is a staff writer at MEL. She last wrote about why Jon Hamm is really smart about money. More exes: My Ex-Girlfriend Broke My DickAnd why I decided not to fix itmelmagazine.com What Do You Do When Your Ex Hangs Onto a Model of Your Dick?Clone-a-Willy turned dick molds into a fad. But post-breakup etiquette — to toss? Or to save? — is still very much TBD.melmagazine.com Science Explains Why We’re Willing to Sacrifice for ‘The One’When we perceive our partners as more desirable than ourselves, we’re willing to put in more workmelmagazine.com ", "title": "When Your Partner Has a Tattoo of Their Ex", "sentences": [{"4276": "When Your Partner Has a Tattoo of Their Ex"}, {"b1f0": "It’s a tale as old as time: You fall in love, and all you can think is, I gotta commemorate this moment with a giant permanent tattoo of my lover’s face or name on my body so I never forget. But then you break up, and now you’re a guy with a giant permanent tattoo of your ex’s face or name on your body. Or it happens the other way around: You’ve met someone you really like, and it’s time to get intimate. This is when you notice a name or a face splashed across a chest or bicep, and have to decide how much you care that they have a piece of their past embedded in their skin."}, {"836b": "There’s no easy answer here. For starters, it’s hard to estimate how many people do this sort of love tattooing, or how it shakes out between men and women. A recent Harris poll found that some three in 10 Americans (and half of millennials) have tattoos. Among the tattooed’s top regrets? Inking the name of someone you’re longer with. The anecdotes from people wrestling with a new partner’s tattoo of an ex seem to be overwhelmingly women complaining about men who, for whatever reason, choose to keep a permanent visual roster of their past lovers."}, {"c024": "The internet is filled with forums and columns where advice-seekers need backup on this issue: Am I supposed to care about this dude’s tattoo of his baby mama? Is he supposed to fix it out of respect to us? Or is it no big deal? The letters are strikingly identical, give or take a few details. A 29-year-old woman asks Washington Post advice columnist Carolyn Hax about how to deal with the tattoo of her 37-year-old divorced boyfriend’s ex-wife on his bicep. They’ve been dating a month, but already she can’t take this thing. She writes:"}, {"aced": "From what I understand, they were married 10 years ago and he doesn’t speak to her, but I kinda feel like I need to know at least part of the story. I also feel like it will come out naturally and that if I press, it will undo the excellent foundation we’ve laid. I’m so happy the way things are, I really don’t want to rock the boat, but that tattoo . . ."}, {"4803": "“Is this petty?” another woman asks the site Madame Noire. “He won’t get the tattoo of his ex’s name covered up.” Here, the boyfriend — whom advice-seeker Kam has been seeing seven months — has his ex’s and (baby mama’s) name in “gaudy cursive” on his arm."}, {"523f": "“Kam has tried not to let the tattoo bother her, but she says that when they have sex, it’s always there in her face. And when she notices it, in and out of bed, she’s immediately turned off,” Victoria Uwumarogie writes."}, {"a14c": "Men also query the internet on what to do about finding out a new girlfriend has a tattoo of her ex. “Let’s say you’ve started dating this new girlfriend,” a guy asks on the forum Mixed Martial Arts."}, {"adb5": "“You like her enough to go on a few dates before having sex, and when you finally get to do the dirty with her, you discover she has a tattoo of her ex boyfriends name. She tells you that ex was the love of her life and that he died while they were still together, and while not yet married, had plans to spend their entire lives together. She has no intentions of ever having it removed. Do you shut up and deal with it or do you bail?”"}, {"5e29": "The advice given in all scenarios boils down to four main options. You ask them to cover it up; you ask or hope that they add you to the roster; you get over it; or you don’t date this person (a lot of people think those who get tattoos of lovers are bad news in the first place)."}, {"2444": "Let’s say you can’t just get over it, but you want to stay in the relationship. Covering the tat seems like a good choice. Our best go-to in this, and so many life choices, is obviously Johnny Depp, who famously altered his “Winona Forever” tattoo to “Wino Forever” after he and Ryder split."}, {"e0e2": "Somehow he went ahead and got another tattoo when he fell in love with Amber Heard — the word “Slim” (Heard’s nickname) on his knuckles, and a tattoo of her head on his bicep. When they crashed and burned last year, he changed “Slim” to “Scum” and has covered up her likeness with a blackout tattoo, according to US Weekly."}, {"12f7": "Covering the tattoos seems to have been Depp’s own call, not something he did at the request of a new lover — so unless a partner decides to get rid of the evidence of their own accord, the real work of convincing or putting up with it will fall on the next partner."}, {"c07c": "There’s a distinct queasiness to the issue, because it’s not only about whether tattoos of lovers past are bad; we also wonder what it says about someone who needs to declare their love in this way. It’s also about jealousy. We all know we’re the product of all the previous relationships we’ve had, but most of us don’t go carrying them around with us so literally — forcing other people to re-read their name or gaze upon their faces over and over and over."}, {"b404": "Exes are hard enough to deal with in real life, and we may all have an old box full of pictures of our high school boyfriend or girlfriend somewhere in a closet. But who wants a visual reminder you can never escape? Nothing says someone is not really out of the picture like having to look at a literal picture of them on your lover’s body."}, {"621f": "Perhaps the best perspective is from tattoo artists themselves. Last year, New York magazine’s “The Cut” interviewed tattoo artist-to-the-stars Scott Campbell, asking him specifically about getting the tattoos of old lovers removed. He admitted to covering up or removing tattoos of some of his exes, but not all, and he doesn’t necessarily advocate for it."}, {"407f": "“They don’t bother me,” he said."}, {"0b39": "“There’s an honesty in it. If it made my wife uncomfortable, I would. Tattoos take away the luxury of denial. We all have exes and people who broke our hearts and people whose hearts we broke. It forces you to accept it and understand it and understand the things that happened before now.”"}, {"2536": "Tracy Moore is a staff writer at MEL. She last wrote about why Jon Hamm is really smart about money."}, {"9a5b": "More exes:"}, {"28a6": "My Ex-Girlfriend Broke My DickAnd why I decided not to fix itmelmagazine.com"}, {"9411": "What Do You Do When Your Ex Hangs Onto a Model of Your Dick?Clone-a-Willy turned dick molds into a fad. But post-breakup etiquette — to toss? Or to save? — is still very much TBD.melmagazine.com"}, {"f9a3": "Science Explains Why We’re Willing to Sacrifice for ‘The One’When we perceive our partners as more desirable than ourselves, we’re willing to put in more workmelmagazine.com"}], "child": "873_1"}