{"name": "879", "parent": "", "content": "Mink, Money and Migos Why the fur coat is the new gold chain It was once an iconic red Ferrari that said, “Look at me, I got fuck-you money.” But nowadays nothing lets the world know you’ve made it quite like a fur coat. Last week on The Tonight Show, Atlanta rap trio Migos performed their new hit single “T-Shirt” in pastel-colored faux-fur coats. In their latest music video, which has garnered nearly 70 million plays in two months, the rappers don more traditional fur outerwear in a Revenant-like setting. Men who dare to wear fur coats have never been more in vogue; men wearing animal hair have become as common as girls in flower crowns at music festivals. Despite PETA’s best efforts, the allure of fur — which saw its heyday in the 1950s — persists. In 2016, an estimated 63 percent of the major designers showing in London, Milan and Paris used fur in some form, according to the International Fur Federation. But to fully understand this fur-coat renaissance — in which rappers and pop idols like Justin Bieber, Macklemore, 50 Cent and Cam’ron have all covered themselves with animal hides as a symbol of their status—it helps to close your eyes and imagine what it would be like if you suddenly fell into a swimming pool of hundred-dollar bills. Because the common thread among fur’s biggest fans is having had no money—and now having so much that wiping your ass with hundies is entirely possible. If bespoke suits, ascots and Barbour hunting jackets represent old-money lineage, the fur coat is the ultimate symbol of the nouveau riche—those who acquired wealth within their own lifetime rather than by familial inheritance. Those of us who don’t have one — mainly because we can’t afford one — are on the outside, freezing our asses off, looking in. Take UFC superstar Conor McGregor, whose net worth reached $22.5 million in just the last few years. On the eve of his biggest fight to date, with fellow lightweight Eddie Alvarez, Connor showed up to the pre-fight press conference with a shit-eating grin and a white Gucci mink coat — an homage to legendary boxer Joe Frazier, who wore the same outfit nearly 43 years earlier. The look was ridiculous, but that was the point. It was a showcase of all that he’s worked for—in McGregor’s case, literally fought for. “I think people are intrigued and grossed out at the same time,” says Macklemore in a video in which he displays his fur collection. It’s no coincidence that he went from doing drugs and living in his mom’s basement to winning the 2015 Grammy for best album. Of course, rich men having been wearing fur for years. In the ‘90s and early 2000s, rappers like Biggie, UGK and Busta Rhymes flaunted their furry foliage on magazine covers and in the street. In the 1950s, nearly 50 percent of all fur coat sales were men. But—for reasons involving the uncompromisingly militant Animal Liberation Front, PETA and most memorably a distributed image by David Bailey that showed a model trailing a fur coat oozing blood on the catwalk with the slogan: “It takes up to 40 dumb animals to make this but only one to wear it”—after the 1950s, fur for men nearly disappeared. The Fur Information Council of America says there have been “significant gains in sales of men’s fur fashions” over the past several years. They now account for nearly 5 percent of total fur sales. For women, wearing fur has never acquired the same nouveau-riche connotations. While it’s just as expensive, fur coats for women are seen as more elegant, opulent, even natural. Famously chic Anna Wintour can often be spotted wearing various fur coats and jackets in the colder months. So why not the same for men? The short answer: It’s more fun to be bad than bougie. Andrew Fiouzi is MEL’s editorial assistant. He last wrote about what all those Twinkies, Skittles and cans of Mountain Dew are doing to athletes’ bodies. More men’s fashion: How the Hipster Barbers of Brooklyn Feel About Giving the ‘Nazi Haircut’Oh, you want the ‘Hitler Youth?’melmagazine.com ‘Dad Jeans’ Retired With ObamaA visual historymelmagazine.com I Have Reverse Beard-EnvyIn my Persian family, scruff is the opposite of coolmelmagazine.com ", "title": "Mink, Money and Migos", "sentences": [{"b915": "Mink, Money and Migos"}, {"645a": "Why the fur coat is the new gold chain"}, {"1383": "It was once an iconic red Ferrari that said, “Look at me, I got fuck-you money.” But nowadays nothing lets the world know you’ve made it quite like a fur coat. Last week on The Tonight Show, Atlanta rap trio Migos performed their new hit single “T-Shirt” in pastel-colored faux-fur coats. In their latest music video, which has garnered nearly 70 million plays in two months, the rappers don more traditional fur outerwear in a Revenant-like setting."}, {"e4ad": "Men who dare to wear fur coats have never been more in vogue; men wearing animal hair have become as common as girls in flower crowns at music festivals. Despite PETA’s best efforts, the allure of fur — which saw its heyday in the 1950s — persists. In 2016, an estimated 63 percent of the major designers showing in London, Milan and Paris used fur in some form, according to the International Fur Federation."}, {"a9a8": "But to fully understand this fur-coat renaissance — in which rappers and pop idols like Justin Bieber, Macklemore, 50 Cent and Cam’ron have all covered themselves with animal hides as a symbol of their status—it helps to close your eyes and imagine what it would be like if you suddenly fell into a swimming pool of hundred-dollar bills. Because the common thread among fur’s biggest fans is having had no money—and now having so much that wiping your ass with hundies is entirely possible."}, {"bcee": "If bespoke suits, ascots and Barbour hunting jackets represent old-money lineage, the fur coat is the ultimate symbol of the nouveau riche—those who acquired wealth within their own lifetime rather than by familial inheritance. Those of us who don’t have one — mainly because we can’t afford one — are on the outside, freezing our asses off, looking in."}, {"f568": "Take UFC superstar Conor McGregor, whose net worth reached $22.5 million in just the last few years. On the eve of his biggest fight to date, with fellow lightweight Eddie Alvarez, Connor showed up to the pre-fight press conference with a shit-eating grin and a white Gucci mink coat — an homage to legendary boxer Joe Frazier, who wore the same outfit nearly 43 years earlier. The look was ridiculous, but that was the point. It was a showcase of all that he’s worked for—in McGregor’s case, literally fought for."}, {"bec5": "“I think people are intrigued and grossed out at the same time,” says Macklemore in a video in which he displays his fur collection. It’s no coincidence that he went from doing drugs and living in his mom’s basement to winning the 2015 Grammy for best album."}, {"a2dc": "Of course, rich men having been wearing fur for years. In the ‘90s and early 2000s, rappers like Biggie, UGK and Busta Rhymes flaunted their furry foliage on magazine covers and in the street. In the 1950s, nearly 50 percent of all fur coat sales were men. But—for reasons involving the uncompromisingly militant Animal Liberation Front, PETA and most memorably a distributed image by David Bailey that showed a model trailing a fur coat oozing blood on the catwalk with the slogan: “It takes up to 40 dumb animals to make this but only one to wear it”—after the 1950s, fur for men nearly disappeared."}, {"3bcf": "The Fur Information Council of America says there have been “significant gains in sales of men’s fur fashions” over the past several years. They now account for nearly 5 percent of total fur sales."}, {"861c": "For women, wearing fur has never acquired the same nouveau-riche connotations. While it’s just as expensive, fur coats for women are seen as more elegant, opulent, even natural. Famously chic Anna Wintour can often be spotted wearing various fur coats and jackets in the colder months. So why not the same for men? The short answer: It’s more fun to be bad than bougie."}, {"a0aa": "Andrew Fiouzi is MEL’s editorial assistant. He last wrote about what all those Twinkies, Skittles and cans of Mountain Dew are doing to athletes’ bodies."}, {"0207": "More men’s fashion:"}, {"cd29": "How the Hipster Barbers of Brooklyn Feel About Giving the ‘Nazi Haircut’Oh, you want the ‘Hitler Youth?’melmagazine.com"}, {"335d": "‘Dad Jeans’ Retired With ObamaA visual historymelmagazine.com"}, {"5245": "I Have Reverse Beard-EnvyIn my Persian family, scruff is the opposite of coolmelmagazine.com"}], "child": "879_1"}