{"name": "880", "parent": "", "content": "Why April Fools’ Day Needs to Die a Violent Death Everybody loses on this shitty holiday for the unfunniest among us For as long as people have been celebrating this terrible “holiday” we call April Fools’ Day, many people have despised it, according to a history of this 500-year tradition. “It’s one of the least-liked holidays there is,” Museum of Hoaxes Curator Alex Boese told The Verge. “For literally centuries, people have been predicting that April Fools’ Day must be on its last legs, and surely this awful celebration is going to die out soon, but it just keeps on going.” Let us keep that prediction and hope going. According to The Verge, we can probably credit the Dutch for April Fools’, which dates at least as far back as 1564, when it involved getting people to go on a “fool’s errand,” like gathering pigeon’s milk. In Scotland, the day involved tricking people into walking really fucking far with a stupid letter they kept delivering to the wrong person. Cut to about 150 years ago, and it was mostly kids being dicks to each other by gluing pennies to the street. But like everything in existence, once modern brands got their hands on an opportunity to seem cool and with it, everything changed, with absolutely no benefit to humanity. A roundup of the best hoaxes so far this year from brands over at Ad Week offers these as evidence: Rental car company Alamo made a video for their new cars that plan your vacation for you. Unclear what the funny part is. Restaurant chain Bob Evans has debuted a “farm to table” beauty line that includes a sausage gravy beauty mask. Gross. Buffalo Wild Wings has launched a Rally Beard Sauce to grow your beard. Okay. Honda has introduced “horn emojis” on the steering wheel so drivers can “safely express emotions.” To make matters worse, because April Fools’ falls on a Saturday this year, brands and websites are squeezing out their April Fools’ jokes a day early so no one misses them, proof that no holiday is immune from the weeklong creep. And yet, none of this holds a prankster’s magic relighting candle to the fact that April Fools’ pranks are always dumb — Hulu for pets! Ugh—and often cruel, attempts at humor by the uninspired and unoriginal to simply fuck with those they love. “April Fools’ Day is to comedy what St. Patrick’s Day is to Irish culture,” John Oliver joked on Last Week Tonight. “Anyone who claims to be excited about April Fools’ Day is a sociopath, because what they’re really saying is, I cannot wait to hurt the people close to me.” MEL asked around for some terrible examples, and got back the story of a woman whose husband thought it would be hilarious to tell their two sons she’d been arrested for knocking out a clerk at the store. There is no punchline. We also got a few stories from a particularly prankish theater whose April Fools’ jokes ended in disaster: Someone switched the prop letters on stage for gibberish on an older, dyslexic actor with memory issues, who had been doing a stellar job until that point. Another used a live snake in a box to scare a child actor, who wet his pants onstage. Someone switched fake booze for the real thing in a scene where an actor had to down a whole drink in one gulp. The actor was diabetic and spent a week in the hospital. Final proof that the day needs to die is that we are already living April Fools’ Day every day. It’s called fake news. “Obama Signs Executive Order Banning the Pledge of Allegiance in Schools Nationwide,” and “Trump Offering Free One-Way Tickets to Africa and Mexico for Those Who Wanna Leave America,” are just a few examples of the bigger hits. The entire internet, full of trolls and liars, has become an April Fools’ joke in itself, but the joke’s on us—and as the saying goes, if you have to explain it, it’s not funny. Tracy Moore is a staff writer at MEL. She last wrote about why Mike Pence is not that crazy for not dining alone with other women. More jokes: Donald Trump Is No JokeAlec Baldwin’s ‘Saturday Night Live’ impression reflects America’s belated shock at the monster it underestimatedmelmagazine.com A Hard Look at the Dick Joke Through HistoryFrom ancient Roman mosaics to ‘Silicon Valley,’ people have always laughed at penisesmelmagazine.com Abraham Lincoln’s Sense of Humor Was the Same as YoursAll his jokes were about farting, being ugly and hating New Jerseymelmagazine.com ", "title": "Why April Fools’ Day Needs to Die a Violent Death", "sentences": [{"8c7d": "Why April Fools’ Day Needs to Die a Violent Death"}, {"a271": "Everybody loses on this shitty holiday for the unfunniest among us"}, {"00ab": "For as long as people have been celebrating this terrible “holiday” we call April Fools’ Day, many people have despised it, according to a history of this 500-year tradition. “It’s one of the least-liked holidays there is,” Museum of Hoaxes Curator Alex Boese told The Verge. “For literally centuries, people have been predicting that April Fools’ Day must be on its last legs, and surely this awful celebration is going to die out soon, but it just keeps on going.” Let us keep that prediction and hope going."}, {"e399": "According to The Verge, we can probably credit the Dutch for April Fools’, which dates at least as far back as 1564, when it involved getting people to go on a “fool’s errand,” like gathering pigeon’s milk. In Scotland, the day involved tricking people into walking really fucking far with a stupid letter they kept delivering to the wrong person. Cut to about 150 years ago, and it was mostly kids being dicks to each other by gluing pennies to the street."}, {"1d71": "But like everything in existence, once modern brands got their hands on an opportunity to seem cool and with it, everything changed, with absolutely no benefit to humanity. A roundup of the best hoaxes so far this year from brands over at Ad Week offers these as evidence: Rental car company Alamo made a video for their new cars that plan your vacation for you. Unclear what the funny part is."}, {"9c66": "Restaurant chain Bob Evans has debuted a “farm to table” beauty line that includes a sausage gravy beauty mask. Gross. Buffalo Wild Wings has launched a Rally Beard Sauce to grow your beard. Okay."}, {"12c9": "Honda has introduced “horn emojis” on the steering wheel so drivers can “safely express emotions.”"}, {"7062": "To make matters worse, because April Fools’ falls on a Saturday this year, brands and websites are squeezing out their April Fools’ jokes a day early so no one misses them, proof that no holiday is immune from the weeklong creep."}, {"1699": "And yet, none of this holds a prankster’s magic relighting candle to the fact that April Fools’ pranks are always dumb — Hulu for pets! Ugh—and often cruel, attempts at humor by the uninspired and unoriginal to simply fuck with those they love. “April Fools’ Day is to comedy what St. Patrick’s Day is to Irish culture,” John Oliver joked on Last Week Tonight. “Anyone who claims to be excited about April Fools’ Day is a sociopath, because what they’re really saying is, I cannot wait to hurt the people close to me.”"}, {"8a60": "MEL asked around for some terrible examples, and got back the story of a woman whose husband thought it would be hilarious to tell their two sons she’d been arrested for knocking out a clerk at the store. There is no punchline. We also got a few stories from a particularly prankish theater whose April Fools’ jokes ended in disaster: Someone switched the prop letters on stage for gibberish on an older, dyslexic actor with memory issues, who had been doing a stellar job until that point. Another used a live snake in a box to scare a child actor, who wet his pants onstage. Someone switched fake booze for the real thing in a scene where an actor had to down a whole drink in one gulp. The actor was diabetic and spent a week in the hospital."}, {"b521": "Final proof that the day needs to die is that we are already living April Fools’ Day every day. It’s called fake news. “Obama Signs Executive Order Banning the Pledge of Allegiance in Schools Nationwide,” and “Trump Offering Free One-Way Tickets to Africa and Mexico for Those Who Wanna Leave America,” are just a few examples of the bigger hits. The entire internet, full of trolls and liars, has become an April Fools’ joke in itself, but the joke’s on us—and as the saying goes, if you have to explain it, it’s not funny."}, {"2dbd": "Tracy Moore is a staff writer at MEL. She last wrote about why Mike Pence is not that crazy for not dining alone with other women."}, {"d357": "More jokes:"}, {"e2a1": "Donald Trump Is No JokeAlec Baldwin’s ‘Saturday Night Live’ impression reflects America’s belated shock at the monster it underestimatedmelmagazine.com"}, {"0ce3": "A Hard Look at the Dick Joke Through HistoryFrom ancient Roman mosaics to ‘Silicon Valley,’ people have always laughed at penisesmelmagazine.com"}, {"297e": "Abraham Lincoln’s Sense of Humor Was the Same as YoursAll his jokes were about farting, being ugly and hating New Jerseymelmagazine.com"}], "child": "880_1"}