{"name": "883", "parent": "", "content": "Hamburgers Are Bigger Than Ever, but the Meat Has Always Been Questionable From ‘pink slime’ to bug burgers, a look at the quintessential American meal For most of the world, the symbol most associated with America isn’t the bald eagle, George Washington or even the stars and stripes—it’s the hamburger and fries. But how much has this simple meal — a ground-beef sandwich with fried potatoes — changed since its glory days of the 1950s? Let’s find out. The Ingredients 1950s: According to Andrew Smith, author of The Encyclopedia of Junk Food and Fast Food, the quality of hamburger meat was so bad in the early 20th century that by the 1950s, customers needed reassuring that what they were getting was actual meat. “Heading into the ‘50s, White Castle had beef slabs delivered to each outlet a couple times a day,” Smith says. “It was ground up in front of any customers in the store to assure everyone that their beef did come from a cow, as opposed to a variety of meat and other products from other slaughtered animals.” White Castle employee with a guarantee sign So during the burger’s heyday, most people could feel confident that they were, in fact, getting 100 percent ground beef, while the fries were exactly as advertised: Potatoes, sliced in the restaurant and fried in animal oil. Today: In 2008, a study by Brigid Prayson of the Cleveland Clinical Foundation tried to find out whether it was even possible for America to produce as much beef as was apparently being consumed — an interesting question, considering that there are fewer cattle being raised now than in the 1970s, and yet we’re eating more beef than we were then. The answers weren’t encouraging, and a test of a variety of fast-food burgers found that the amount of real meat in burgers ranged from just 2 to 14 percent. The rest was made up of what has become known as “pink slime,” or in the words of the study, “a mash of connective tissue, blood vessels, peripheral nerve, plant material, cartilage and bone.” This nauseating goop was then doused in ammonium hydroxide, an antimicrobial agent once classified by the Department of Agriculture as “generally recognized as safe,” though the practice is banned in the European Union. McDonald’s and other chains have since claimed that they no longer use the stuff, but after a brief public backlash, it has crept back into grocery stores, with a 2014 study claiming that up to 70 percent of the ground beef sold in stores contains the dreaded pink slime. McDonald’s pink slime The meat isn’t the only thing chock-full of chemicals now, either. A quick look at the fry ingredients listed on McDonald’s website reveals not just potatoes but rather a dozen different things, including chemicals with such appetizing names as sodium acid pyrophosphate (that’s the one that maintains their friendly yellow color). Essentially, most of the water in the fries has been replaced with fat, and a bunch of chemicals are added to make them taste like they were fried in animal fat, rather than the mix of corn and soybean oil they’re actually fried in. The Size 1950s: “The combo of french fries and burgers as a meal became solidified during World War II, since meat was rationed and you needed to bolster what small amount of it you had with something else,” says Smith. How small exactly were the burgers? In 1950, the average burger weighed just 3.9 ounces—not so much bigger than a modern-day White Castle slider, at 2.2 ounces, according to the Centers for Disease Control. For their part, an average order of fries weighed roughly 2.4 ounces. Today: As rationing came to an end, burgers began to fatten up. “Chains like Burger King came along offering bigger burgers with more meat, and the increased competition led to an arms race of the sizes and the styles of burgers,” Smith says. As a result, the average fast-food burger has quadrupled in size since the 1950s and now stands at a gut-busting 12 ounces. Fries, meanwhile, have nearly doubled in size, weighing in at 6.7 ounces (again according to the CDC). The Health Implications 1950s: As previously mentioned, the quality of meat in the average burger was a serious issue in the early 1900s, but public outrage led emerging restaurants like White Castle to make the cleanliness and purity of their food a prioritized selling point. And so, thanks to the combination of more natural ingredients and lower portion sizes, the occasional burger was less likely to be frowned upon by your doctor. “It’s important to remember that obesity was a minor problem in the 1950s and 1960s,” says Smith. “Burgers could (and can) be healthy — it all depends on the quality and quantity of the ingredients.” Today: “The size of meals today and the types of fat have changed,” says Barry Sears of the Inflammation Research Foundation. “The greater amounts of refined carbs, the addition of sugar to the hamburger buns and the replacement of saturated fat by omega-6 fats (especially in the French fries) all lead to dangerous levels of insulin and inflammation — the leading causes for heart disease.” Plus, almost everything has been super-sized compared to the 1950s, including levels of sodium: The FDA recommends no more than 2,300 milligrams of sodium a day, but a McDonald’s Big Mac packs in 1,007 milligrams by itself, with another 350 milligrams in a large order of fries. It’s not just the big fast-food chain burgers, either. Australian consumer advocacy magazine Choice compared McDonald’s burgers to self-proclaimed “healthy” gourmet burgers, and found that despite boasting a lack of preservatives in the buns and condiments, the gourmet burgers themselves averaged 40 percent more calories than the Big Mac, with “startling amounts of artery-clogging saturated fat.” Their study mentions one gourmet burger from Aussie chain Grill’d, called The Mighty, “that manages to fit 19.9 grams of saturated fat into a single burger [a Big Mac has 11.3 grams].” If you’re an average adult with a daily intake of around 2,000 calories, your daily saturated fat intake should be capped at 23 grams — or just about 3 more grams than are in The Mighty. The Future So where is the burger and fries headed? According to the experts, the most likely answer is: Down. Traditional hamburgers sales have certainly declined, and according to a survey by Mintel, a market intelligence agency, “Interest in non-beef burger offerings is highest among millennials, who are the most likely generation to agree that healthiness of menu items is the most important factor.” But what about the longer term? What will burgers look like by, say, the 2050s? There are a couple of reasonable predictions, the first of which involves meat specially grown in laboratories. Lab-grown meat startups are popping up all over the place, aiming to decrease our reliance on industrialized livestock, water, antibiotics and the sheer amount of space cattle farming takes up. This is no meat-flavored tofu substitute, either: This is actual meat, trillions of meat cells grown from a single stem cell, then formed into muscle tissue and grown into a meat patty. It’s an expensive process, but it’s getting exponentially cheaper (30,000 times cheaper in just four years, to be exact). And as recent taste tests have proved, if the cost can be brought down, it may be a viable source of protein for the next generation. Insect food stall in Bangkok, Thailand On the other hand — and possibly even less appetizing than meat grown in a petri dish — there’s increasing momentum to introduce more bugs into our food. Insects are a popular source of protein in most of the world outside of the U.S. and Western Europe — fried spiders, for example, are a delicacy in Cambodia, while fried scorpion is a common street meat in China and Thailand. Insect meat is around 60 to 70 percent protein with almost zero fat, and takes up a minute fraction of the resources required for cattle farming, which is why the U.N. is keen to encourage Western nations to give bugs a try. As to whether Americans will ever accept as their national icon a burger made of crickets or silkworms? Only time will tell. Quinn Myers is a writer based in Chicago. He last wrote about money lessons from a retiree, a CEO and a starving artist. More fast food: Here’s What Taco Bell’s Low-Key Healthy Revolution Tastes LikeTaco Bell? More like Taco Blahmelmagazine.com Taco Bell’s Healthy Menu Options Drove Us to Taste-Test the Naked Chicken ChalupaIn the end, we came to regret both equallymelmagazine.com The Tumultuous Marriage Behind the McDonald’s EmpireThe first couple of fast food argued over way more than just who got the last nuggetmelmagazine.com ", "title": "Hamburgers Are Bigger Than Ever, but the Meat Has Always Been Questionable", "sentences": [{"077b": "Hamburgers Are Bigger Than Ever, but the Meat Has Always Been Questionable"}, {"8d0e": "From ‘pink slime’ to bug burgers, a look at the quintessential American meal"}, {"0617": "For most of the world, the symbol most associated with America isn’t the bald eagle, George Washington or even the stars and stripes—it’s the hamburger and fries. But how much has this simple meal — a ground-beef sandwich with fried potatoes — changed since its glory days of the 1950s? Let’s find out."}, {"46ad": "The Ingredients"}, {"9913": "1950s: According to Andrew Smith, author of The Encyclopedia of Junk Food and Fast Food, the quality of hamburger meat was so bad in the early 20th century that by the 1950s, customers needed reassuring that what they were getting was actual meat. “Heading into the ‘50s, White Castle had beef slabs delivered to each outlet a couple times a day,” Smith says. “It was ground up in front of any customers in the store to assure everyone that their beef did come from a cow, as opposed to a variety of meat and other products from other slaughtered animals.”"}, {"5b69": "White Castle employee with a guarantee sign"}, {"ee12": "So during the burger’s heyday, most people could feel confident that they were, in fact, getting 100 percent ground beef, while the fries were exactly as advertised: Potatoes, sliced in the restaurant and fried in animal oil."}, {"4f9f": "Today: In 2008, a study by Brigid Prayson of the Cleveland Clinical Foundation tried to find out whether it was even possible for America to produce as much beef as was apparently being consumed — an interesting question, considering that there are fewer cattle being raised now than in the 1970s, and yet we’re eating more beef than we were then. The answers weren’t encouraging, and a test of a variety of fast-food burgers found that the amount of real meat in burgers ranged from just 2 to 14 percent. The rest was made up of what has become known as “pink slime,” or in the words of the study, “a mash of connective tissue, blood vessels, peripheral nerve, plant material, cartilage and bone.”"}, {"a896": "This nauseating goop was then doused in ammonium hydroxide, an antimicrobial agent once classified by the Department of Agriculture as “generally recognized as safe,” though the practice is banned in the European Union. McDonald’s and other chains have since claimed that they no longer use the stuff, but after a brief public backlash, it has crept back into grocery stores, with a 2014 study claiming that up to 70 percent of the ground beef sold in stores contains the dreaded pink slime."}, {"9321": "McDonald’s pink slime"}, {"86d0": "The meat isn’t the only thing chock-full of chemicals now, either. A quick look at the fry ingredients listed on McDonald’s website reveals not just potatoes but rather a dozen different things, including chemicals with such appetizing names as sodium acid pyrophosphate (that’s the one that maintains their friendly yellow color). Essentially, most of the water in the fries has been replaced with fat, and a bunch of chemicals are added to make them taste like they were fried in animal fat, rather than the mix of corn and soybean oil they’re actually fried in."}, {"4cc5": "The Size"}, {"26b6": "1950s: “The combo of french fries and burgers as a meal became solidified during World War II, since meat was rationed and you needed to bolster what small amount of it you had with something else,” says Smith. How small exactly were the burgers? In 1950, the average burger weighed just 3.9 ounces—not so much bigger than a modern-day White Castle slider, at 2.2 ounces, according to the Centers for Disease Control. For their part, an average order of fries weighed roughly 2.4 ounces."}, {"57c3": "Today: As rationing came to an end, burgers began to fatten up. “Chains like Burger King came along offering bigger burgers with more meat, and the increased competition led to an arms race of the sizes and the styles of burgers,” Smith says. As a result, the average fast-food burger has quadrupled in size since the 1950s and now stands at a gut-busting 12 ounces. Fries, meanwhile, have nearly doubled in size, weighing in at 6.7 ounces (again according to the CDC)."}, {"5cfe": "The Health Implications"}, {"caa5": "1950s: As previously mentioned, the quality of meat in the average burger was a serious issue in the early 1900s, but public outrage led emerging restaurants like White Castle to make the cleanliness and purity of their food a prioritized selling point. And so, thanks to the combination of more natural ingredients and lower portion sizes, the occasional burger was less likely to be frowned upon by your doctor. “It’s important to remember that obesity was a minor problem in the 1950s and 1960s,” says Smith. “Burgers could (and can) be healthy — it all depends on the quality and quantity of the ingredients.”"}, {"a3ff": "Today: “The size of meals today and the types of fat have changed,” says Barry Sears of the Inflammation Research Foundation. “The greater amounts of refined carbs, the addition of sugar to the hamburger buns and the replacement of saturated fat by omega-6 fats (especially in the French fries) all lead to dangerous levels of insulin and inflammation — the leading causes for heart disease.”"}, {"2986": "Plus, almost everything has been super-sized compared to the 1950s, including levels of sodium: The FDA recommends no more than 2,300 milligrams of sodium a day, but a McDonald’s Big Mac packs in 1,007 milligrams by itself, with another 350 milligrams in a large order of fries."}, {"416a": "It’s not just the big fast-food chain burgers, either. Australian consumer advocacy magazine Choice compared McDonald’s burgers to self-proclaimed “healthy” gourmet burgers, and found that despite boasting a lack of preservatives in the buns and condiments, the gourmet burgers themselves averaged 40 percent more calories than the Big Mac, with “startling amounts of artery-clogging saturated fat.” Their study mentions one gourmet burger from Aussie chain Grill’d, called The Mighty, “that manages to fit 19.9 grams of saturated fat into a single burger [a Big Mac has 11.3 grams].” If you’re an average adult with a daily intake of around 2,000 calories, your daily saturated fat intake should be capped at 23 grams — or just about 3 more grams than are in The Mighty."}, {"4318": "The Future"}, {"5df0": "So where is the burger and fries headed? According to the experts, the most likely answer is: Down. Traditional hamburgers sales have certainly declined, and according to a survey by Mintel, a market intelligence agency, “Interest in non-beef burger offerings is highest among millennials, who are the most likely generation to agree that healthiness of menu items is the most important factor.”"}, {"811e": "But what about the longer term? What will burgers look like by, say, the 2050s? There are a couple of reasonable predictions, the first of which involves meat specially grown in laboratories. Lab-grown meat startups are popping up all over the place, aiming to decrease our reliance on industrialized livestock, water, antibiotics and the sheer amount of space cattle farming takes up. This is no meat-flavored tofu substitute, either: This is actual meat, trillions of meat cells grown from a single stem cell, then formed into muscle tissue and grown into a meat patty. It’s an expensive process, but it’s getting exponentially cheaper (30,000 times cheaper in just four years, to be exact). And as recent taste tests have proved, if the cost can be brought down, it may be a viable source of protein for the next generation."}, {"c3f5": "Insect food stall in Bangkok, Thailand"}, {"3ed6": "On the other hand — and possibly even less appetizing than meat grown in a petri dish — there’s increasing momentum to introduce more bugs into our food. Insects are a popular source of protein in most of the world outside of the U.S. and Western Europe — fried spiders, for example, are a delicacy in Cambodia, while fried scorpion is a common street meat in China and Thailand. Insect meat is around 60 to 70 percent protein with almost zero fat, and takes up a minute fraction of the resources required for cattle farming, which is why the U.N. is keen to encourage Western nations to give bugs a try."}, {"d980": "As to whether Americans will ever accept as their national icon a burger made of crickets or silkworms? Only time will tell."}, {"b5ce": "Quinn Myers is a writer based in Chicago. He last wrote about money lessons from a retiree, a CEO and a starving artist."}, {"3731": "More fast food:"}, {"b954": "Here’s What Taco Bell’s Low-Key Healthy Revolution Tastes LikeTaco Bell? More like Taco Blahmelmagazine.com"}, {"8d74": "Taco Bell’s Healthy Menu Options Drove Us to Taste-Test the Naked Chicken ChalupaIn the end, we came to regret both equallymelmagazine.com"}, {"33a1": "The Tumultuous Marriage Behind the McDonald’s EmpireThe first couple of fast food argued over way more than just who got the last nuggetmelmagazine.com"}], "child": "883_1"}