{"name": "888", "parent": "", "content": "We Used to Stash Booze in Hollow Eggs; Now We Have Fake Tampons for That A look at the weird history of hiding booze When you complain about The World Today and Its Many Problems, there is something important to remember about how far we’ve come: In all of human history, there has never been a better time to purchase novelty products for hiding alcohol. An Amazon search for “hidden flask” reveals hundreds of options, from the strap-on external beer “belly” to a “Flask Party Pack” that promises a flask that looks like a bottle of sunscreen and five flasks that look like tampons — plus a funnel, presumably to pour your sunscreen into your tampons. But people have been trying to hock mass-produced products that conceal hooch for over 100 years. In 1883, a man named Herbert W. T. Jenner submitted a patent for a book flask, noting that, with previous flasks, “in no case has the ornamental covering been made so as to entirely cover and conceal the flask from ready observation, and at the same time admit ready access to its contents.” Basically, he came up with a way to hide his drinking while also looking like one of those jerks who carry a book around without ever reading it. Another classy-looking late-1800s offering was the flask cane. If you occasionally let your mind soak in the digital Everclear known as TMZ, you might remember this video of the NFL’s Mark Sanchez rocking a modern one at the Kentucky Derby: But the device was first made popular by French painter Henri de Toulouse-Lautrec, who died in 1901 (in some places, flask canes are actually called Toulouse-Lautrecs). Toulouse-Lautrec suffered from several congenital health conditions due to inbreeding, and had to walk with a cane. But he used that fact to his advantage by having a custom cane created with a hidden flask under the handle. Some claim that he used it to hide absinthe because the spirit was illegal at the time, but other historians point to a different reason for his hidden flask: stymying his family’s attempts to get his alcoholism under control. Unsurprisingly, it was Prohibition that elevated hiding alcohol to a true art. In the 13-year period of Prohibition in the United States, there were flasks hidden in garters, boots, and hats. Some women wore shoes that could hold a shot in the heel. Really, pretty much anything that could conceivably hold sneaky alcohol was put into use. Susan Cheever writes in her book Drinking in America: “Others carried bottles in carefully tailored loose clothing, in hoses wrapped around them with stoppers at each end, in hot water bottles, in barrels, and once in two dozen eggs that had been carefully emptied out and refilled with whiskey.” National Photo Company Collection, Library of Congress, 1926. But using a hollow egg was, in some ways, child’s play (and not just because blowing the inside out of eggs is a craft many of us did during childhood). One of the most successful ways to “hide” liquor during prohibition was to call it medicine. Doctors at the time were allowed to write prescriptions for “medicinal whiskey,” much as we have “medical marijuana” today, but with fewer legitimate medical reasons for it. There was even a movement to make beer a doctor-prescribed substance, which people at the time rightly called bullshit on. Patent medicines — brand-name, over-the-counter medications — were also a big source of hidden-ish alcohol. A patent medicine known as Jamaica Ginger was good to get sloshed on until, Cheever writes, the government order it to change its recipe so that it “had a sufficient solid content to make it undrinkable.” But bootleggers figured out how to add a plasticizer that made the stuff quaffable again — and also led to thousands of people getting paralyzed by the concoction. If you could get your mitts on bootleg liquor, it was safer to stick to a flask. Jamaica Ginger advertisement from Puck magazine, 1884 Of course, soon enough, people didn’t need the patent medicines or the flasks anyway. As Frank Kelly Rich noted in his history of the flask for Modern Drunkard, unsurprisingly, “The popularity of the flask immediately began to fade when it once again became legal to walk into a bar and procure legal liquor like a regular human being.” Thus, the mid-20th century was a mini dark ages for the invention of sneaky drinking devices. The boozy renaissance picked up in the 1960s with a company named Royal London Ltd., which started selling a flask that looked like a radio — amusing partially because, in the same decade, Popular Science wrote about a radio that looked like a flask. (We can rest assured that both products were a disappointment to someone.) In the 1970s, Royal London kept it going with BARnoculars, and the company also made a series of much-less-sneaky car-grill flasks that played music when you opened them, as if to say, “Hey, everyone look at this showy asshole who insists on keeping his whiskey in a Rolls Royce grill.” Like most of today’s alcohol-hiding tools, Royal London’s flasks were gaudy while trying to be understated, like a Spencer’s Gifts tried to dress up as a J. Crew. And, like a Spencer’s Gifts shirt, the history of hiding booze can use humor to glaze over some really uncomfortable truths. (And I don’t just mean physically uncomfortable, like when you’re carrying four nips of Bulleit in your underwear to get through security at Dodger Stadium.) Because many of us think of booze-hiding as being about avoiding paying $10 for a Bud Light at a concert or taking a bit of gin to your cousin’s dry wedding, it’s easy to try to ignore the fact that hiding booze has also long been the domain of people who have a serious addiction. When we think about history, it’s really easy to pick the parts we like and ignore the parts we don’t. I’m all for covert booze; I’m currently sitting in a house that, between two people, has at least five flasks (including his-and-hers Prince flasks purchased at Knotts Berry Farm). But maybe, when it comes to the Flask Party Pack, we can get by with just the sunscreen flask, and leave the tampon flasks at home. Meg Favreau is a Los Angeles–based writer of funny, sad, and strange things. Her writing has appeared in McSweeney’s, Table Matters, Someecards, a sketch comedy show for Vine stars and her website, megfavreau.com. The Delightfully Disturbing Holiday Displays of YesteryearYou’ll never look at Santa Claus the same way againmelmagazine.com Watching Someone Get Hit in the Nuts Has Always United HumanityThe history of bloopers, from phonograph fuck-ups to today’s YouTube varietymelmagazine.com Replace Your Emoji With 17th-Century MonstersSome suggestions for really freaking out your friends this Halloweenmelmagazine.com ", "title": "We Used to Stash Booze in Hollow Eggs; Now We Have Fake Tampons for That", "sentences": [{"857b": "We Used to Stash Booze in Hollow Eggs; Now We Have Fake Tampons for That"}, {"e4ad": "A look at the weird history of hiding booze"}, {"b822": "When you complain about The World Today and Its Many Problems, there is something important to remember about how far we’ve come: In all of human history, there has never been a better time to purchase novelty products for hiding alcohol. An Amazon search for “hidden flask” reveals hundreds of options, from the strap-on external beer “belly” to a “Flask Party Pack” that promises a flask that looks like a bottle of sunscreen and five flasks that look like tampons — plus a funnel, presumably to pour your sunscreen into your tampons."}, {"c6dd": "But people have been trying to hock mass-produced products that conceal hooch for over 100 years. In 1883, a man named Herbert W. T. Jenner submitted a patent for a book flask, noting that, with previous flasks, “in no case has the ornamental covering been made so as to entirely cover and conceal the flask from ready observation, and at the same time admit ready access to its contents.” Basically, he came up with a way to hide his drinking while also looking like one of those jerks who carry a book around without ever reading it."}, {"cada": "Another classy-looking late-1800s offering was the flask cane. If you occasionally let your mind soak in the digital Everclear known as TMZ, you might remember this video of the NFL’s Mark Sanchez rocking a modern one at the Kentucky Derby:"}, {"c4b0": "But the device was first made popular by French painter Henri de Toulouse-Lautrec, who died in 1901 (in some places, flask canes are actually called Toulouse-Lautrecs). Toulouse-Lautrec suffered from several congenital health conditions due to inbreeding, and had to walk with a cane. But he used that fact to his advantage by having a custom cane created with a hidden flask under the handle. Some claim that he used it to hide absinthe because the spirit was illegal at the time, but other historians point to a different reason for his hidden flask: stymying his family’s attempts to get his alcoholism under control."}, {"da13": "Unsurprisingly, it was Prohibition that elevated hiding alcohol to a true art. In the 13-year period of Prohibition in the United States, there were flasks hidden in garters, boots, and hats. Some women wore shoes that could hold a shot in the heel. Really, pretty much anything that could conceivably hold sneaky alcohol was put into use. Susan Cheever writes in her book Drinking in America: “Others carried bottles in carefully tailored loose clothing, in hoses wrapped around them with stoppers at each end, in hot water bottles, in barrels, and once in two dozen eggs that had been carefully emptied out and refilled with whiskey.”"}, {"f4c5": "National Photo Company Collection, Library of Congress, 1926."}, {"7244": "But using a hollow egg was, in some ways, child’s play (and not just because blowing the inside out of eggs is a craft many of us did during childhood). One of the most successful ways to “hide” liquor during prohibition was to call it medicine. Doctors at the time were allowed to write prescriptions for “medicinal whiskey,” much as we have “medical marijuana” today, but with fewer legitimate medical reasons for it. There was even a movement to make beer a doctor-prescribed substance, which people at the time rightly called bullshit on."}, {"8a32": "Patent medicines — brand-name, over-the-counter medications — were also a big source of hidden-ish alcohol. A patent medicine known as Jamaica Ginger was good to get sloshed on until, Cheever writes, the government order it to change its recipe so that it “had a sufficient solid content to make it undrinkable.” But bootleggers figured out how to add a plasticizer that made the stuff quaffable again — and also led to thousands of people getting paralyzed by the concoction. If you could get your mitts on bootleg liquor, it was safer to stick to a flask."}, {"34f6": "Jamaica Ginger advertisement from Puck magazine, 1884"}, {"34e1": "Of course, soon enough, people didn’t need the patent medicines or the flasks anyway. As Frank Kelly Rich noted in his history of the flask for Modern Drunkard, unsurprisingly, “The popularity of the flask immediately began to fade when it once again became legal to walk into a bar and procure legal liquor like a regular human being.”"}, {"ca1b": "Thus, the mid-20th century was a mini dark ages for the invention of sneaky drinking devices. The boozy renaissance picked up in the 1960s with a company named Royal London Ltd., which started selling a flask that looked like a radio — amusing partially because, in the same decade, Popular Science wrote about a radio that looked like a flask. (We can rest assured that both products were a disappointment to someone.) In the 1970s, Royal London kept it going with BARnoculars, and the company also made a series of much-less-sneaky car-grill flasks that played music when you opened them, as if to say, “Hey, everyone look at this showy asshole who insists on keeping his whiskey in a Rolls Royce grill.”"}, {"4a5a": "Like most of today’s alcohol-hiding tools, Royal London’s flasks were gaudy while trying to be understated, like a Spencer’s Gifts tried to dress up as a J. Crew. And, like a Spencer’s Gifts shirt, the history of hiding booze can use humor to glaze over some really uncomfortable truths. (And I don’t just mean physically uncomfortable, like when you’re carrying four nips of Bulleit in your underwear to get through security at Dodger Stadium.) Because many of us think of booze-hiding as being about avoiding paying $10 for a Bud Light at a concert or taking a bit of gin to your cousin’s dry wedding, it’s easy to try to ignore the fact that hiding booze has also long been the domain of people who have a serious addiction."}, {"e794": "When we think about history, it’s really easy to pick the parts we like and ignore the parts we don’t. I’m all for covert booze; I’m currently sitting in a house that, between two people, has at least five flasks (including his-and-hers Prince flasks purchased at Knotts Berry Farm). But maybe, when it comes to the Flask Party Pack, we can get by with just the sunscreen flask, and leave the tampon flasks at home."}, {"f18c": "Meg Favreau is a Los Angeles–based writer of funny, sad, and strange things. Her writing has appeared in McSweeney’s, Table Matters, Someecards, a sketch comedy show for Vine stars and her website, megfavreau.com."}, {"eb9c": "The Delightfully Disturbing Holiday Displays of YesteryearYou’ll never look at Santa Claus the same way againmelmagazine.com"}, {"af50": "Watching Someone Get Hit in the Nuts Has Always United HumanityThe history of bloopers, from phonograph fuck-ups to today’s YouTube varietymelmagazine.com"}, {"7ffa": "Replace Your Emoji With 17th-Century MonstersSome suggestions for really freaking out your friends this Halloweenmelmagazine.com"}], "child": "888_1\t888_2"}