{"name": "890", "parent": "", "content": "Let’s Talk About Bald-Shaming The latest salvo in the ongoing saga of male body-shaming is a new piece from Men’s Health explaining why your man bun could be making you bald. “If you’re one of the cool guys emulating samurai, you could be causing your hairline to recede,” they write, before explaining how tight buns stress the hair follicles and could lead to alopecia, aka hair loss, aka Get out of here, baldy. Nothing wrong with a little friendly beauty advice for dudes, but what happened to “bald is beautiful”? Isn’t it strange to instruct men to embrace their chrome dome — noting not only that bald men are more confident and attractive but that they also get the babes — while simultaneously instructing them to avoid it at all costs? Not if you’re a woman. This is precisely the sort of jerk-around beauty advice ladies have been getting for years: You’re great how exactly how you are — now change. Only our advice goes something like this: Fat is beautiful, but here’s how to drop the weight in a few short weeks. Embrace aging, but here are 18 serums to stop it in its tracks. Your vagina is fine! Now hose it down. Women are used to being told they’re doing everything wrong, from pubes to faces to pregnancy, while men are usually left alone to have a dadbod and still be considered fuckable. Part of this is about capitalism: It’s harder to sell to people who like themselves, and at the end of the day, men’s money is just as green as women’s — it’s why the market for men’s grooming products is now booming. But with that shift comes a strange new world: Men are starting to get it both ways, too, and it’s a recurring complaint from men in the body positivity movement. Before they can start a good dialog about how it feels to be body shamed, they first have the fight the stereotype that aren’t supposed to care about how they look in the first place. Of course, women understand — given our access to makeup and contouring and product and flattering outfits — that pretty is really a set of skills. Pampering and perfuming to put the goods in the best possible light is part and parcel of performing femininity. But we haven’t historically asked this kind of aesthetic energy of men, and giving men a pass on baldness would seem to signal our understanding that they have had fewer tricks up their sleeve to alter their appearances. Spencer Kobren, Founder of the American Hair Loss Association, gets at this in some of his discussions of baldness. He calls bald shaming the “last bastion of political incorrectness” — an area of male body-shaming for which we offer men no protection. In a video in his series “The Bald Truth,” he tells an anecdote about a woman approaching him at dinner in Los Angeles one night who compliments his hair and is surprised when he tells her that he actually paints the back of his head to hide the balding. She tells him it’s absolutely ridiculous to care so much about something so trivial. He notes the irony that the comment is coming from a 45-year-old woman who has clearly spackled so much makeup on her face that her real face is virtually undetectable. “This is all I got,” he said, referring to his appearance. “This is basically what I look like. I don’t wear a face full of makeup, a push-up bra, a spray-on tan, fake nails, high heels. I had a shirt on, my head was painted, and I was ready to go. This woman was basically wearing a costume to leave the house…. The fact that she would even consider trivializing what we go through when it probably takes her three hours to get out of the fucking house in the morning is laughable to me, and I think it illustrates the insanity that is the way society views men dealing with issues with their appearance. They want every man to look like George Clooney, but if he tries to maintain his appearance, there’s something wrong with them.” He’s obviously pissed — and he fails to realize that in spite of his looks being harder to alter, as a man, he doesn’t have to be good looking if he’s funny or, say, really rich — but that doesn’t mean his sentiment is wrong. Bald men are the butt of jokes. Being bald is bad, but not as bad as being vain about it. French dating app Zoosk ran a campaign a few years ago promoting that they verify the photos of their users, with the example being a profile photo of a dater compared with his “real” photo, in which he’s bald. The picture was removed after some protest online from bald men, but a hair loss forum captured it for discussion before that happened. “Did anyone give a fuck?” a user asked about the image. “Did the social justice warriors come out swinging? No, because it’s men and we don’t exist but also because apparently baldness is supposed to be funny. Why?” Well, it can be funny. In an episode of Curb Your Enthusiasm, Larry David calls the cops to report a hate crime: Some kids who spray painted “Bald Asshole” on his front door when he wouldn’t give them candy on Halloween. “I don’t deserve this,” he says. “Bald asshole? That’s a hate crime. We’re a sect. We’re a group. You can’t call us bald assholes. What if we were gay? Then it’d be gay asshole. That’s a hate crime!” The cops laugh it off. “Sir, I’m bald and I’m not offended,” one cop says, pointing to the graffiti. “With all due respect, Officer, you’re not bald,” Larry David objects. “You have chosen to shave your hair; that’s a look you’re cultivating to be fashionable and we don’t really consider you a part of the bald community, with all due respect.” This may be a critical distinction: Baldness is an affliction, one not chosen, so it’s punching down to knock a dude who can’t do much about losing his hair. Not helping matters is that women sometimes take a strange comfort in this insecurity. In 2015, Jessica Machado wrote a piece at New York magazine’s “The Cut” in which she admitted to a little bald schadenfreude. The piece was called “I Love Watching Men Worry About Balding.” In it, she discusses watching the aging men in her life begin to slowly and quietly melt down about their hair. Men who rarely admit to being affected by body-shame fears (aside from the odd beer gut or short-guy joke) are suddenly candid about losing their hair. Machado writes: “What I do is, I shave my widow’s peak back a bit, so it doesn’t look like I’m receding that bad,” one friend said to another. Another buddy relayed a story of being humiliated by a homeless man who called out, “Hey, baldy, how ’bout some change?” A third will beat everyone to a punch that no one was about to throw: “How threatening am I? I’m the bald dude at the bar!” She’s not into “egging on a balding man’s fears” — it’s just that there’s a fascination in seeing such a forthright display of male insecurity. It’s humanizing. Men! They really are just like us! “…Just when you get your shit together, your life’s in better financial order, you’re building a family, you’re more comfortable with yourself, not really thinking about appearance stuff anymore, then you start to lose your hair,” Machado’s husband tells her. “It’s humbling.” The internal panic, she notes — across celebrities who seem to rush to get hair implants before a hint of balding sets in (McConaughey, Affleck, Chris Martin) — doesn’t translate to problems in the real world. Studies show bald men appear stronger and more dominant. Chris Martin Maybe all this fluffing about balding is just a way of masking how vain men can really be about their looks. Maybe balding is only great if you happen to look like Vin Diesel. Maybe at best, and in spite of the studies, balding is still something men resign themselves to putting up with but would never actually choose. A different Curb Your Enthusiasm episode has two men simultaneously delighting and commiserating in their shared baldness. “Lotta sunscreen, right?” Larry David notes. “No convertibles!” When the hair goes, it seems, you make the best out of balding; you don’t celebrate it. Sucks, dudes. But welcome to our world. For every man’s fear of balding, women are spinning multiple plates of aging angst. To name a few: weight gain, saggy tits, crow’s feet, arm flab, stretch marks, armpit fat, wrinkly knees — and every other microscopic part of our bodies that has been spliced and diced for improvement for decades by an industry with an eagle eye, hell-bent on squeezing every last dime out of our insecurities. None of this is to suggest that men deserve bald-shaming, or that, like women, they should now be finger-wagged into misery over things they can do little about (and shouldn’t have to). But if if true equality is equal exploitation of the sexes, then instead of giving all of us a break on this relentless pressure to look better, it seems we’re just getting ever closer to making everybody feel equally like shit about themselves. Cheers? Tracy Moore is a staff writer at MEL. She last wrote about why some people recall hangover more vividly. More balding: The Stories Behind the Craziest Inventions Men Have Used to Color in Their Bald SpotsBecause spray-on hair and scalp tattoos beat hair plugs and toupees every timemelmagazine.com A Bald New WorldThroughout history, one thing has united all men: we’re scared shitless of losing our hairmelmagazine.com All of the Evidence in the Mystery of Matthew McConaughey’s HairMaybe he didn’t have to go bald for ‘Gold.’ Maybe it was that way all along?melmagazine.com ", "title": "Let’s Talk About Bald-Shaming", "sentences": [{"9528": "Let’s Talk About Bald-Shaming"}, {"78ca": "The latest salvo in the ongoing saga of male body-shaming is a new piece from Men’s Health explaining why your man bun could be making you bald. “If you’re one of the cool guys emulating samurai, you could be causing your hairline to recede,” they write, before explaining how tight buns stress the hair follicles and could lead to alopecia, aka hair loss, aka Get out of here, baldy."}, {"4b9f": "Nothing wrong with a little friendly beauty advice for dudes, but what happened to “bald is beautiful”? Isn’t it strange to instruct men to embrace their chrome dome — noting not only that bald men are more confident and attractive but that they also get the babes — while simultaneously instructing them to avoid it at all costs?"}, {"c8b6": "Not if you’re a woman. This is precisely the sort of jerk-around beauty advice ladies have been getting for years: You’re great how exactly how you are — now change. Only our advice goes something like this: Fat is beautiful, but here’s how to drop the weight in a few short weeks. Embrace aging, but here are 18 serums to stop it in its tracks. Your vagina is fine! Now hose it down. Women are used to being told they’re doing everything wrong, from pubes to faces to pregnancy, while men are usually left alone to have a dadbod and still be considered fuckable."}, {"1752": "Part of this is about capitalism: It’s harder to sell to people who like themselves, and at the end of the day, men’s money is just as green as women’s — it’s why the market for men’s grooming products is now booming. But with that shift comes a strange new world: Men are starting to get it both ways, too, and it’s a recurring complaint from men in the body positivity movement. Before they can start a good dialog about how it feels to be body shamed, they first have the fight the stereotype that aren’t supposed to care about how they look in the first place."}, {"cf6f": "Of course, women understand — given our access to makeup and contouring and product and flattering outfits — that pretty is really a set of skills. Pampering and perfuming to put the goods in the best possible light is part and parcel of performing femininity. But we haven’t historically asked this kind of aesthetic energy of men, and giving men a pass on baldness would seem to signal our understanding that they have had fewer tricks up their sleeve to alter their appearances."}, {"7810": "Spencer Kobren, Founder of the American Hair Loss Association, gets at this in some of his discussions of baldness. He calls bald shaming the “last bastion of political incorrectness” — an area of male body-shaming for which we offer men no protection. In a video in his series “The Bald Truth,” he tells an anecdote about a woman approaching him at dinner in Los Angeles one night who compliments his hair and is surprised when he tells her that he actually paints the back of his head to hide the balding. She tells him it’s absolutely ridiculous to care so much about something so trivial. He notes the irony that the comment is coming from a 45-year-old woman who has clearly spackled so much makeup on her face that her real face is virtually undetectable."}, {"3c24": "“This is all I got,” he said, referring to his appearance."}, {"e8d2": "“This is basically what I look like. I don’t wear a face full of makeup, a push-up bra, a spray-on tan, fake nails, high heels. I had a shirt on, my head was painted, and I was ready to go. This woman was basically wearing a costume to leave the house…. The fact that she would even consider trivializing what we go through when it probably takes her three hours to get out of the fucking house in the morning is laughable to me, and I think it illustrates the insanity that is the way society views men dealing with issues with their appearance. They want every man to look like George Clooney, but if he tries to maintain his appearance, there’s something wrong with them.”"}, {"1fe5": "He’s obviously pissed — and he fails to realize that in spite of his looks being harder to alter, as a man, he doesn’t have to be good looking if he’s funny or, say, really rich — but that doesn’t mean his sentiment is wrong. Bald men are the butt of jokes. Being bald is bad, but not as bad as being vain about it."}, {"e6b3": "French dating app Zoosk ran a campaign a few years ago promoting that they verify the photos of their users, with the example being a profile photo of a dater compared with his “real” photo, in which he’s bald. The picture was removed after some protest online from bald men, but a hair loss forum captured it for discussion before that happened."}, {"5ac5": "“Did anyone give a fuck?” a user asked about the image. “Did the social justice warriors come out swinging? No, because it’s men and we don’t exist but also because apparently baldness is supposed to be funny. Why?”"}, {"22d5": "Well, it can be funny. In an episode of Curb Your Enthusiasm, Larry David calls the cops to report a hate crime: Some kids who spray painted “Bald Asshole” on his front door when he wouldn’t give them candy on Halloween. “I don’t deserve this,” he says. “Bald asshole? That’s a hate crime. We’re a sect. We’re a group. You can’t call us bald assholes. What if we were gay? Then it’d be gay asshole. That’s a hate crime!” The cops laugh it off. “Sir, I’m bald and I’m not offended,” one cop says, pointing to the graffiti."}, {"b630": "“With all due respect, Officer, you’re not bald,” Larry David objects. “You have chosen to shave your hair; that’s a look you’re cultivating to be fashionable and we don’t really consider you a part of the bald community, with all due respect.”"}, {"75c8": "This may be a critical distinction: Baldness is an affliction, one not chosen, so it’s punching down to knock a dude who can’t do much about losing his hair."}, {"bd85": "Not helping matters is that women sometimes take a strange comfort in this insecurity. In 2015, Jessica Machado wrote a piece at New York magazine’s “The Cut” in which she admitted to a little bald schadenfreude. The piece was called “I Love Watching Men Worry About Balding.” In it, she discusses watching the aging men in her life begin to slowly and quietly melt down about their hair. Men who rarely admit to being affected by body-shame fears (aside from the odd beer gut or short-guy joke) are suddenly candid about losing their hair. Machado writes:"}, {"a990": "“What I do is, I shave my widow’s peak back a bit, so it doesn’t look like I’m receding that bad,” one friend said to another. Another buddy relayed a story of being humiliated by a homeless man who called out, “Hey, baldy, how ’bout some change?” A third will beat everyone to a punch that no one was about to throw: “How threatening am I? I’m the bald dude at the bar!”"}, {"0758": "She’s not into “egging on a balding man’s fears” — it’s just that there’s a fascination in seeing such a forthright display of male insecurity. It’s humanizing. Men! They really are just like us!"}, {"5e82": "“…Just when you get your shit together, your life’s in better financial order, you’re building a family, you’re more comfortable with yourself, not really thinking about appearance stuff anymore, then you start to lose your hair,” Machado’s husband tells her. “It’s humbling.”"}, {"eccd": "The internal panic, she notes — across celebrities who seem to rush to get hair implants before a hint of balding sets in (McConaughey, Affleck, Chris Martin) — doesn’t translate to problems in the real world. Studies show bald men appear stronger and more dominant."}, {"67c0": "Chris Martin"}, {"0bc3": "Maybe all this fluffing about balding is just a way of masking how vain men can really be about their looks. Maybe balding is only great if you happen to look like Vin Diesel. Maybe at best, and in spite of the studies, balding is still something men resign themselves to putting up with but would never actually choose."}, {"98a4": "A different Curb Your Enthusiasm episode has two men simultaneously delighting and commiserating in their shared baldness. “Lotta sunscreen, right?” Larry David notes. “No convertibles!” When the hair goes, it seems, you make the best out of balding; you don’t celebrate it."}, {"0e3f": "Sucks, dudes. But welcome to our world. For every man’s fear of balding, women are spinning multiple plates of aging angst. To name a few: weight gain, saggy tits, crow’s feet, arm flab, stretch marks, armpit fat, wrinkly knees — and every other microscopic part of our bodies that has been spliced and diced for improvement for decades by an industry with an eagle eye, hell-bent on squeezing every last dime out of our insecurities."}, {"402f": "None of this is to suggest that men deserve bald-shaming, or that, like women, they should now be finger-wagged into misery over things they can do little about (and shouldn’t have to). But if if true equality is equal exploitation of the sexes, then instead of giving all of us a break on this relentless pressure to look better, it seems we’re just getting ever closer to making everybody feel equally like shit about themselves. Cheers?"}, {"c471": "Tracy Moore is a staff writer at MEL. She last wrote about why some people recall hangover more vividly."}, {"4d5b": "More balding:"}, {"6b01": "The Stories Behind the Craziest Inventions Men Have Used to Color in Their Bald SpotsBecause spray-on hair and scalp tattoos beat hair plugs and toupees every timemelmagazine.com"}, {"be35": "A Bald New WorldThroughout history, one thing has united all men: we’re scared shitless of losing our hairmelmagazine.com"}, {"da38": "All of the Evidence in the Mystery of Matthew McConaughey’s HairMaybe he didn’t have to go bald for ‘Gold.’ Maybe it was that way all along?melmagazine.com"}], "child": "890_1"}