{"name": "892", "parent": "", "content": "Eat Alone, Die an Early Death Even if you dine solo by choice Bad news for men who like eating alone without anyone yapping at them: You might be more likely to kick the bucket early. A survey of nearly 30,000 elderly men in Japan over a three-year period found that men who lived and dined alone had a 20 percent higher death rate than those who lived and dined with family, Japan Times reported. But men who lived and dined alone even though they could eat with their own families had a 50 percent greater chance of death during that same period. What’s going on here, Gramps? The survey, conducted by researchers at Tokyo Dental and Medical University, looked at 29,182 men in Tokyo who were 65 and over to investigate the premise that eating alone affects mortality. They found that 7.3 percent of the men who lived alone and dined alone died during the three years. However, 9.5 percent of the men who lived with family but declined to eat with that family died. Make no mistake, though. The men who were luckiest — those who lived with family and liked them enough to eat with them — still died. Just not as many: Only 6 percent of those guys kicked the bucket over the three-year monitoring period. This is interesting for a few reasons: We typically think of the eating alone issue as a woman problem, and an emotional one at that. “Is there anything more pathetic for a single woman than having to utter the words “Table for One?” Elisa Doucette wrote at Forbes a few years ago, of the deep-seated fear women have of appearing like lonely, desperate spinsters when they order a salad out at a restaurant by themselves. Women are encouraged to overcome the perception of scorn or pity they imagine other diners are projecting their way by forging ahead. What’s more, most stories that encourage eating alone seem to be speaking to women, telling them that it’s okay to enjoy their own company and adding that people who do it are in fact really strong and awesome, because bucking convention in this way takes bulletproof self-esteem. Men, on the other hand, don’t seem to face such a stigma, so for them eating alone is usually treated as no big deal. It’s worth noting here that the stigma of eating alone is probably not as bad for either gender as we tend to think. One survey found that people didn’t judge men and women for eating alone quite as negatively as the solo diners imagined — while some people thought men who ate alone were lonely, others saw a lone man eating as secure. (And overall, we always think people are looking at as and judging us more than they really are—something called the spotlight effect.) Nonetheless, the researchers note that there may be gendered differences when it comes to mortality, based on a previous study they conducted of some 71,781 elderly men and women who dined alone. (None of the elderly folks in these studies required assistance from others to walk, bathe or use the bathroom.) Because women are typically considered more sociable and proactive about keeping up friendships, they note, it’s likely much easier for them to find dining company. So a woman working to gain the confidence to eat alone is basically practicing independence and self-esteem, whereas a man going it alone was more likely to be a sign of depression, inadequate care or elder abuse. Lone male diners were also more likely to be malnourished and have lower body weight — a problem that didn’t come up with solo female diners. Regardless of all this grim news for men, eating alone is still associated with positive behaviors — we tend eat less alone than when with others; we may be more mindful when we eat alone. And if you don’t feel like talking or listening to someone drone on about their day while you’re trying to enjoy dinner, it can obviously be more relaxing. But all this is probably only true if you’re maintaining good relationships and positive connections that often extend to sharing meals. If not, eat up anyway, and make it count. Life, in your case, is even shorter than you thought. Tracy Moore is a staff writer at MEL. She last wrote about how to make love like a sensitive T-Rex. More death: Old Men Are Fucking Themselves to DeathA new study shows that old men who frequently have sex do so to the detriment of their healthmelmagazine.com A Matter Of ‘My So-Called Life’ Or DeathWhen the ‘90s cult classic was canceled, devastated fans fought back—and created a strategy we’re still usingmelmagazine.com ‘I Blacked Out Trying to Run Across Death Valley’In our new series, What I Learned from Getting My Ass Kicked, people from all walks of life discuss setbacks that could…melmagazine.com ", "title": "Eat Alone, Die an Early Death", "sentences": [{"03c4": "Eat Alone, Die an Early Death"}, {"af31": "Even if you dine solo by choice"}, {"9d99": "Bad news for men who like eating alone without anyone yapping at them: You might be more likely to kick the bucket early. A survey of nearly 30,000 elderly men in Japan over a three-year period found that men who lived and dined alone had a 20 percent higher death rate than those who lived and dined with family, Japan Times reported. But men who lived and dined alone even though they could eat with their own families had a 50 percent greater chance of death during that same period. What’s going on here, Gramps?"}, {"77a2": "The survey, conducted by researchers at Tokyo Dental and Medical University, looked at 29,182 men in Tokyo who were 65 and over to investigate the premise that eating alone affects mortality. They found that 7.3 percent of the men who lived alone and dined alone died during the three years. However, 9.5 percent of the men who lived with family but declined to eat with that family died. Make no mistake, though. The men who were luckiest — those who lived with family and liked them enough to eat with them — still died. Just not as many: Only 6 percent of those guys kicked the bucket over the three-year monitoring period."}, {"3a91": "This is interesting for a few reasons: We typically think of the eating alone issue as a woman problem, and an emotional one at that. “Is there anything more pathetic for a single woman than having to utter the words “Table for One?” Elisa Doucette wrote at Forbes a few years ago, of the deep-seated fear women have of appearing like lonely, desperate spinsters when they order a salad out at a restaurant by themselves."}, {"9a56": "Women are encouraged to overcome the perception of scorn or pity they imagine other diners are projecting their way by forging ahead. What’s more, most stories that encourage eating alone seem to be speaking to women, telling them that it’s okay to enjoy their own company and adding that people who do it are in fact really strong and awesome, because bucking convention in this way takes bulletproof self-esteem. Men, on the other hand, don’t seem to face such a stigma, so for them eating alone is usually treated as no big deal."}, {"04d7": "It’s worth noting here that the stigma of eating alone is probably not as bad for either gender as we tend to think. One survey found that people didn’t judge men and women for eating alone quite as negatively as the solo diners imagined — while some people thought men who ate alone were lonely, others saw a lone man eating as secure. (And overall, we always think people are looking at as and judging us more than they really are—something called the spotlight effect.)"}, {"6a50": "Nonetheless, the researchers note that there may be gendered differences when it comes to mortality, based on a previous study they conducted of some 71,781 elderly men and women who dined alone. (None of the elderly folks in these studies required assistance from others to walk, bathe or use the bathroom.) Because women are typically considered more sociable and proactive about keeping up friendships, they note, it’s likely much easier for them to find dining company."}, {"bf77": "So a woman working to gain the confidence to eat alone is basically practicing independence and self-esteem, whereas a man going it alone was more likely to be a sign of depression, inadequate care or elder abuse. Lone male diners were also more likely to be malnourished and have lower body weight — a problem that didn’t come up with solo female diners."}, {"e178": "Regardless of all this grim news for men, eating alone is still associated with positive behaviors — we tend eat less alone than when with others; we may be more mindful when we eat alone. And if you don’t feel like talking or listening to someone drone on about their day while you’re trying to enjoy dinner, it can obviously be more relaxing. But all this is probably only true if you’re maintaining good relationships and positive connections that often extend to sharing meals. If not, eat up anyway, and make it count. Life, in your case, is even shorter than you thought."}, {"e5f8": "Tracy Moore is a staff writer at MEL. She last wrote about how to make love like a sensitive T-Rex."}, {"dc61": "More death:"}, {"6701": "Old Men Are Fucking Themselves to DeathA new study shows that old men who frequently have sex do so to the detriment of their healthmelmagazine.com"}, {"232a": "A Matter Of ‘My So-Called Life’ Or DeathWhen the ‘90s cult classic was canceled, devastated fans fought back—and created a strategy we’re still usingmelmagazine.com"}, {"43d7": "‘I Blacked Out Trying to Run Across Death Valley’In our new series, What I Learned from Getting My Ass Kicked, people from all walks of life discuss setbacks that could…melmagazine.com"}], "child": "892_1"}