{"name": "901", "parent": "", "content": "How the Ellipsis Became the Ultimate Power Move When did those three little dots go from collegial to contemptuous? Let me tell you about a colleague I used to have; let’s call them “History’s Greatest Monster.” Now, History’s Greatest Monster and I worked in different departments, but occasionally I would get a request from HGM to do something — usually with no notice, usually something that had to be completed very quickly. When I pushed back, that’s when they began: the short, snarky emails that always ended with an ellipsis — three little dots, goading me, daring me. It was HGM’s power move, and reader, it worked. As an act of digital passive aggression, the ellipsis is far greater than the sum of its parts. The ellipsis used to be coy and playful, imbued with a touch of mystery and intrigue. A cliffhanger to be used after a crucial clue has been uncovered in a detective show, or the final word in a flirtatious conversation — like a winky-face emoji, but less creepy. In his book Making a Point: The Pernickety Story of English Punctuation, British linguist David Crystal describes one context of the ellipsis as “expressing continuation when we wish to convey the notion of ‘something that is unnecessary to specify further.’ ” Like the way you trail off when you’re expecting the person you’re talking to will absolutely already know that the best version of Leonard Cohen’s Hallelujah is… any version except the Leonard Cohen version. The ellipsis used to be a communion between speaker and listener, a small but important cue that said: “Hey, I’m on your side, buddy.” Now, it’s the opposite. Black Mirror creator Charlie Brooker once described Twitter as the world’s greatest video game, where the goal is to amass likes, followers, retweets — essentially, to get a high score. To do that, you perform — you’re funny, or you’re smart, or maybe you work out a cheat whereby you can rise up the rankings faster than average because you post a lot of good pictures of dogs. You also fight, like any video game: You figure out who the enemy is, and you try to beat them, for points. This is where the ellipsis comes in. It has become a finishing move, a power play; the communion it represents is no longer between speaker and listener, but rather between the speaker and those already on their side. Patrick D. Elliott, a Ph.D. candidate in Linguistics at University College London and visiting scholar at Berlin’s Center for General Linguistics, sees it as deliberately performative: “[The ellipsis] used to convey something like the following: ‘I could go on to explain why this is weird, but it’s so obvious to the rest of my audience that I don’t need to bother. Rather, I’m using ellipsis to demonstrate my awareness of this.’ ” In a public forum like Twitter, you’re not only demonstrating your awareness; you’re demonstrating the awareness of the other people invested in the argument you’re having — a surefire way to get gratification in the form of likes and retweets. Because everyone loves a Twitter beef. But this doesn’t explain my inter-office e-mail beef with HGM. Rules that apply on social media can’t be applied to all digital communications, particular those that predate the platform by a good couple of decades. I’m willing to admit there might be a generational divide here, and indeed it’s interesting to see in this Reddit thread how older people are passing off their use of the ellipsis as a sign-off as an attempt at digital etiquette, a carry-over from the habit of ending any written correspondence with a salutation or signature. I, being a freelancer and procrastinator, live my life on Twitter, so I carry over my negative, hostile associations with the ellipsis to another form. Alternatively HGM knew exactly what they were doing, and their use of the ellipsis was even more pointed than I assumed at the time. One thing that does unite email, Twitter, and all digital communications is the durability of the conversations we have there—the idea that anything we say online is committed to canon, and the nuance that we can give to a sentence face-to-face is lost in the fuzz. Spencer Hazel, senior lecturer in applied linguistics and communications at the University of Newcastle in England, suggests that the ellipsis is being used as a means of self-preservation, a way to wriggle out of an argument of opinion you may not want to commit yourself to 100 percent: “It may well be that we develop new strategies for dealing with the durability of what we ‘say’ in the conversations that we have on social media to protect ourselves from online retaliation.” Because the ellipsis is by nature ambiguous, using it can make it easier to say things like “you’ve taken that out of context” or “that’s not what I meant at all” when you know you’ve said something abominable. One consequence of the rise of digital communications has been the recalibration of certain aspects of grammar and syntax that previously were gathering dust at the back of the lexical cupboard. The ellipsis, like its more ubiquitous cousins, the @ and the #, has become newly present in the digital space. Think of how an ellipsis precedes a command — for example, clicking “File” on this document (as I write it in Google Docs) brings me 10 options that end with an ellipsis. In many messaging apps, an animated ellipsis appears when you’re waiting for someone to type out a reply. As we become more familiar communicating online, particular where limits are put on the amount we can say, we begin to imbue smaller words or gestures with new characteristics, so that we can convey more. @ is now a word in and of itself, immortalized in this JME track from 2015; hashtags aren’t necessarily used to make something searchable; and the eggplant emoji was, I’m fairly certain, initially intended to mean “eggplant.” None of us could have predicted that the ellipsis would have its good name sullied, but here we are. However, don’t get complacent. We cannot begin to normalize the use of the ellipsis in this hostile way. We must call out every use of the passive-aggressive ellipsis we see. We need to be able to enjoy ribald whodunnits, casual sexting and Bruce Springsteen’s autobiography (there really are a lot of ellipses in this book, Bruce) without being reminded of its negative connotations. Only by speaking up can we stamp it out. Harry Harris is a songwriter, journalist and headless Thompson gunner. He tweets @CmonHarris, sings @WildSoundRecs and laughs @ own jokes. More from Harry: ‘Fairytale of New York’ Is the Best Christmas Song EverFor decades, Americans have been ignoring Britain’s greatest contribution to holiday music. It’s time to change thatmelmagazine.com From Britain to America, With EmpathyWe saw this coming before you did, but trust us: We’re not laughingmelmagazine.com Cancel Your Monday Night PlansYou’ve got a side hustle and a social life, but at least one night a week should be just for youmelmagazine.com ", "title": "How the Ellipsis Became the Ultimate Power Move", "sentences": [{"f995": "How the Ellipsis Became the Ultimate Power Move"}, {"0808": "When did those three little dots go from collegial to contemptuous?"}, {"996d": "Let me tell you about a colleague I used to have; let’s call them “History’s Greatest Monster.” Now, History’s Greatest Monster and I worked in different departments, but occasionally I would get a request from HGM to do something — usually with no notice, usually something that had to be completed very quickly. When I pushed back, that’s when they began: the short, snarky emails that always ended with an ellipsis — three little dots, goading me, daring me. It was HGM’s power move, and reader, it worked. As an act of digital passive aggression, the ellipsis is far greater than the sum of its parts."}, {"311c": "The ellipsis used to be coy and playful, imbued with a touch of mystery and intrigue. A cliffhanger to be used after a crucial clue has been uncovered in a detective show, or the final word in a flirtatious conversation — like a winky-face emoji, but less creepy. In his book Making a Point: The Pernickety Story of English Punctuation, British linguist David Crystal describes one context of the ellipsis as “expressing continuation when we wish to convey the notion of ‘something that is unnecessary to specify further.’ ” Like the way you trail off when you’re expecting the person you’re talking to will absolutely already know that the best version of Leonard Cohen’s Hallelujah is… any version except the Leonard Cohen version. The ellipsis used to be a communion between speaker and listener, a small but important cue that said: “Hey, I’m on your side, buddy.” Now, it’s the opposite."}, {"85c9": "Black Mirror creator Charlie Brooker once described Twitter as the world’s greatest video game, where the goal is to amass likes, followers, retweets — essentially, to get a high score. To do that, you perform — you’re funny, or you’re smart, or maybe you work out a cheat whereby you can rise up the rankings faster than average because you post a lot of good pictures of dogs. You also fight, like any video game: You figure out who the enemy is, and you try to beat them, for points."}, {"40e2": "This is where the ellipsis comes in. It has become a finishing move, a power play; the communion it represents is no longer between speaker and listener, but rather between the speaker and those already on their side. Patrick D. Elliott, a Ph.D. candidate in Linguistics at University College London and visiting scholar at Berlin’s Center for General Linguistics, sees it as deliberately performative: “[The ellipsis] used to convey something like the following: ‘I could go on to explain why this is weird, but it’s so obvious to the rest of my audience that I don’t need to bother. Rather, I’m using ellipsis to demonstrate my awareness of this.’ ”"}, {"ad1a": "In a public forum like Twitter, you’re not only demonstrating your awareness; you’re demonstrating the awareness of the other people invested in the argument you’re having — a surefire way to get gratification in the form of likes and retweets. Because everyone loves a Twitter beef."}, {"d2b5": "But this doesn’t explain my inter-office e-mail beef with HGM. Rules that apply on social media can’t be applied to all digital communications, particular those that predate the platform by a good couple of decades. I’m willing to admit there might be a generational divide here, and indeed it’s interesting to see in this Reddit thread how older people are passing off their use of the ellipsis as a sign-off as an attempt at digital etiquette, a carry-over from the habit of ending any written correspondence with a salutation or signature. I, being a freelancer and procrastinator, live my life on Twitter, so I carry over my negative, hostile associations with the ellipsis to another form."}, {"379d": "Alternatively HGM knew exactly what they were doing, and their use of the ellipsis was even more pointed than I assumed at the time. One thing that does unite email, Twitter, and all digital communications is the durability of the conversations we have there—the idea that anything we say online is committed to canon, and the nuance that we can give to a sentence face-to-face is lost in the fuzz."}, {"0953": "Spencer Hazel, senior lecturer in applied linguistics and communications at the University of Newcastle in England, suggests that the ellipsis is being used as a means of self-preservation, a way to wriggle out of an argument of opinion you may not want to commit yourself to 100 percent: “It may well be that we develop new strategies for dealing with the durability of what we ‘say’ in the conversations that we have on social media to protect ourselves from online retaliation.”"}, {"84a5": "Because the ellipsis is by nature ambiguous, using it can make it easier to say things like “you’ve taken that out of context” or “that’s not what I meant at all” when you know you’ve said something abominable."}, {"cbd7": "One consequence of the rise of digital communications has been the recalibration of certain aspects of grammar and syntax that previously were gathering dust at the back of the lexical cupboard. The ellipsis, like its more ubiquitous cousins, the @ and the #, has become newly present in the digital space. Think of how an ellipsis precedes a command — for example, clicking “File” on this document (as I write it in Google Docs) brings me 10 options that end with an ellipsis. In many messaging apps, an animated ellipsis appears when you’re waiting for someone to type out a reply. As we become more familiar communicating online, particular where limits are put on the amount we can say, we begin to imbue smaller words or gestures with new characteristics, so that we can convey more."}, {"a860": "@ is now a word in and of itself, immortalized in this JME track from 2015; hashtags aren’t necessarily used to make something searchable; and the eggplant emoji was, I’m fairly certain, initially intended to mean “eggplant.” None of us could have predicted that the ellipsis would have its good name sullied, but here we are. However, don’t get complacent. We cannot begin to normalize the use of the ellipsis in this hostile way. We must call out every use of the passive-aggressive ellipsis we see. We need to be able to enjoy ribald whodunnits, casual sexting and Bruce Springsteen’s autobiography (there really are a lot of ellipses in this book, Bruce) without being reminded of its negative connotations. Only by speaking up can we stamp it out."}, {"6a37": "Harry Harris is a songwriter, journalist and headless Thompson gunner. He tweets @CmonHarris, sings @WildSoundRecs and laughs @ own jokes."}, {"a74e": "More from Harry:"}, {"e5ce": "‘Fairytale of New York’ Is the Best Christmas Song EverFor decades, Americans have been ignoring Britain’s greatest contribution to holiday music. It’s time to change thatmelmagazine.com"}, {"0af0": "From Britain to America, With EmpathyWe saw this coming before you did, but trust us: We’re not laughingmelmagazine.com"}, {"34f4": "Cancel Your Monday Night PlansYou’ve got a side hustle and a social life, but at least one night a week should be just for youmelmagazine.com"}], "child": "901_1\t901_2\t901_3\t901_4\t901_5\t901_6\t901_7"}