{"name": "905", "parent": "", "content": "The One Thing Nobody Tells You About Growing Up 1When you were 1 year old, you thought trying to touch everything you could get your tiny hands on was a good idea. Whatever would happen next, it sure would be amazing. 2When you were 2 years old, you first learned to speak. You used that ability to be brutality honest. When you wanted mom, you said “Maaa!” and when you wanted dad you said “Dada!” 3When you were 3 years old, you yelled in the grocery store that you wanted the cereal in the red box. And you didn’t give a damn what anyone walking by thought about it. 4When you were 4 years old, you built the best Lego or Barbie house in the world. You were your own biggest fan, and you meant it. 5When you were 5 years old, you fell off your bike while learning to ride it. But you got up and tried again. You laughed failure in the face. 6When you were 6 years old, you began to understand the complexity of human relationships. Making friends in 1st grade isn’t easy. 7When you were 7 years old, you had your first crush. Maybe you even talked to him or her once during break. Warm feelings, fuzzy feelings. Relationships get really complicated now. 8When you were 8 years old, you were first told you would have to do better on the next test, or you wouldn’t do well in life. You believed it. 9When you were 9 years old, you realized to be cool you had to have the right kind of shoes. Maybe you even convinced your parents to spend $100 on a pair of sneakers and for a few seconds, you were “in.” 10When you were 10 years old, you really had to start thinking about your future. What level of school to go to next? Will you be smart enough for the best kind? 11When you were 11 years old, you got picked last for the soccer team. And it hurt. So the next time, you flunked practice. 12When you were 12 years old, you lied to your parents about the broken window, the fight with your friend, the way you really feel. You just had to deal with it yourself, you thought. 13When you were 13 years old, your favorite singer or band or actor was the coolest person in the world. If you could be like them, your life would be amazing. Could you? You spent a lot of time wondering. 14When you were 14 years old, you doubted your ability to excel at school and get that college degree everyone tells you is so important. What’s the point of all this? 15When you were 15 years old, you learned that the world was unfair. He doesn’t text back. She doesn’t call. The teacher doesn’t care. Your parents don’t understand. Why does no one want you to get what you want? 16When you were 16 years old, you realized things cost money and it doesn’t grow on trees. What are you supposed to do later to make enough of it? Lots of it? 17When you were 17 years old, you desperately wanted to figure out which of the boxes you might fit in. Accounting? English literature? Car sales? Which one could it be? 18When you were 18 years old, you understood that none of the boxes would really fit, but that you had to pick one. Lots of complaining ensued. Look at that list. Pause for a second and you’ll see: You knew everything you needed to know about life when you were 5 years old. Imagine we’d stopped there and held on to who we were. Not intellectually, but in terms of our attitudes and perspectives with which we approach the world. Everything you did back then, the way you navigated life at 5 years old… …it all still works. In fact, it’s the only thing that works. Look at all the things we struggle for as adults: money, fame, meaning, freedom, happiness. The only way to find them is to go through life… You have done all of this before. A long time ago. Me at 5 years old. I knew it all back then. What nobody tells you about adult life is that you have to unlearn everything you’ve picked up along the way, until you’re back at your 5-year-old self. Until you can see the world with those eyes again. Until you realize you were right all along. That all you have to do to move forward is to go back. We have a lot of unlearning to do. If this story resonated with you, please hit the heart ❤, so someone else can learn to unlearn. I write more here. Originally published at www.quora.com. ", "title": "The One Thing Nobody Tells You About Growing Up", "sentences": [{"8461": "The One Thing Nobody Tells You About Growing Up"}, {"8ddd": "1When you were 1 year old, you thought trying to touch everything you could get your tiny hands on was a good idea. Whatever would happen next, it sure would be amazing."}, {"e869": "2When you were 2 years old, you first learned to speak. You used that ability to be brutality honest. When you wanted mom, you said “Maaa!” and when you wanted dad you said “Dada!”"}, {"55f5": "3When you were 3 years old, you yelled in the grocery store that you wanted the cereal in the red box. And you didn’t give a damn what anyone walking by thought about it."}, {"0965": "4When you were 4 years old, you built the best Lego or Barbie house in the world. You were your own biggest fan, and you meant it."}, {"93b2": "5When you were 5 years old, you fell off your bike while learning to ride it. But you got up and tried again. You laughed failure in the face."}, {"3ef4": "6When you were 6 years old, you began to understand the complexity of human relationships. Making friends in 1st grade isn’t easy."}, {"19c6": "7When you were 7 years old, you had your first crush. Maybe you even talked to him or her once during break. Warm feelings, fuzzy feelings. Relationships get really complicated now."}, {"7bc9": "8When you were 8 years old, you were first told you would have to do better on the next test, or you wouldn’t do well in life. You believed it."}, {"6f57": "9When you were 9 years old, you realized to be cool you had to have the right kind of shoes. Maybe you even convinced your parents to spend $100 on a pair of sneakers and for a few seconds, you were “in.”"}, {"fa5c": "10When you were 10 years old, you really had to start thinking about your future. What level of school to go to next? Will you be smart enough for the best kind?"}, {"190f": "11When you were 11 years old, you got picked last for the soccer team. And it hurt. So the next time, you flunked practice."}, {"5470": "12When you were 12 years old, you lied to your parents about the broken window, the fight with your friend, the way you really feel. You just had to deal with it yourself, you thought."}, {"49ad": "13When you were 13 years old, your favorite singer or band or actor was the coolest person in the world. If you could be like them, your life would be amazing. Could you? You spent a lot of time wondering."}, {"fa3f": "14When you were 14 years old, you doubted your ability to excel at school and get that college degree everyone tells you is so important. What’s the point of all this?"}, {"68d3": "15When you were 15 years old, you learned that the world was unfair. He doesn’t text back. She doesn’t call. The teacher doesn’t care. Your parents don’t understand. Why does no one want you to get what you want?"}, {"cbca": "16When you were 16 years old, you realized things cost money and it doesn’t grow on trees. What are you supposed to do later to make enough of it? Lots of it?"}, {"8581": "17When you were 17 years old, you desperately wanted to figure out which of the boxes you might fit in. Accounting? English literature? Car sales? Which one could it be?"}, {"935c": "18When you were 18 years old, you understood that none of the boxes would really fit, but that you had to pick one. Lots of complaining ensued."}, {"baa9": "Look at that list. Pause for a second and you’ll see:"}, {"6306": "You knew everything you needed to know about life when you were 5 years old."}, {"517e": "Imagine we’d stopped there and held on to who we were. Not intellectually, but in terms of our attitudes and perspectives with which we approach the world."}, {"412a": "Everything you did back then, the way you navigated life at 5 years old…"}, {"1524": "…it all still works."}, {"54a4": "In fact, it’s the only thing that works. Look at all the things we struggle for as adults: money, fame, meaning, freedom, happiness."}, {"a134": "The only way to find them is to go through life…"}, {"1b35": "You have done all of this before. A long time ago."}, {"81eb": "Me at 5 years old. I knew it all back then."}, {"19a5": "What nobody tells you about adult life is that you have to unlearn everything you’ve picked up along the way, until you’re back at your 5-year-old self."}, {"dc93": "Until you can see the world with those eyes again. Until you realize you were right all along. That all you have to do to move forward is to go back."}, {"fc5e": "We have a lot of unlearning to do."}, {"1044": "If this story resonated with you, please hit the heart ❤, so someone else can learn to unlearn."}, {"af27": "I write more here. Originally published at www.quora.com."}], "child": "905_1\t905_2\t905_3\t905_4\t905_5905_1\t905_2\t905_3\t905_4\t905_5905_1\t905_2\t905_3\t905_4\t905_5"}