{"name": "907", "parent": "", "content": "Want to Effectively Raise Your Linkedin Profile? Follow These Tips! A killer LinkedIn profile is mandatory if you want to grow your personal brand and company. Even though you’re busy, LinkedIn is one place you can’t forget. The more you put in, the more you’ll get out of it. Here are 22 top tips to effectively boost your LinkedIn profile. 1. Must Do: Keep Your Profile Basics Updated! Many people forget to keep their LinkedIn profiles updated. Whether you’re a total newbie, just starting a new job, or starting to explore new opportunities, there’s no excuse to have outdated information on LinkedIn. It will reflect badly on you. Here are two quick and easy areas you must check are up to date: Doing these two simple things will help more people find you and help you find more relevant potential contacts. 2. Only Use Professional Photos LinkedIn profiles that have a picture are 11 times more likely to be viewed. So if you’re still showing a silhouette, it’s time to make a change and reveal yourself. However, some friendly advice: Your LinkedIn photo shouldn’t be from 20 years ago. It shouldn’t look like it belongs on a dating site, stock photo site, or social network (e.g., Facebook or Instagram). And don’t feature your pet or significant other. Just. No. LinkedIn is for professionals. Be one. 3. Brand Your Profile With a Background Photo Does your LinkedIn profile look boring and average? Give your profile page a bit more personality, or branding, with a visually appealing background image. LinkedIn advises users to use an image (PNG, JPG, or GIF) with a resolution of 1400x425. 4. Write a Ridiculously Good Summary This is where you really sell yourself to potential connections. Your summary should expand on what appears in your headline, highlighting your specialties, career experience, noteworthy accolades, and thought leadership. There has been much discussion about whether it’s best to write in first-person versus third-person narrative here. Ultimately, it doesn’t really matter either way — just stay consistent with whichever you choose. Don’t go back and forth between first person and third person as it’s confusing and signals a lack of attention to detail. In summary of LinkedIn summaries: keep your ego in check, focus on the most relevant details about your career, avoid meaningless jargon, and ensure it’s easy to read. 5. Terminate Those Typos Poor grammar, typos, and misspellings are a no-no. Avoid typos at all costs. 6. Use Keywords With Intent Words are so incredibly important, especially when search is a big part of the equation. Using the right keywords in your profile is the difference between being found and being invisible. Identify the words you want to be found for when people use LinkedIn search and use those keywords in your headline, summary, and profile. Using the right keywords will expose you to more potential connections and opportunities. 7. Neat Trick: Pick the “Other” Website Option Under your Contact Info, LinkedIn gives you the option to link to a website or blog. But by default, the text that shows in your profile is the extremely dull “Blog” or “Website.” Anyone visiting your profile has no clue where they’ll end up if they click on that. Want to use your actual brand or business name? You can! Here’s a simple little trick. When editing the Websites area of your profile, select the “Other” option. Now you can add your own website title and URL. 8. Personalize Your LinkedIn Profile URL When you created your LinkedIn profile, it had some ugly combination of letters, numbers, and backslashes that had no value for your personal branding. You don’t still have this, right? If you do, it’s time to customize your public profile URL. For example, my customized URL is https://www.linkedin.com/in/larrykim. LinkedIn makes it simple to keep your profile consistent with your other social profiles. 9. Own Your Media Visual content is only growing in importance. Help your LinkedIn profile pop by adding documents, photos, videos, and presentations. 10. Add Shiny New Sections to Your Profile LinkedIn lets you add several sections to give your profile more visual appeal and depth. You can add sections for posts, volunteering, languages, honors and awards, patents, causes you care about, and many more. All of these sections open you up to more opportunities to make new connections. 11. Tidy Up Your Endorsements People are going to endorse you for all sorts of skills — sometimes even skills you don’t actually have. But just because you’ve been endorsed for Fire Eating, Chewing Gum, or Showers (yes, these are all real “areas of expertise,” according to LinkedIn) doesn’t mean you have to show other LinkedIn users — unless, of course, fire eating plays a critical role in your professional life. LinkedIn lets you remove any irrelevant skills and endorsements. You should avoid “lying” about your skill set, even if it is by omission. 12. Connect With People You Don’t Yet Know One of the biggest mistakes people make on LinkedIn is failing to reach out to connect with people you want to know but don’t yet. That’s the whole point of networking — getting to know new people, not just established connections. Building out your LinkedIn network has many benefits. You get in front of influencers. You get more endorsements. More people see your best content, share that content, and visit your website. And it’s great for personal branding. Have you considered using LinkedIn more like Twitter? You should! 13. Personalize Invitations to Connect “I’d like to add you to my professional network on LinkedIn.” The default message LinkedIn provides is so dreadfully boring and impersonal. When you invite someone to connect, make it more personal — mention where you met or a topic you discussed in a LinkedIn group, over email, or during a phone interview. This personal touch will increase the odds they’ll accept your request. 14. Publish Amazing Posts LinkedIn posts offer another way to grow your influence, gain more visibility, and acquire new followers. Your existing connections are notified whenever you publish. New people can discover your posts via search. Always think about the audience you want to reach. Highlight your expertise and interests by posting awesome content. Just make sure your posts are appropriate for the 400 million business professionals who use LinkedIn. 15. Find and Join Groups One way to start connecting with people you want to know is to join LinkedIn groups. Whether it’s a group run by a major publication, a group for people with certain job titles, or a group dedicated to a niche topic, there are millions of groups to choose from, so start searching to find groups that are right for you and join them. Join discussions. Start interesting discussions. Don’t sell your product or service or promote yourself — sell your expertise! That will help build your personal brand. 16. Find People Through Search and Advanced Search LinkedIn search is your gateway to future connections. Search for people by name, company, or skills. But you can go much deeper. LinkedIn’s advanced search helps you find people by job title, school, relationship, location, industry, current/past company, profile language, and nonprofit interests — with additional search options for Premium members. 17. Stalk Users Openly or Stealthily Whenever you view someone’s profile, LinkedIn will share your name and headline. LinkedIn recommends this. But sometimes you might want to be a bit stealthier before connecting. If this is the case, you’ll need to manage your privacy under Accounts & Settings. LinkedIn offers a couple of less revealing options. You can reveal only that “Someone at ABCXYZ Corporation” or “Someone in the Online Media Industry” viewed the profile. But if that isn’t enough, then you can go totally private and users will be told only that a LinkedIn user viewed their profile. 18. Remember Where and When You Met What’s-His-Name Once you’ve grown your network to thousands, it can be a bit daunting to remember every single person, or to stay in touch with a few important connections. Luckily, LinkedIn makes this easy. In the Relationship section, in addition to telling you the date when you connected, LinkedIn allows you to write notes about your contact, including how you met, or set reminders to “check in” at intervals from a day to every year. Don’t worry, these notes and reminders are only visible to you! 19. Build Extraordinary Business Relationships When someone accepts your request to connect, don’t start pitching your service or product. This is a relationship killer. Start slow. Comment on, share, or Like their posts. LinkedIn even makes it super simple to stay in touch, telling you when contacts are celebrating work anniversaries or starting new jobs. Again, these are opportunities to Like or comment. Build the relationship and trust before you start asking for favors! 20. Use (but Don’t Abuse) Status Updates LinkedIn status updates are your chance to highlight some of your recent work, share an article or book you’ve read, promote your presence at a conference or event, or offer inspiration through a quote or saying. Because LinkedIn is a business network, it’s best to use it during business hours. Keep active, but don’t go overboard. Try to post an update at least once a day at minimum; aim for a maximum of three or four updates per day, as long as you’re sharing useful, relevant content. Every update is another opportunity to strengthen or forge a connection. 21. Be Positive What you say reflects on you. Never post negative comments about someone’s post or a past employer. Instead, pause and think if there’s a way you can rethink and rewrite in a constructive way — if you can’t, just hit the delete button and go do something else to shift focus. 22. Ask for Recommendations So you haven’t received as many LinkedIn recommendations as you’d like? After all, it takes a bit of time and thought for someone to write a recommendation. What can you do? Ask for them! LinkedIn makes is super easy, providing an “Ask to be recommended” link, where you can specify what you want to be recommended for, who you want to recommend you, and write a personal message. Pick specific people. Don’t just randomly ask all your contacts if they can recommend you. Be selective. Share details in your message to your connection. If there are specific skills you want your contacts to highlight in his or her recommendation, don’t be shy, tell them. Another way to increase the likelihood that you’ll get a great recommendation: Give a great recommendation to someone you’ve worked with. This increases the odds that your contact will feel obligated to return the favor. Bonus Tip: Export Your LinkedIn Connections One last helpful tip: Remember to occasionally download your connections. After you’ve gone to all the trouble of building an amazing network, you don’t want to risk losing their contact info! To do this, click on Connections, then Settings (the gear icon), and on the next page, under Advanced Settings, you’ll see a link to export your LinkedIn connections as a .CSV file. Now you have a file containing your contacts’ first and last names, email addresses, job titles, and companies. Summary Now you know everything you need to do to refresh your LinkedIn profile. Make yourself look amazing, wow future connections, and grow your influence. It all starts with a killer profile. What are you waiting for? Get updating now! ", "title": "Want to Effectively Raise Your Linkedin Profile? Follow These Tips!", "sentences": [{"2f39": "Want to Effectively Raise Your Linkedin Profile? Follow These Tips!"}, {"c106": "A killer LinkedIn profile is mandatory if you want to grow your personal brand and company."}, {"a1ac": "Even though you’re busy, LinkedIn is one place you can’t forget. The more you put in, the more you’ll get out of it."}, {"ac17": "Here are 22 top tips to effectively boost your LinkedIn profile."}, {"d3b6": "1. Must Do: Keep Your Profile Basics Updated!"}, {"e70f": "Many people forget to keep their LinkedIn profiles updated. Whether you’re a total newbie, just starting a new job, or starting to explore new opportunities, there’s no excuse to have outdated information on LinkedIn. It will reflect badly on you."}, {"2b46": "Here are two quick and easy areas you must check are up to date:"}, {"54a3": "Doing these two simple things will help more people find you and help you find more relevant potential contacts."}, {"4fbc": "2. Only Use Professional Photos"}, {"0c80": "LinkedIn profiles that have a picture are 11 times more likely to be viewed. So if you’re still showing a silhouette, it’s time to make a change and reveal yourself."}, {"9a6b": "However, some friendly advice:"}, {"d228": "Your LinkedIn photo shouldn’t be from 20 years ago. It shouldn’t look like it belongs on a dating site, stock photo site, or social network (e.g., Facebook or Instagram). And don’t feature your pet or significant other. Just. No."}, {"80ea": "LinkedIn is for professionals. Be one."}, {"c932": "3. Brand Your Profile With a Background Photo"}, {"ded8": "Does your LinkedIn profile look boring and average?"}, {"fe56": "Give your profile page a bit more personality, or branding, with a visually appealing background image."}, {"13fd": "LinkedIn advises users to use an image (PNG, JPG, or GIF) with a resolution of 1400x425."}, {"87d0": "4. Write a Ridiculously Good Summary"}, {"696f": "This is where you really sell yourself to potential connections. Your summary should expand on what appears in your headline, highlighting your specialties, career experience, noteworthy accolades, and thought leadership."}, {"6185": "There has been much discussion about whether it’s best to write in first-person versus third-person narrative here. Ultimately, it doesn’t really matter either way — just stay consistent with whichever you choose. Don’t go back and forth between first person and third person as it’s confusing and signals a lack of attention to detail."}, {"68b6": "In summary of LinkedIn summaries: keep your ego in check, focus on the most relevant details about your career, avoid meaningless jargon, and ensure it’s easy to read."}, {"1706": "5. Terminate Those Typos"}, {"c85b": "Poor grammar, typos, and misspellings are a no-no."}, {"ddd2": "Avoid typos at all costs."}, {"61db": "6. Use Keywords With Intent"}, {"2f71": "Words are so incredibly important, especially when search is a big part of the equation. Using the right keywords in your profile is the difference between being found and being invisible."}, {"d573": "Identify the words you want to be found for when people use LinkedIn search and use those keywords in your headline, summary, and profile. Using the right keywords will expose you to more potential connections and opportunities."}, {"2d51": "7. Neat Trick: Pick the “Other” Website Option"}, {"ef95": "Under your Contact Info, LinkedIn gives you the option to link to a website or blog. But by default, the text that shows in your profile is the extremely dull “Blog” or “Website.” Anyone visiting your profile has no clue where they’ll end up if they click on that."}, {"6cc9": "Want to use your actual brand or business name? You can! Here’s a simple little trick."}, {"face": "When editing the Websites area of your profile, select the “Other” option. Now you can add your own website title and URL."}, {"3165": "8. Personalize Your LinkedIn Profile URL"}, {"071f": "When you created your LinkedIn profile, it had some ugly combination of letters, numbers, and backslashes that had no value for your personal branding. You don’t still have this, right?"}, {"e965": "If you do, it’s time to customize your public profile URL. For example, my customized URL is https://www.linkedin.com/in/larrykim. LinkedIn makes it simple to keep your profile consistent with your other social profiles."}, {"48a4": "9. Own Your Media"}, {"5c40": "Visual content is only growing in importance."}, {"c834": "Help your LinkedIn profile pop by adding documents, photos, videos, and presentations."}, {"ab09": "10. Add Shiny New Sections to Your Profile"}, {"b413": "LinkedIn lets you add several sections to give your profile more visual appeal and depth. You can add sections for posts, volunteering, languages, honors and awards, patents, causes you care about, and many more."}, {"35d2": "All of these sections open you up to more opportunities to make new connections."}, {"94a8": "11. Tidy Up Your Endorsements"}, {"0253": "People are going to endorse you for all sorts of skills — sometimes even skills you don’t actually have. But just because you’ve been endorsed for Fire Eating, Chewing Gum, or Showers (yes, these are all real “areas of expertise,” according to LinkedIn) doesn’t mean you have to show other LinkedIn users — unless, of course, fire eating plays a critical role in your professional life."}, {"3cf9": "LinkedIn lets you remove any irrelevant skills and endorsements. You should avoid “lying” about your skill set, even if it is by omission."}, {"ab16": "12. Connect With People You Don’t Yet Know"}, {"8049": "One of the biggest mistakes people make on LinkedIn is failing to reach out to connect with people you want to know but don’t yet. That’s the whole point of networking — getting to know new people, not just established connections."}, {"43b4": "Building out your LinkedIn network has many benefits. You get in front of influencers. You get more endorsements. More people see your best content, share that content, and visit your website. And it’s great for personal branding."}, {"d0a9": "Have you considered using LinkedIn more like Twitter? You should!"}, {"09e5": "13. Personalize Invitations to Connect"}, {"932f": "“I’d like to add you to my professional network on LinkedIn.”"}, {"5640": "The default message LinkedIn provides is so dreadfully boring and impersonal."}, {"2880": "When you invite someone to connect, make it more personal — mention where you met or a topic you discussed in a LinkedIn group, over email, or during a phone interview. This personal touch will increase the odds they’ll accept your request."}, {"5d9e": "14. Publish Amazing Posts"}, {"82d0": "LinkedIn posts offer another way to grow your influence, gain more visibility, and acquire new followers."}, {"0a46": "Your existing connections are notified whenever you publish. New people can discover your posts via search."}, {"7a2e": "Always think about the audience you want to reach. Highlight your expertise and interests by posting awesome content. Just make sure your posts are appropriate for the 400 million business professionals who use LinkedIn."}, {"ef8f": "15. Find and Join Groups"}, {"ebaf": "One way to start connecting with people you want to know is to join LinkedIn groups. Whether it’s a group run by a major publication, a group for people with certain job titles, or a group dedicated to a niche topic, there are millions of groups to choose from, so start searching to find groups that are right for you and join them."}, {"197f": "Join discussions. Start interesting discussions. Don’t sell your product or service or promote yourself — sell your expertise! That will help build your personal brand."}, {"99e6": "16. Find People Through Search and Advanced Search"}, {"c3d3": "LinkedIn search is your gateway to future connections. Search for people by name, company, or skills."}, {"969d": "But you can go much deeper."}, {"1c5f": "LinkedIn’s advanced search helps you find people by job title, school, relationship, location, industry, current/past company, profile language, and nonprofit interests — with additional search options for Premium members."}, {"2ae0": "17. Stalk Users Openly or Stealthily"}, {"fa03": "Whenever you view someone’s profile, LinkedIn will share your name and headline. LinkedIn recommends this."}, {"4d6f": "But sometimes you might want to be a bit stealthier before connecting. If this is the case, you’ll need to manage your privacy under Accounts & Settings."}, {"e93d": "LinkedIn offers a couple of less revealing options. You can reveal only that “Someone at ABCXYZ Corporation” or “Someone in the Online Media Industry” viewed the profile. But if that isn’t enough, then you can go totally private and users will be told only that a LinkedIn user viewed their profile."}, {"9f3d": "18. Remember Where and When You Met What’s-His-Name"}, {"fec9": "Once you’ve grown your network to thousands, it can be a bit daunting to remember every single person, or to stay in touch with a few important connections."}, {"582b": "Luckily, LinkedIn makes this easy. In the Relationship section, in addition to telling you the date when you connected, LinkedIn allows you to write notes about your contact, including how you met, or set reminders to “check in” at intervals from a day to every year."}, {"8159": "Don’t worry, these notes and reminders are only visible to you!"}, {"0dfc": "19. Build Extraordinary Business Relationships"}, {"00c7": "When someone accepts your request to connect, don’t start pitching your service or product. This is a relationship killer."}, {"c9e9": "Start slow. Comment on, share, or Like their posts."}, {"4adf": "LinkedIn even makes it super simple to stay in touch, telling you when contacts are celebrating work anniversaries or starting new jobs. Again, these are opportunities to Like or comment."}, {"91ac": "Build the relationship and trust before you start asking for favors!"}, {"7206": "20. Use (but Don’t Abuse) Status Updates"}, {"433e": "LinkedIn status updates are your chance to highlight some of your recent work, share an article or book you’ve read, promote your presence at a conference or event, or offer inspiration through a quote or saying."}, {"ea7a": "Because LinkedIn is a business network, it’s best to use it during business hours. Keep active, but don’t go overboard."}, {"0949": "Try to post an update at least once a day at minimum; aim for a maximum of three or four updates per day, as long as you’re sharing useful, relevant content. Every update is another opportunity to strengthen or forge a connection."}, {"cd7f": "21. Be Positive"}, {"2f7c": "What you say reflects on you. Never post negative comments about someone’s post or a past employer."}, {"c40c": "Instead, pause and think if there’s a way you can rethink and rewrite in a constructive way — if you can’t, just hit the delete button and go do something else to shift focus."}, {"aab0": "22. Ask for Recommendations"}, {"c06a": "So you haven’t received as many LinkedIn recommendations as you’d like? After all, it takes a bit of time and thought for someone to write a recommendation."}, {"8431": "What can you do? Ask for them! LinkedIn makes is super easy, providing an “Ask to be recommended” link, where you can specify what you want to be recommended for, who you want to recommend you, and write a personal message."}, {"1eb1": "Pick specific people. Don’t just randomly ask all your contacts if they can recommend you. Be selective."}, {"3a43": "Share details in your message to your connection. If there are specific skills you want your contacts to highlight in his or her recommendation, don’t be shy, tell them."}, {"101f": "Another way to increase the likelihood that you’ll get a great recommendation: Give a great recommendation to someone you’ve worked with. This increases the odds that your contact will feel obligated to return the favor."}, {"3b08": "Bonus Tip: Export Your LinkedIn Connections"}, {"4b1d": "One last helpful tip: Remember to occasionally download your connections. After you’ve gone to all the trouble of building an amazing network, you don’t want to risk losing their contact info!"}, {"a89d": "To do this, click on Connections, then Settings (the gear icon), and on the next page, under Advanced Settings, you’ll see a link to export your LinkedIn connections as a .CSV file."}, {"201c": "Now you have a file containing your contacts’ first and last names, email addresses, job titles, and companies."}, {"3195": "Summary"}, {"6be2": "Now you know everything you need to do to refresh your LinkedIn profile. Make yourself look amazing, wow future connections, and grow your influence. It all starts with a killer profile."}, {"83da": "What are you waiting for? Get updating now!"}], "child": "907_1"}