{"name": "909", "parent": "", "content": "Recrutar para UX é difícil Então vamos facilitar – para você e para mim. Candidatos: parem de se esconder atrás dos post-its. Desde que eu mudei para Try uma das funções que eu tenho exercido mais – muito mais, comparando a todos outros anos em outros lugares – é conversar e recrutar pessoas. E mesmo que não tenhamos nada aberto, dada a natureza super volátil e dinâmica do mercado atualmente, a cada dia me convenço mais de que preciso estar sempre conhecendo alguém novo. Parece fácil, não? Entretanto, não é – nem de longe. É uma tarefa que consome tempo e muito esforço. Agora, se as startups são os rockstars do dia e se já superamos o que eu chamo de Vale da Depressão de Social Media – assunto para outro texto – o que transforma a tarefa em algo tão difícil assim? Recrutar para qualquer posição é difícil Eu passei os últimos doze anos espalhado por diversas empresas e queria começar dizendo – achar bons profissionais em qualquer ramo está difícil. Acho que nunca não esteve. Ponto. Passou-se por longe a era em que o currículo formal era capaz de contar a história da qualificação e do perfil da pessoa, e não tem remédio senão o que preferi usar – conhecer as pessoas. Tem muitas razões pelas quais isso deve acontecer. O streamlining da educação do ensino médio e a mercantilização do ensino superior podem ser apontados. Da mesma forma, a cisma – ilógica – entre mercado e academia, que insiste em ensinar que ou você critica ou você faz. E mesmo que não seja isso, Ainda podemos falar sobre grades curriculares – e pior, métodos de ensino – datados. De qualquer forma, triar a base é uma dificuldade. Eu acho que o que mais me choca é como podem profissionais que estudaram áreas relacionadas na prática — Design Gráfico, Design Digital, Desenho Industria, Arquitetura, Engenheira de Software, Propaganda e Marketing, Editoração, Psicologia — não conseguirem abstrair o básico e relacionar à prática de UX. Dessas áreas de estudo para UX não é uma guinada plena de carreira, é uma apropriação básica dentro de coisas que pensamos todos os dias. Técnicas têm de montes — e nenhuma é o suficiente Eu nunca saio entrevistando esperando técnicas. Verdade seja dita, eu raramente começo a conversar com alguém esperando ser deslumbrado pelo seu esmero técnico — certamente, quando e se isso ocorrer, é uma boa surpresa. Entretanto, o que eu espero é encontrar uma pessoa que pense como um designer de experiência do usuário. Isso é amplo e vago, portanto, tomando emprestado um pouco de livros muito legais que tenho lido — como Design for Dasein, por exemplo — eu procuro conversar com pessoas que demonstrem uma capacidade de pensamento abdutivo, especulativo, e que sejam capaz de amarrar isso em um contexto de problemas ou de negócios. A definição parece simplória e ela com certeza o é — ela deixa de fora uma série de características pessoais. E existe uma série de coisas que podem apontar bons sinais: interesse, flexibilidade cognitiva, a capacidade de me contar uma história do começo ao fim — e isso, como sabem os que convivem comigo, é muito importante — , curiosidade, o olhar sobre hábitos e comportamentos… Eu consigo abrir mão de alguém que conheça mais técnicas por uma pessoa que demonstre ter um tino para as coisas. Técnicas, a gente ensina com facilidade. O mercado está poluído por buzzwords e cursos e conteúdos de baixa qualidade O hype imenso em experiência do usuário, design thinking e design de serviços fez com que o mundo se povoasse rapidamente de entusiastas. Alguns pregam aos convertidos e transformam o diálogo em sua sala de aula, e outros — mais ousados — querem logo montar uma disciplina e repassá-la. Eu vejo com bons olhos qualquer tentativa de elucidar as pessoas, e reconheço que alguns pocket cursos e conteúdos falhem em sua ingenuidade ou na própria falta de corpus necessária para inserir um olhar crítico necessário para a criação de um profissional pleno. Não é à toa que eu sinto com frequência que seja necessário retornar às bases do que é e deveria ser o design. O que acontece é que muito disso tudo são clickbaits que, em vez de elucidar, confundem e geram maus hábitos nos profissionais — como se fossem aquele link perpétuo de site qualquer que fala que comer chocolate todo dia emagrece ou algo assim. E o duro do clickbait é que você fica louco para prová-lo — ou seja, na conversa coloquial aparecem muitos desses truísmos e falhas que mostram que a pessoa nunca elaborou um pensamento de design de cabo a rabo. Você é lembrado que UX é o que importa e que tudo precisa estar a dois cliques da home e que UX tem que ser lean sempre e que todo mundo entende o menu hamburger, afinal. Mas não é assim que funciona o dia a dia, e qualquer pessoa da área o dirá. Aliás, o que torna a profissão tão legal no dia a dia é como um comportamento perfeitamente eficiente em um contexto com um grupo de pessoas pode se tornar inadequado em outro contexto e para outros tipos de pessoas. Trabalhar com UX é aprender a descondicionar o olhar para poder ver as coisas sempre como uma construção, e não jogar regras à toa. Saiba porque você está aqui Acho que isso deveria ser um mandamento em toda e qualquer entrevista de sempre. Não, eu não espero que você saiba a história da empresa que o entrevista. Tampouco espero que você saiba a minha história, carreira, etc. Mas eu preciso que você dê algum sinal de que você sabe porque você está aqui, nesta sala, nesta call, neste Skype, falando comigo. É triste admitir isso, mas isso não é o que observamos com frequência, infelizmente. Eu preciso que você fale comigo e demonstre que você tem alguma noção do que isso se trata. Não espero que você me responda uma chamada oral — mas que saiba minimamente o que é UX, saiba minimamente o que você poderia fazer e qual seu norte magnético. E quanto mais experiente for o perfil, mais essa expectativa sobe. De novo — parece uma obviedade, mas nem sempre é. E não, amigo, a porta da campanha publicitária é do outro lado da rua — ela é uma porta super bacana, super legal, mas não é a mesma. E, segredo? A gente sabe quando você está aqui por engano. Entendo seu momento, mas preciso que você relaxe Se você tem certeza de que nada disso é seu caso, ainda há um último ponto que esquecemos mas que é pivotal — quando trabalhamos com uma pessoa, corremos o risco de acabar numa situação muito louca como, por exemplo, passar 40 horas numa semana sentado do lado dela. Por isso, é muito importante que nos sintamos bem. Eu entendo que de repente uma vaga em UX seja tudo o que você sonha, mas se você não relaxar e a gente não conseguir engatar numa conversa bacana, a gente provavelmente não vai se sair tão bem trabalhando juntos. Quando eu menciono relaxar, entenda, é realmente falar numa boa. Tentar impressionar demais não é estar relaxado. Fazer uma piadinha tudo bem, mas várias? Na sequência? Não parece relaxado. Não conseguir me olhar na cara e travar pra contar um pouco de prosa também não parece relaxado. E isso tudo conta muito. Outra coisa — quem cai na bobagem de tentar impressionar principalmente contando coisas que não aconteceram, uma dica. O mercado e a academia coletivamente não esquecem. Quem entrevista nem sempre está certo Eu sei que isso tudo que eu coloquei levanta uma série de pontos — se o entrevistador é mais Sênior, se ele teve uma postura adequada, se a empresa contratante colocou uma vaga adequada… Todos os pontos são válidos, mas isso não quer dizer que os mesmos invalidam os outros pontos que eu levantei. Acho que podemos abrir um outro espaço justamente para a crítica devida da contratação de UX. Hoje, entretanto, escrevi apenas para abrir uma porta muito importante e pedir: se quiser, falem comigo. Sempre tem alguém precisando de um bom UX. ", "title": "Recrutar para UX é difícil", "sentences": [{"f690": "Recrutar para UX é difícil"}, {"566a": "Então vamos facilitar – para você e para mim."}, {"8077": "Candidatos: parem de se esconder atrás dos post-its."}, {"1cf1": "Desde que eu mudei para Try uma das funções que eu tenho exercido mais – muito mais, comparando a todos outros anos em outros lugares – é conversar e recrutar pessoas. E mesmo que não tenhamos nada aberto, dada a natureza super volátil e dinâmica do mercado atualmente, a cada dia me convenço mais de que preciso estar sempre conhecendo alguém novo."}, {"2980": "Parece fácil, não? Entretanto, não é – nem de longe. É uma tarefa que consome tempo e muito esforço."}, {"0612": "Agora, se as startups são os rockstars do dia e se já superamos o que eu chamo de Vale da Depressão de Social Media – assunto para outro texto – o que transforma a tarefa em algo tão difícil assim?"}, {"3eb0": "Recrutar para qualquer posição é difícil"}, {"da43": "Eu passei os últimos doze anos espalhado por diversas empresas e queria começar dizendo – achar bons profissionais em qualquer ramo está difícil. Acho que nunca não esteve. Ponto. Passou-se por longe a era em que o currículo formal era capaz de contar a história da qualificação e do perfil da pessoa, e não tem remédio senão o que preferi usar – conhecer as pessoas."}, {"17d4": "Tem muitas razões pelas quais isso deve acontecer. O streamlining da educação do ensino médio e a mercantilização do ensino superior podem ser apontados. Da mesma forma, a cisma – ilógica – entre mercado e academia, que insiste em ensinar que ou você critica ou você faz. E mesmo que não seja isso, Ainda podemos falar sobre grades curriculares – e pior, métodos de ensino – datados."}, {"1022": "De qualquer forma, triar a base é uma dificuldade. Eu acho que o que mais me choca é como podem profissionais que estudaram áreas relacionadas na prática — Design Gráfico, Design Digital, Desenho Industria, Arquitetura, Engenheira de Software, Propaganda e Marketing, Editoração, Psicologia — não conseguirem abstrair o básico e relacionar à prática de UX. Dessas áreas de estudo para UX não é uma guinada plena de carreira, é uma apropriação básica dentro de coisas que pensamos todos os dias."}, {"edf8": "Técnicas têm de montes — e nenhuma é o suficiente"}, {"e6da": "Eu nunca saio entrevistando esperando técnicas. Verdade seja dita, eu raramente começo a conversar com alguém esperando ser deslumbrado pelo seu esmero técnico — certamente, quando e se isso ocorrer, é uma boa surpresa. Entretanto, o que eu espero é encontrar uma pessoa que pense como um designer de experiência do usuário."}, {"547c": "Isso é amplo e vago, portanto, tomando emprestado um pouco de livros muito legais que tenho lido — como Design for Dasein, por exemplo — eu procuro conversar com pessoas que demonstrem uma capacidade de pensamento abdutivo, especulativo, e que sejam capaz de amarrar isso em um contexto de problemas ou de negócios."}, {"5060": "A definição parece simplória e ela com certeza o é — ela deixa de fora uma série de características pessoais. E existe uma série de coisas que podem apontar bons sinais: interesse, flexibilidade cognitiva, a capacidade de me contar uma história do começo ao fim — e isso, como sabem os que convivem comigo, é muito importante — , curiosidade, o olhar sobre hábitos e comportamentos…"}, {"4cc9": "Eu consigo abrir mão de alguém que conheça mais técnicas por uma pessoa que demonstre ter um tino para as coisas. Técnicas, a gente ensina com facilidade."}, {"174f": "O mercado está poluído por buzzwords e cursos e conteúdos de baixa qualidade"}, {"44f3": "O hype imenso em experiência do usuário, design thinking e design de serviços fez com que o mundo se povoasse rapidamente de entusiastas. Alguns pregam aos convertidos e transformam o diálogo em sua sala de aula, e outros — mais ousados — querem logo montar uma disciplina e repassá-la."}, {"5445": "Eu vejo com bons olhos qualquer tentativa de elucidar as pessoas, e reconheço que alguns pocket cursos e conteúdos falhem em sua ingenuidade ou na própria falta de corpus necessária para inserir um olhar crítico necessário para a criação de um profissional pleno. Não é à toa que eu sinto com frequência que seja necessário retornar às bases do que é e deveria ser o design."}, {"ec83": "O que acontece é que muito disso tudo são clickbaits que, em vez de elucidar, confundem e geram maus hábitos nos profissionais — como se fossem aquele link perpétuo de site qualquer que fala que comer chocolate todo dia emagrece ou algo assim."}, {"35b8": "E o duro do clickbait é que você fica louco para prová-lo — ou seja, na conversa coloquial aparecem muitos desses truísmos e falhas que mostram que a pessoa nunca elaborou um pensamento de design de cabo a rabo. Você é lembrado que UX é o que importa e que tudo precisa estar a dois cliques da home e que UX tem que ser lean sempre e que todo mundo entende o menu hamburger, afinal."}, {"9c75": "Mas não é assim que funciona o dia a dia, e qualquer pessoa da área o dirá. Aliás, o que torna a profissão tão legal no dia a dia é como um comportamento perfeitamente eficiente em um contexto com um grupo de pessoas pode se tornar inadequado em outro contexto e para outros tipos de pessoas."}, {"66e9": "Trabalhar com UX é aprender a descondicionar o olhar para poder ver as coisas sempre como uma construção, e não jogar regras à toa."}, {"e407": "Saiba porque você está aqui"}, {"ed8e": "Acho que isso deveria ser um mandamento em toda e qualquer entrevista de sempre."}, {"0d1e": "Não, eu não espero que você saiba a história da empresa que o entrevista."}, {"0747": "Tampouco espero que você saiba a minha história, carreira, etc."}, {"e5c1": "Mas eu preciso que você dê algum sinal de que você sabe porque você está aqui, nesta sala, nesta call, neste Skype, falando comigo. É triste admitir isso, mas isso não é o que observamos com frequência, infelizmente."}, {"fa4a": "Eu preciso que você fale comigo e demonstre que você tem alguma noção do que isso se trata. Não espero que você me responda uma chamada oral — mas que saiba minimamente o que é UX, saiba minimamente o que você poderia fazer e qual seu norte magnético. E quanto mais experiente for o perfil, mais essa expectativa sobe. De novo — parece uma obviedade, mas nem sempre é."}, {"9eb4": "E não, amigo, a porta da campanha publicitária é do outro lado da rua — ela é uma porta super bacana, super legal, mas não é a mesma."}, {"e1b7": "E, segredo? A gente sabe quando você está aqui por engano."}, {"1794": "Entendo seu momento, mas preciso que você relaxe"}, {"efdd": "Se você tem certeza de que nada disso é seu caso, ainda há um último ponto que esquecemos mas que é pivotal — quando trabalhamos com uma pessoa, corremos o risco de acabar numa situação muito louca como, por exemplo, passar 40 horas numa semana sentado do lado dela. Por isso, é muito importante que nos sintamos bem."}, {"5b82": "Eu entendo que de repente uma vaga em UX seja tudo o que você sonha, mas se você não relaxar e a gente não conseguir engatar numa conversa bacana, a gente provavelmente não vai se sair tão bem trabalhando juntos."}, {"7ac6": "Quando eu menciono relaxar, entenda, é realmente falar numa boa."}, {"7ac7": "Tentar impressionar demais não é estar relaxado."}, {"a529": "Fazer uma piadinha tudo bem, mas várias? Na sequência? Não parece relaxado."}, {"26f2": "Não conseguir me olhar na cara e travar pra contar um pouco de prosa também não parece relaxado."}, {"5701": "E isso tudo conta muito."}, {"f24a": "Outra coisa — quem cai na bobagem de tentar impressionar principalmente contando coisas que não aconteceram, uma dica. O mercado e a academia coletivamente não esquecem."}, {"4193": "Quem entrevista nem sempre está certo"}, {"48c4": "Eu sei que isso tudo que eu coloquei levanta uma série de pontos — se o entrevistador é mais Sênior, se ele teve uma postura adequada, se a empresa contratante colocou uma vaga adequada… Todos os pontos são válidos, mas isso não quer dizer que os mesmos invalidam os outros pontos que eu levantei."}, {"d900": "Acho que podemos abrir um outro espaço justamente para a crítica devida da contratação de UX. Hoje, entretanto, escrevi apenas para abrir uma porta muito importante e pedir: se quiser, falem comigo. Sempre tem alguém precisando de um bom UX."}], "child": "909_1\t909_2\t909_3\t909_4\t909_5\t909_6\t909_7\t909_8\t909_9\t909_10\t909_11"}