{"name": "911", "parent": "", "content": "Where will UX design be in 5 years? 5 Predictions O’Reilly’s recently published 2017 Design Salary Survey showed not only that designers working in UX command the highest median salary ($89,000), but also that those adopting new tools like Sketch, and agile, iterative ways of working, attract the highest pay. In this article, we explore the future direction of UX design within the wider industry, and explain why we believe the trend towards hiring UX expertise will continue in the years ahead. Background: The rise of UX design Design great Dieter Rams once said, “You cannot understand good design if you do not understand people; design is made for people”. So, is all design ultimately user experience design? Someone, somewhere is going to experience the effects of any product we create, regardless of whether they interact with that product directly. Whatever our discipline, we design in the context of a human society, and we pursue projects because someone believes them to be valuable. In this broad sense, user experience is the essence of all design. The term “user experience design” was coined around 25 years ago by Don Norman, current Director of the Design Lab at the University of California, San Diego. For him, “UX design” names a design process that prioritizes user needs in every aspect of a product experience, including everything that surrounds the product itself. For example, the user experience of an Apple Mac isn’t restricted to interactions with the OS while it’s switched on. A full picture of the Mac’s UX design includes advertising, store layout, the purchase process, the box, the documentation, how it feels to hold, the esteem and social meaning of owning it, and so on. However, if we look up a typical job description for a UX designer today, we’re likely to find a much narrower definition. In the past 5–10 years, UX design has acquired a more restricted meaning, usually referring specifically to the design of websites and mobile apps. This shift primarily reflects the huge commercial importance of those media: according to the latest Nielsen Total Audience Report, an average adult in the USA now spends nearly 4 hours a day using apps and websites on smartphones, tablets, and PCs. UX design today Don Norman cautions against understanding UX design too narrowly, or as limited to device UI design: “Today that term [user experience] has been horribly misused. It’s been used by people who say, ‘I’m a user experience designer, I design websites,’ or, ‘I design apps,’ and they have no clue what they’re doing, and they think the ‘experience’ is that simple device — the website or the app or who knows what — no, it’s everything — it’s the way you experience the world, it’s the way you experience your life, it’s the way you experience a service, or, yeah, an app, or a computer system, but it’s a system that’s everything. Got it?” As we look at the state of UX design today, and consider its future, it’s instructive to remember that UX doesn’t begin or end with a device or an app in front of someone, even if that’s the situation that we currently need to design for most often. It’s the job of UX designers to look beyond interfaces, and address this bigger picture. Believe it or not, it’s little more than 10 years since we lived in a world without smartphones, mobile apps, and social media. Particularly given the amount of time we now spend using these products, the pace of change has been remarkable. This has led manufacturers to seek ever greater optimisation of their products (think of the iPhone, or Google’s Material Design), while companies that deliver products via these platforms have also had to experiment and rapidly figure out how to extract maximum value from them. Arguably, we are now seeing evidence that the pace of development, in smartphones particularly, is slowing. Manufacturers have spent a decade refining their products, such that the smartphone is now essentially a solved design problem. The changes we now see in products like the iPhone are minor and incremental: they make the existing solution marginally better, but don’t take the product to a whole new place. Similarly, interaction design patterns in websites and apps are also becoming solved problems. For example, when designing navigation for a website or app, UI designers are likely now to refer to online libraries of navigation interaction patterns, at least as a starting point. Indeed, it’s precisely because UX design is about meeting user needs and expectations that interfaces should use established, generally accepted interaction patterns, unless there’s a good reason not to. So, what’s next for UX design? The future of UX design New markets UX design as we know it has evolved not only because of the ubiquity of smart technology (TVs, PCs, smartphones), but also because developed economies are increasingly focused on the service industry, where customer experience is crucial. What’s more, as big developing economies such as India and China grow richer, whole new markets will open up for UX designers. For example, building health infrastructure will require solutions that respond to the fiscal and socio-economic situation of those economies. There is huge potential for UX designers with an interest in international development to contribute to the design of novel technological solutions for populations to access diagnosis and treatment. Technologies old and new For a few years, there has been talk of the advent of virtual reality and augmented reality platforms, but there is little sign of these breaking through into mainstream culture. In an interview with FastCo Design, Greg Madison, a VR designer at Google Labs, expressed scepticism that VR will make a significant impression: “For me, laziness is the better way to predict what will happen in the future […] We haven’t replaced the mouse and keyboard in 30 years, because with minimal effort, you can do lots of things. In VR, we need to think, it’s not because we can, but [because we] need to do that.” As a case in point, Google Glass (a kind of augmented reality pair of glasses) was retired in 2015 following poor sales and a range of safety and privacy issues. This tells us that whether a technology is successful is ultimately not going to be determined only by its level of innovation or its standard of execution. It also needs to be desirable to the user, and something that enhances their life in an important way. Currently there is little suggestion that the dominance of smartphones, tablets and PCs will change in the near future. The human animal’s primary mode of experience is visual, and there seems to be little dissatisfaction with our current screen and text-based consumption of information. For many users, screen-based devices also establish important boundaries, allowing us to multi-task, move our attention rapidly between different focuses, and even turn them off. Artificial intelligence and machine learning Soul-searching is happening in many professions at the moment, as high-tech, reliable, and inexpensive artificial intelligence (AI) and automation technologies are becoming a reality in every industrial sector. There are already commercial attempts at using AI to deliver design work. These tend to be focused on areas that requires a designer to execute a design that combines a number of visual conventions. For example, Logojoy offers an AI-based logo design service. When it comes to the work of UX designers in particular, it’s unlikely that many tasks will become automated any time soon. Effective user research and user testing, for instance, are complex and require emotional intelligence and, importantly, an ability to understand which needs and behaviors are not present as well those that are. AI is still a long way off understanding the significance of things that people don’t say or do. Human UX designers also benefit from an “insider” perspective on human needs. In 2017, we don’t know, philosophically, what it would mean for a machine to be capable of empathy or compassion — so we are probably a way off from making such a machine a reality. Similarly, when it comes to visual design, understanding the complex cultural and emotional connotations of colors and their infinite combinations, and creating a meaningful, emotionally engaging look and feel for a product is likely to be something that always requires the involvement of human designers. However, AI could certainly play a role sooner rather than later in speeding up and augmenting human-led design processes. For example, hundreds of layouts, color schemes, and logos could be computed in seconds, allowing designers to identify attractive or viable ideas much more quickly. As strategist Russell Davies told this month’s “AI Issue” of Creative Review, “it may simply be more efficient and fun to get a machine to generate a thousand choices and then get a human to pick out the nuggets.” Voice User Interfaces (VUIs) Voice User Interfaces (VUIs) are already being deployed in a range of technologies. Apple has Siri, Google has OK Google, Microsoft has Cortana, and Amazon has Alexa. Amazon, for example, has incorporated voice UIs into its Fire TV and Echo products. It’s likely that users will find voice interfaces valuable in situations where visual attention is occupied (e.g. while driving a car), or where touch interaction or typing is not possible or desirable (e.g. while watching the TV). But voice UI is also likely to continue living alongside screen UIs, since nobody wants to be in a train carriage full of people giving voice commands to their computers. An underappreciated factor in the future direction of tech is also going to be people’s inherent preference for what they have already learned. The keyboard layout on your smartphone is still QWERTY, a configuration that was originally devised in 1868 to minimise the clash of strikers on manual typewriters. Rationally better keyboard layouts, like Dvorak, were devised long ago, but haven’t been widely adopted. The iPhone and iPod were successful because they delivered huge improvements to earlier products that delivered poor user experience (phones and music players); by contrast, Dvorak wasn’t successful, because on the whole, the UX of the QWERTY keyboard was unproblematic, and it wasn’t a change that users wanted or needed. The qualities of tomorrow’s UX designers Adaptable It’s not possible to see the future, but we can make some educated guesses about it. The past decade of change shows us that design must constantly adapt as a discipline, in order to meet new client, customer, and user needs. The job title of “UX designer” is likely to remain current for a while, but even if UX design roles becomes more specialized and fragmented, today’s UX designer has a skillset that will make them adaptable and versatile. They have to deliver user research, user journey design, wireframes, prototypes, high-fidelity visual design, user testing, and even some coding. Wherever design heads next, UX designers will be in a good position to adapt. Detail-oriented, but capable of seeing the big picture Charles Eames once said: “The details are not the details. They make the design.” As design and interaction patterns become more standardised, companies will become more interested in making their product marginally better than the competition. This will mean a growing focus on the detail of UX design, in every sense: the visual appearance and behavior of the product; but also its speed, the extent to which it can anticipate a user’s next requirement, and so on. Employers will look for detail-oriented UX designers who can deliver improvements at the micro level. Partly, this will happen as a result of market forces — since companies that optimise the UX design of their product will likely succeed, while that that don’t will likely go out of business. Importantly, there will always be the potential for disruptive new technologies to cause rapid and far-reaching change. For this reason, UX designers will be called upon not only to make focused, detailed product enhancements, but also to appraise wider design, tech, and market trends, and scan the horizon for possible paradigm shifts in how a product or service needs to reach and serve its users. Designers of user trust Finally, look at any film, literature, or TV show that explores AI, and the dominant narrative is likely to be dystopian, involving technology gone rogue. As AI becomes a reality, particularly in high-risk applications such as automated cars, one of the key jobs of tomorrow’s UX designer will be to design products that establish trust from the user towards the machine. Humans have a hardwired need to feel in control of their environment, and designers must find ways to meet this need, while also delivering the potential of AI to enhance human health, safety, and decision-making. UX design in 5 years’ time — 5 predictions What do you think the next 5 years hold for UX design? Do you agree or disagree with our predictions? Let us know in the comments what your vision of the future is! Want to learn more about UX design? Here at Designlab, we offer a range of design short courses as well as an advanced UX Academy program. Working one-to-one with a design mentor, students receive feedback on a portfolio of UX projects through a dedicated online platform, community critique sessions, and Skype meetings. Find out more!​ Originally published at trydesignlab.com. ", "title": "Where will UX design be in 5 years? 5 Predictions", "sentences": [{"ed35": "Where will UX design be in 5 years? 5 Predictions"}, {"d332": "O’Reilly’s recently published 2017 Design Salary Survey showed not only that designers working in UX command the highest median salary ($89,000), but also that those adopting new tools like Sketch, and agile, iterative ways of working, attract the highest pay. In this article, we explore the future direction of UX design within the wider industry, and explain why we believe the trend towards hiring UX expertise will continue in the years ahead."}, {"9282": "Background: The rise of UX design"}, {"0fc2": "Design great Dieter Rams once said, “You cannot understand good design if you do not understand people; design is made for people”. So, is all design ultimately user experience design?"}, {"5e1e": "Someone, somewhere is going to experience the effects of any product we create, regardless of whether they interact with that product directly. Whatever our discipline, we design in the context of a human society, and we pursue projects because someone believes them to be valuable. In this broad sense, user experience is the essence of all design."}, {"cf20": "The term “user experience design” was coined around 25 years ago by Don Norman, current Director of the Design Lab at the University of California, San Diego. For him, “UX design” names a design process that prioritizes user needs in every aspect of a product experience, including everything that surrounds the product itself. For example, the user experience of an Apple Mac isn’t restricted to interactions with the OS while it’s switched on. A full picture of the Mac’s UX design includes advertising, store layout, the purchase process, the box, the documentation, how it feels to hold, the esteem and social meaning of owning it, and so on."}, {"c20a": "However, if we look up a typical job description for a UX designer today, we’re likely to find a much narrower definition. In the past 5–10 years, UX design has acquired a more restricted meaning, usually referring specifically to the design of websites and mobile apps. This shift primarily reflects the huge commercial importance of those media: according to the latest Nielsen Total Audience Report, an average adult in the USA now spends nearly 4 hours a day using apps and websites on smartphones, tablets, and PCs."}, {"c086": "UX design today"}, {"9565": "Don Norman cautions against understanding UX design too narrowly, or as limited to device UI design:"}, {"74d0": "“Today that term [user experience] has been horribly misused. It’s been used by people who say, ‘I’m a user experience designer, I design websites,’ or, ‘I design apps,’ and they have no clue what they’re doing, and they think the ‘experience’ is that simple device — the website or the app or who knows what — no, it’s everything — it’s the way you experience the world, it’s the way you experience your life, it’s the way you experience a service, or, yeah, an app, or a computer system, but it’s a system that’s everything. Got it?”"}, {"0966": "As we look at the state of UX design today, and consider its future, it’s instructive to remember that UX doesn’t begin or end with a device or an app in front of someone, even if that’s the situation that we currently need to design for most often. It’s the job of UX designers to look beyond interfaces, and address this bigger picture."}, {"a76b": "Believe it or not, it’s little more than 10 years since we lived in a world without smartphones, mobile apps, and social media. Particularly given the amount of time we now spend using these products, the pace of change has been remarkable. This has led manufacturers to seek ever greater optimisation of their products (think of the iPhone, or Google’s Material Design), while companies that deliver products via these platforms have also had to experiment and rapidly figure out how to extract maximum value from them."}, {"9224": "Arguably, we are now seeing evidence that the pace of development, in smartphones particularly, is slowing. Manufacturers have spent a decade refining their products, such that the smartphone is now essentially a solved design problem. The changes we now see in products like the iPhone are minor and incremental: they make the existing solution marginally better, but don’t take the product to a whole new place."}, {"ddee": "Similarly, interaction design patterns in websites and apps are also becoming solved problems. For example, when designing navigation for a website or app, UI designers are likely now to refer to online libraries of navigation interaction patterns, at least as a starting point. Indeed, it’s precisely because UX design is about meeting user needs and expectations that interfaces should use established, generally accepted interaction patterns, unless there’s a good reason not to."}, {"439f": "So, what’s next for UX design?"}, {"cbb0": "The future of UX design"}, {"dbd3": "New markets"}, {"f494": "UX design as we know it has evolved not only because of the ubiquity of smart technology (TVs, PCs, smartphones), but also because developed economies are increasingly focused on the service industry, where customer experience is crucial. What’s more, as big developing economies such as India and China grow richer, whole new markets will open up for UX designers."}, {"8e9a": "For example, building health infrastructure will require solutions that respond to the fiscal and socio-economic situation of those economies. There is huge potential for UX designers with an interest in international development to contribute to the design of novel technological solutions for populations to access diagnosis and treatment."}, {"4dd2": "Technologies old and new"}, {"67c5": "For a few years, there has been talk of the advent of virtual reality and augmented reality platforms, but there is little sign of these breaking through into mainstream culture. In an interview with FastCo Design, Greg Madison, a VR designer at Google Labs, expressed scepticism that VR will make a significant impression:"}, {"64cc": "“For me, laziness is the better way to predict what will happen in the future […] We haven’t replaced the mouse and keyboard in 30 years, because with minimal effort, you can do lots of things. In VR, we need to think, it’s not because we can, but [because we] need to do that.”"}, {"19a4": "As a case in point, Google Glass (a kind of augmented reality pair of glasses) was retired in 2015 following poor sales and a range of safety and privacy issues. This tells us that whether a technology is successful is ultimately not going to be determined only by its level of innovation or its standard of execution. It also needs to be desirable to the user, and something that enhances their life in an important way."}, {"4bdd": "Currently there is little suggestion that the dominance of smartphones, tablets and PCs will change in the near future. The human animal’s primary mode of experience is visual, and there seems to be little dissatisfaction with our current screen and text-based consumption of information. For many users, screen-based devices also establish important boundaries, allowing us to multi-task, move our attention rapidly between different focuses, and even turn them off."}, {"d00c": "Artificial intelligence and machine learning"}, {"e7c6": "Soul-searching is happening in many professions at the moment, as high-tech, reliable, and inexpensive artificial intelligence (AI) and automation technologies are becoming a reality in every industrial sector. There are already commercial attempts at using AI to deliver design work. These tend to be focused on areas that requires a designer to execute a design that combines a number of visual conventions. For example, Logojoy offers an AI-based logo design service."}, {"542c": "When it comes to the work of UX designers in particular, it’s unlikely that many tasks will become automated any time soon. Effective user research and user testing, for instance, are complex and require emotional intelligence and, importantly, an ability to understand which needs and behaviors are not present as well those that are. AI is still a long way off understanding the significance of things that people don’t say or do."}, {"ba74": "Human UX designers also benefit from an “insider” perspective on human needs. In 2017, we don’t know, philosophically, what it would mean for a machine to be capable of empathy or compassion — so we are probably a way off from making such a machine a reality. Similarly, when it comes to visual design, understanding the complex cultural and emotional connotations of colors and their infinite combinations, and creating a meaningful, emotionally engaging look and feel for a product is likely to be something that always requires the involvement of human designers."}, {"bf03": "However, AI could certainly play a role sooner rather than later in speeding up and augmenting human-led design processes. For example, hundreds of layouts, color schemes, and logos could be computed in seconds, allowing designers to identify attractive or viable ideas much more quickly. As strategist Russell Davies told this month’s “AI Issue” of Creative Review, “it may simply be more efficient and fun to get a machine to generate a thousand choices and then get a human to pick out the nuggets.”"}, {"0198": "Voice User Interfaces (VUIs)"}, {"5741": "Voice User Interfaces (VUIs) are already being deployed in a range of technologies. Apple has Siri, Google has OK Google, Microsoft has Cortana, and Amazon has Alexa. Amazon, for example, has incorporated voice UIs into its Fire TV and Echo products. It’s likely that users will find voice interfaces valuable in situations where visual attention is occupied (e.g. while driving a car), or where touch interaction or typing is not possible or desirable (e.g. while watching the TV). But voice UI is also likely to continue living alongside screen UIs, since nobody wants to be in a train carriage full of people giving voice commands to their computers."}, {"3eee": "An underappreciated factor in the future direction of tech is also going to be people’s inherent preference for what they have already learned. The keyboard layout on your smartphone is still QWERTY, a configuration that was originally devised in 1868 to minimise the clash of strikers on manual typewriters. Rationally better keyboard layouts, like Dvorak, were devised long ago, but haven’t been widely adopted. The iPhone and iPod were successful because they delivered huge improvements to earlier products that delivered poor user experience (phones and music players); by contrast, Dvorak wasn’t successful, because on the whole, the UX of the QWERTY keyboard was unproblematic, and it wasn’t a change that users wanted or needed."}, {"a49a": "The qualities of tomorrow’s UX designers"}, {"8da4": "Adaptable"}, {"de55": "It’s not possible to see the future, but we can make some educated guesses about it. The past decade of change shows us that design must constantly adapt as a discipline, in order to meet new client, customer, and user needs."}, {"d22d": "The job title of “UX designer” is likely to remain current for a while, but even if UX design roles becomes more specialized and fragmented, today’s UX designer has a skillset that will make them adaptable and versatile. They have to deliver user research, user journey design, wireframes, prototypes, high-fidelity visual design, user testing, and even some coding. Wherever design heads next, UX designers will be in a good position to adapt."}, {"4590": "Detail-oriented, but capable of seeing the big picture"}, {"58a3": "Charles Eames once said: “The details are not the details. They make the design.” As design and interaction patterns become more standardised, companies will become more interested in making their product marginally better than the competition. This will mean a growing focus on the detail of UX design, in every sense: the visual appearance and behavior of the product; but also its speed, the extent to which it can anticipate a user’s next requirement, and so on."}, {"1409": "Employers will look for detail-oriented UX designers who can deliver improvements at the micro level. Partly, this will happen as a result of market forces — since companies that optimise the UX design of their product will likely succeed, while that that don’t will likely go out of business."}, {"5b45": "Importantly, there will always be the potential for disruptive new technologies to cause rapid and far-reaching change. For this reason, UX designers will be called upon not only to make focused, detailed product enhancements, but also to appraise wider design, tech, and market trends, and scan the horizon for possible paradigm shifts in how a product or service needs to reach and serve its users."}, {"c8e7": "Designers of user trust"}, {"fa90": "Finally, look at any film, literature, or TV show that explores AI, and the dominant narrative is likely to be dystopian, involving technology gone rogue. As AI becomes a reality, particularly in high-risk applications such as automated cars, one of the key jobs of tomorrow’s UX designer will be to design products that establish trust from the user towards the machine. Humans have a hardwired need to feel in control of their environment, and designers must find ways to meet this need, while also delivering the potential of AI to enhance human health, safety, and decision-making."}, {"8e36": "UX design in 5 years’ time — 5 predictions"}, {"8813": "What do you think the next 5 years hold for UX design? Do you agree or disagree with our predictions? Let us know in the comments what your vision of the future is!"}, {"3b83": "Want to learn more about UX design?"}, {"07fc": "Here at Designlab, we offer a range of design short courses as well as an advanced UX Academy program. Working one-to-one with a design mentor, students receive feedback on a portfolio of UX projects through a dedicated online platform, community critique sessions, and Skype meetings. Find out more!​"}, {"4d0b": "Originally published at trydesignlab.com."}], "child": "911_1\t911_2\t911_3\t911_4\t911_5\t911_6911_1\t911_2\t911_3\t911_4\t911_5\t911_6911_1\t911_2\t911_3\t911_4\t911_5\t911_6911_1\t911_2\t911_3\t911_4\t911_5\t911_6911_1\t911_2\t911_3\t911_4\t911_5\t911_6911_1\t911_2\t911_3\t911_4\t911_5\t911_6911_1\t911_2\t911_3\t911_4\t911_5\t911_6911_1\t911_2\t911_3\t911_4\t911_5\t911_6"}