{"name": "912", "parent": "", "content": "I looked at hundreds of millennials’ CVs and this is what I learned By Alex McClintock Over the last month and a bit, I’ve been recruiting. In February, we advertised for six digital producers. Two of them were on my team, and I received more than 260 applications. “Digital producer” could mean a lot of things, but for us it meant journalists with multimedia skills — and virtually everyone who applied was between 18 and 30. In the private sector you can grab the top half of your résumé pile and throw it in the bin on the basis that you don’t want to hire unlucky people, but at the ABC we’re required to pay careful attention to every applicant. It took a long time, but it was worth it in the end, and gave me a real insight into the job market, the media and how young people present themselves. Here are some observations that might help other recruiters, and some tips that might help you if you’re a Gen Y looking for a job. There are no entry level jobs anymore Being a millennial sucks. (Please let the record show that I am also a millennial.) Where professionals in our parents’ generation could finish university armed with nothing but an arts degree and walk into a job that would train them, “entry level” jobs now require years of experience. Virtually every applicant I saw had developed their skills in multiple volunteer or unpaid roles, and while the jobs we advertised were probably best suited to people with a few years’ experience, this state of affairs is still visible in people’s employment history years down the line. It’s an arms race: when an entire cohort gets experience this way, those who don’t will slip to the bottom of the pile. Of course, this is totally unfair: not all young people can afford to work for free, so organisations fill up with more of the same rich, white people who can. The problem seems particularly acute in the media, where cadetships and other opportunities for on-the-job training are dwindling along with the total number of positions. Recruiters can hope to correct for this in interviews and the way they consider candidates — and we tried to do this — but it’s a structural problem that needs a structural solution. One suggestion is to hire based on aptitude tests, rather than CVs or university results. Some companies are already doing this. The headshot is back in vogue Lots of applicants included a headshot with their resume. Maybe this is normal in TV or acting, but it seems strange for a digital role. We get it, you’re hot. That’s not why we hire people. There’s a point at which a CV becomes overdesigned Thanks to online tools like Canva, it’s never been easier to dabble in graphic design. A sizeable proportion of the résumés we saw had more formatting than humble old MS Word can provide. Bright colours, glyphs, textures and shapes abounded. If you’re applying for a job, there’s no doubt that a well-arranged CV can make you stand out, but a loud or overdesigned one will make you stand out for all the wrong reasons. How far is too far? A bright pink cover page may be too far. A patterned six-page presentation alternating between portrait and landscape orientation is probably too far. A pie chart of how you spend each day (you only sleep for three-and-a-half hours?) is definitely too far. Five stars, Margaret Design inflation plays a role in another weird trend I picked up: heaps of the CVs I saw had a “skills” column, with the candidate’s abilities rated on a five or 10 star scale … by the candidate. And we’re not just talking about proficiency in, say, editing software; people rate themselves for more nebulous concepts like “time management” and “intercultural communication”. Of course, these self-assessments tend to be glowing: nobody gives themselves one star. I get why you’d do this if you were applying for a job: it’s much more visually striking than a list of your skills. But it also makes it obvious when you’re taking creative licence in describing your abilities. It’s unlikely that you’re a five-star audio producer, a five-star video editor and a five-star reporter. Are there even enough hours in a millennial’s lifetime to learn those skills to such a high level? It’s much better to be upfront about where your true strengths lie, and at least you’ll get five stars for honesty. Nobody knows how to write a good cover letter When I’m looking at applications, I look at the cover letter first. I want the candidate to introduce themselves and explain why they’d be good for the job. But 90 per cent of the cover letters I saw were just CVs in prose form. This was: When you’re job hunting, you need to write an original cover letter for every job you apply for — changing the subject line ain’t going to cut it. A cover letter is your opportunity to stand out, so here’s a simple guide to writing a good one. Introduce yourself. Outline your understanding of the role and the organisation. Make a pitch for your vision of the role and why you would be great at it — this should reference your experience, but it shouldn’t be a laundry list. Show some personality. Avoid typos. And for God’s sake, keep it to a page. Millennials are so impressive Constant technological disruption means it’s a tough time to be in the early stages of your career, but so many young people responded with incredible flexibility and a willingness to learn new skills. I might have just spent 800 words whinging, but at the end of the day we had so many great people apply for our jobs that it was difficult to choose a shortlist, let alone successful candidates. As an employer, that’s a great problem to have. As a millennial, not so much. ", "title": "I looked at hundreds of millennials’ CVs and this is what I learned", "sentences": [{"4729": "I looked at hundreds of millennials’ CVs and this is what I learned"}, {"c3fd": "By Alex McClintock"}, {"c4ae": "Over the last month and a bit, I’ve been recruiting. In February, we advertised for six digital producers. Two of them were on my team, and I received more than 260 applications."}, {"7e00": "“Digital producer” could mean a lot of things, but for us it meant journalists with multimedia skills — and virtually everyone who applied was between 18 and 30."}, {"f0b4": "In the private sector you can grab the top half of your résumé pile and throw it in the bin on the basis that you don’t want to hire unlucky people, but at the ABC we’re required to pay careful attention to every applicant."}, {"e6c5": "It took a long time, but it was worth it in the end, and gave me a real insight into the job market, the media and how young people present themselves."}, {"15d7": "Here are some observations that might help other recruiters, and some tips that might help you if you’re a Gen Y looking for a job."}, {"5286": "There are no entry level jobs anymore"}, {"ea27": "Being a millennial sucks. (Please let the record show that I am also a millennial.)"}, {"f08b": "Where professionals in our parents’ generation could finish university armed with nothing but an arts degree and walk into a job that would train them, “entry level” jobs now require years of experience."}, {"ad13": "Virtually every applicant I saw had developed their skills in multiple volunteer or unpaid roles, and while the jobs we advertised were probably best suited to people with a few years’ experience, this state of affairs is still visible in people’s employment history years down the line."}, {"4941": "It’s an arms race: when an entire cohort gets experience this way, those who don’t will slip to the bottom of the pile."}, {"9904": "Of course, this is totally unfair: not all young people can afford to work for free, so organisations fill up with more of the same rich, white people who can."}, {"c635": "The problem seems particularly acute in the media, where cadetships and other opportunities for on-the-job training are dwindling along with the total number of positions."}, {"f090": "Recruiters can hope to correct for this in interviews and the way they consider candidates — and we tried to do this — but it’s a structural problem that needs a structural solution."}, {"b5e0": "One suggestion is to hire based on aptitude tests, rather than CVs or university results. Some companies are already doing this."}, {"0738": "The headshot is back in vogue"}, {"b0c8": "Lots of applicants included a headshot with their resume. Maybe this is normal in TV or acting, but it seems strange for a digital role."}, {"fe45": "We get it, you’re hot. That’s not why we hire people."}, {"38b5": "There’s a point at which a CV becomes overdesigned"}, {"5b74": "Thanks to online tools like Canva, it’s never been easier to dabble in graphic design."}, {"e1f6": "A sizeable proportion of the résumés we saw had more formatting than humble old MS Word can provide. Bright colours, glyphs, textures and shapes abounded."}, {"9d96": "If you’re applying for a job, there’s no doubt that a well-arranged CV can make you stand out, but a loud or overdesigned one will make you stand out for all the wrong reasons."}, {"a0cb": "How far is too far? A bright pink cover page may be too far. A patterned six-page presentation alternating between portrait and landscape orientation is probably too far. A pie chart of how you spend each day (you only sleep for three-and-a-half hours?) is definitely too far."}, {"177e": "Five stars, Margaret"}, {"a706": "Design inflation plays a role in another weird trend I picked up: heaps of the CVs I saw had a “skills” column, with the candidate’s abilities rated on a five or 10 star scale … by the candidate."}, {"f9f8": "And we’re not just talking about proficiency in, say, editing software; people rate themselves for more nebulous concepts like “time management” and “intercultural communication”."}, {"4709": "Of course, these self-assessments tend to be glowing: nobody gives themselves one star."}, {"ac2a": "I get why you’d do this if you were applying for a job: it’s much more visually striking than a list of your skills. But it also makes it obvious when you’re taking creative licence in describing your abilities."}, {"4e6e": "It’s unlikely that you’re a five-star audio producer, a five-star video editor and a five-star reporter. Are there even enough hours in a millennial’s lifetime to learn those skills to such a high level?"}, {"cc0c": "It’s much better to be upfront about where your true strengths lie, and at least you’ll get five stars for honesty."}, {"829a": "Nobody knows how to write a good cover letter"}, {"78f3": "When I’m looking at applications, I look at the cover letter first. I want the candidate to introduce themselves and explain why they’d be good for the job."}, {"14c3": "But 90 per cent of the cover letters I saw were just CVs in prose form."}, {"15d5": "This was:"}, {"f263": "When you’re job hunting, you need to write an original cover letter for every job you apply for — changing the subject line ain’t going to cut it. A cover letter is your opportunity to stand out, so here’s a simple guide to writing a good one."}, {"0bf5": "Introduce yourself. Outline your understanding of the role and the organisation. Make a pitch for your vision of the role and why you would be great at it — this should reference your experience, but it shouldn’t be a laundry list."}, {"7e01": "Show some personality. Avoid typos. And for God’s sake, keep it to a page."}, {"9558": "Millennials are so impressive"}, {"81fb": "Constant technological disruption means it’s a tough time to be in the early stages of your career, but so many young people responded with incredible flexibility and a willingness to learn new skills."}, {"bf5c": "I might have just spent 800 words whinging, but at the end of the day we had so many great people apply for our jobs that it was difficult to choose a shortlist, let alone successful candidates."}, {"bf33": "As an employer, that’s a great problem to have. As a millennial, not so much."}], "child": "912_1\t912_2\t912_3\t912_4"}