{"name": "919", "parent": "", "content": "My giant JavaScript Basics course is now live on YouTube. And it’s 100% free. My JavaScript Basics course is now live on freeCodeCamp’s YouTube channel. The great thing about this course is that it also aligns with the Basic JavaScript Challenges on the beta freeCodeCamp curriculum. You can practice what you're learning through the videos using the freeCodeCamp challenges. (The course even teaches some concepts that aren’t yet covered in the freeCodeCamp curriculum.) These videos are designed to quickly give you key information on each topic. Also, I designed them to be as modular as possible. They work fine as stand-alone videos, if you just want to learn about a single topic. Besides the JavaScript Basics course, I’ve also developed playlists for ES6, Clean Code, Data Structures, and Design Patterns. Below are links and descriptions of the videos to help you quickly find exactly what you want to learn. I’ll continue adding new videos to these playlists as fast as I can. Be sure to subscribe so you don’t miss any. 😉 JavaScript Basics (complete course) View full playlist here. ES6 View full playlist here. Clean Code These videos are all about writing clean code in JavaScript and are based on an article by Ryan McDermott which is based on a book by Robert C. Martin. Clean code is code that is readable, reusable, and refactorable. View full playlist here. Data Structures and Algorithms View full playlist here. Design Patterns View full playlist here. React ", "title": "My giant JavaScript Basics course is now live on YouTube. And it’s 100% free.", "sentences": [{"eb3f": "My giant JavaScript Basics course is now live on YouTube. And it’s 100% free."}, {"9e98": "My JavaScript Basics course is now live on freeCodeCamp’s YouTube channel."}, {"f3e1": "The great thing about this course is that it also aligns with the Basic JavaScript Challenges on the beta freeCodeCamp curriculum. You can practice what you're learning through the videos using the freeCodeCamp challenges. (The course even teaches some concepts that aren’t yet covered in the freeCodeCamp curriculum.)"}, {"0d0f": "These videos are designed to quickly give you key information on each topic. Also, I designed them to be as modular as possible. They work fine as stand-alone videos, if you just want to learn about a single topic."}, {"8a26": "Besides the JavaScript Basics course, I’ve also developed playlists for ES6, Clean Code, Data Structures, and Design Patterns. Below are links and descriptions of the videos to help you quickly find exactly what you want to learn."}, {"4efc": "I’ll continue adding new videos to these playlists as fast as I can. Be sure to subscribe so you don’t miss any. 😉"}, {"45fa": "JavaScript Basics (complete course)"}, {"c541": "View full playlist here."}, {"d35d": "ES6"}, {"692a": "View full playlist here."}, {"1623": "Clean Code"}, {"d8cb": "These videos are all about writing clean code in JavaScript and are based on an article by Ryan McDermott which is based on a book by Robert C. Martin. Clean code is code that is readable, reusable, and refactorable."}, {"6aff": "View full playlist here."}, {"80f1": "Data Structures and Algorithms"}, {"1475": "View full playlist here."}, {"71b6": "Design Patterns"}, {"9455": "View full playlist here."}, {"b121": "React"}], "child": "919_1\t919_2\t919_3\t919_4\t919_5\t919_6\t919_7\t919_8\t919_9\t919_10\t919_11\t919_12\t919_13\t919_14\t919_15\t919_16\t919_17\t919_18\t919_19\t919_20\t919_21\t919_22\t919_23\t919_24\t919_25"}