{"name": "931", "parent": "", "content": "6 Things You Don’t Know About Money That Are Holding You Back “If your only goal is to become rich, you will never achieve it.” — John D. Rockefeller The irony of a strong financial life is that you don’t really want it. You want what a strong financial life represents: options. But wealth is a weird thing. Like happiness and success, it can’t be pursued directly. A lot of people try, but they’re never satisfied. Once they make the money they used to think would make them happy, they find something else that’s missing. Often times, it’s just more money. It’s what they know. Here are some things that people don’t know about money. If you learn them, you’ll have a leg up on how to build your wealth the right way. By the way, these aren’t things that I created out of thin air. They’re observations of how the natural laws of finance work. You can adapt any or all of them to your current situation with money and increase your chances of achieving the kind of financial state that widens the possibilities in your life. The question is, are you ready to start financially thriving? 1) Money is worthless by itself Money is only valuable because it can get you something else you want. It’s never an end goal. It’s meant to touch many hands. Give it. Invest it. Save it for a rainy day if you don’t have that set aside yet. Support a company or organization that’s meaningful to you. Money was meant to be exchanged. Don’t hoard it. Use it to connect with others more strongly than you could without. “Money is like love; it kills slowly and painfully the one who withholds it, and enlivens the other who turns it on his fellow man.”―Khalil Gibran 2) Smart money is slow The best money managers in the world think slow before an action. Why? Because making better money decisions requires you to take pauses. You might believe otherwise if you’ve watched movies like Wall Street. But what you’re seeing is speculation, not investing. The best investments take time to play out, don’t hinge on any single event or the success of one product, and are filled with ups and downs in the middle. Warren Buffett’s slow to get in and even slower to get out. “Our favorite holding period is forever.” — Warren Buffett Great money management means first, breaking your old patterns with money like buying too much stuff or going out all the time, and then intentionally deciding on new ways to deal with it. It’s hard. Let yourself slow down. 3) Making money is boring We’re only shown the dramatic, instant success stories of finance in the media, precisely because they’re so unusual. You don’t have to fall for it. For most individuals, making tons of money over a lifetime is like watching paint dry. Success is created and maintained by a thousand moves, all directed toward a long term goal. You save money bit by bit. You invest it. You receive dividends or income. You re-invest the proceeds, and compound your earnings year after year. It’s no drama. I wish I could share a story with you about some famous person who became wealthy the boring way. But that would be everyone, so no one writes about it. 4) Money means saying no Doing nothing is often the right thing to do. There are lots and lots of pretty shiny things begging for your money. Your future is worth more. Saying no to almost every opportunity to part with your money that comes your way is key to your financial success. Most of us waste what we have. The only exception to this rule is that you must say “Yes!” with your whole heart to things that truly align with your core values, like supporting your kids’ school if you think they do a great job, or investing in a business you believe in. The real work comes before the money moves here. It’s important to come to terms with your deepest, truest goals in life, and align your financial actions accordingly. “Learn to say ‘No’ to the good so you can say ‘Yes’ to the best.” — John C. Maxwell 5) Money must be set up Your attention is limited. There are only 24 hours a day, and they go fast. To become truly great at anything, you have to dedicate time and energy to it. If you don’t have the time or interest to study money deeply, you’ll need to get clear on your goals and automate your steps as much as possible. “Wealth is largely the result of habit.” — John Jacob Astor Learn the basics. The worst thing would be to automate a process before you truly understand it. Big accidents tend to happen this way. Read the fine print once, then go. 6) Money requires a supportive environment Even if you’ve learned the basics, gone on to change your habits, and decided which big goals you want your money to support, you’ll fail if you surround yourself with people who don’t support your new financial life. They’ll tear down what you’ve built up, not because they’re terrible people, but because our environment deeply influences how we feel, think, and behave about everything. We’re social creatures by nature. We want to fit in. “External triggers come from the environment. Our five senses pick up on them, as well as our minds.” — Marshall Goldsmith Many of the triggers that undermine our new goals happen in our subconscious, so you won’t necessarily know why you’re having such a hard time making them stick. Clear the decks if need be. See the friends who blow all their money more sparingly. Keep your focus on changing your financial life, and trust that you’ll eventually attract awesome people who have similar values. The point of money is to magnify you. If you care about something, you get the opportunity to make more impact. If you love someone, you can give them more of what they need. You can share more. You can contribute more. You can invest in your future more. You get more options. Hit the ❤ button if you liked this article! You’ll help others find it. Sign up for my free weekly newsletter (packed with thoughts I don’t share anywhere else) at janehwangbo.com. ", "title": "6 Things You Don’t Know About Money That Are Holding You Back", "sentences": [{"da85": "6 Things You Don’t Know About Money That Are Holding You Back"}, {"1e75": "“If your only goal is to become rich, you will never achieve it.”"}, {"0088": "— John D. Rockefeller"}, {"bf23": "The irony of a strong financial life is that you don’t really want it. You want what a strong financial life represents: options."}, {"7a6f": "But wealth is a weird thing. Like happiness and success, it can’t be pursued directly. A lot of people try, but they’re never satisfied. Once they make the money they used to think would make them happy, they find something else that’s missing. Often times, it’s just more money. It’s what they know."}, {"ed33": "Here are some things that people don’t know about money. If you learn them, you’ll have a leg up on how to build your wealth the right way."}, {"299a": "By the way, these aren’t things that I created out of thin air. They’re observations of how the natural laws of finance work. You can adapt any or all of them to your current situation with money and increase your chances of achieving the kind of financial state that widens the possibilities in your life."}, {"634c": "The question is, are you ready to start financially thriving?"}, {"1c8b": "1) Money is worthless by itself"}, {"48e9": "Money is only valuable because it can get you something else you want. It’s never an end goal. It’s meant to touch many hands."}, {"bf0e": "Give it. Invest it. Save it for a rainy day if you don’t have that set aside yet. Support a company or organization that’s meaningful to you. Money was meant to be exchanged."}, {"4500": "Don’t hoard it. Use it to connect with others more strongly than you could without."}, {"c1db": "“Money is like love; it kills slowly and painfully the one who withholds it, and enlivens the other who turns it on his fellow man.”―Khalil Gibran"}, {"6586": "2) Smart money is slow"}, {"235c": "The best money managers in the world think slow before an action. Why? Because making better money decisions requires you to take pauses."}, {"d173": "You might believe otherwise if you’ve watched movies like Wall Street. But what you’re seeing is speculation, not investing. The best investments take time to play out, don’t hinge on any single event or the success of one product, and are filled with ups and downs in the middle."}, {"ce11": "Warren Buffett’s slow to get in and even slower to get out."}, {"87b9": "“Our favorite holding period is forever.” — Warren Buffett"}, {"bf22": "Great money management means first, breaking your old patterns with money like buying too much stuff or going out all the time, and then intentionally deciding on new ways to deal with it. It’s hard."}, {"1ab1": "Let yourself slow down."}, {"f967": "3) Making money is boring"}, {"4bf9": "We’re only shown the dramatic, instant success stories of finance in the media, precisely because they’re so unusual. You don’t have to fall for it."}, {"c0b4": "For most individuals, making tons of money over a lifetime is like watching paint dry. Success is created and maintained by a thousand moves, all directed toward a long term goal."}, {"1832": "You save money bit by bit. You invest it. You receive dividends or income. You re-invest the proceeds, and compound your earnings year after year. It’s no drama."}, {"687d": "I wish I could share a story with you about some famous person who became wealthy the boring way. But that would be everyone, so no one writes about it."}, {"a346": "4) Money means saying no"}, {"2e19": "Doing nothing is often the right thing to do. There are lots and lots of pretty shiny things begging for your money. Your future is worth more."}, {"122f": "Saying no to almost every opportunity to part with your money that comes your way is key to your financial success. Most of us waste what we have."}, {"f4d7": "The only exception to this rule is that you must say “Yes!” with your whole heart to things that truly align with your core values, like supporting your kids’ school if you think they do a great job, or investing in a business you believe in."}, {"2182": "The real work comes before the money moves here. It’s important to come to terms with your deepest, truest goals in life, and align your financial actions accordingly."}, {"9ee1": "“Learn to say ‘No’ to the good so you can say ‘Yes’ to the best.” — John C. Maxwell"}, {"7600": "5) Money must be set up"}, {"7ef3": "Your attention is limited. There are only 24 hours a day, and they go fast."}, {"d6ec": "To become truly great at anything, you have to dedicate time and energy to it. If you don’t have the time or interest to study money deeply, you’ll need to get clear on your goals and automate your steps as much as possible."}, {"5f5e": "“Wealth is largely the result of habit.” — John Jacob Astor"}, {"27b2": "Learn the basics. The worst thing would be to automate a process before you truly understand it. Big accidents tend to happen this way. Read the fine print once, then go."}, {"6ef7": "6) Money requires a supportive environment"}, {"578a": "Even if you’ve learned the basics, gone on to change your habits, and decided which big goals you want your money to support, you’ll fail if you surround yourself with people who don’t support your new financial life."}, {"8039": "They’ll tear down what you’ve built up, not because they’re terrible people, but because our environment deeply influences how we feel, think, and behave about everything. We’re social creatures by nature. We want to fit in."}, {"ad8c": "“External triggers come from the environment. Our five senses pick up on them, as well as our minds.” — Marshall Goldsmith"}, {"3a31": "Many of the triggers that undermine our new goals happen in our subconscious, so you won’t necessarily know why you’re having such a hard time making them stick."}, {"1e67": "Clear the decks if need be. See the friends who blow all their money more sparingly."}, {"ce1c": "Keep your focus on changing your financial life, and trust that you’ll eventually attract awesome people who have similar values."}, {"0b31": "The point of money is to magnify you."}, {"1a64": "If you care about something, you get the opportunity to make more impact. If you love someone, you can give them more of what they need. You can share more. You can contribute more. You can invest in your future more."}, {"d356": "You get more options."}, {"94b2": "Hit the ❤ button if you liked this article! You’ll help others find it."}, {"2fe0": "Sign up for my free weekly newsletter (packed with thoughts I don’t share anywhere else) at janehwangbo.com."}], "child": "931_1\t931_2\t931_3\t931_4\t931_5\t931_6\t931_7\t931_8\t931_9\t931_10\t931_11\t931_12\t931_13\t931_14\t931_15\t931_16\t931_17\t931_18\t931_19\t931_20\t931_21\t931_22\t931_23\t931_24931_1\t931_2\t931_3\t931_4\t931_5\t931_6\t931_7\t931_8\t931_9\t931_10\t931_11\t931_12\t931_13\t931_14\t931_15\t931_16\t931_17\t931_18\t931_19\t931_20\t931_21\t931_22\t931_23\t931_24931_1\t931_2\t931_3\t931_4\t931_5\t931_6\t931_7\t931_8\t931_9\t931_10\t931_11\t931_12\t931_13\t931_14\t931_15\t931_16\t931_17\t931_18\t931_19\t931_20\t931_21\t931_22\t931_23\t931_24"}