{"name": "932", "parent": "", "content": "Why Where You Live Can Make You Wealthier, Healthier, And Happier By Richard Reis Hello dear, I just got back from my daily walk. Of course, it’s a gorgeous, sunny, and warm, California day. Perfect timing too, since walking fits nicely into the theme of this letter. You know, our past two letters have been pretty heavy. Talking about taxes and retirement plans ain’t easy. This is why I’m so happy we are going lighter today! (but it’s just as important, so pay attention) Location — aka where you live Picking the right address is so important, it can make or break your bank! Yet, I think most people haven’t put much thought into it (as evidenced by the strange phenomenon known as “rush hour”). Jacob at Early Retirement Extreme put it perfectly; the three most important things that matter for where you live are: Notice, in none of these reasons did he include “the place must be nice”. In other words, if you live further away from work just to live in a “nicer” apartment or house, you’re hurting yourself (of course, this excludes moving to a bad/ unsafe neighborhood). “Choosing a Place to Live is not about kitchen countertop surfaces or closet arrangements. It’s about putting you in the center of where you want your life to be. You can always decorate and optimize, but you cannot teleport. So location is everything, even if it means downsizing or renting instead of buying. Living in the right place gives you back time, energy, and friends.” — Mr. Money Mustache So, there you have it. In simple words; live close to where you live. That means your work and grocery outlet should be walking distance from where you live! “I’m still not convinced,” you say? “The places closer to my job are more expensive.” That might be true. It’s something I hear a lot. But rarely has that person done the math. So, before making the same conclusion, let’s test your assumption. Did you calculate the true cost of commuting? According to the U.S. Census Bureau, the average American commute is 26 minutes. If you own your car, you’re paying roughly $0.34 per minute driven. You commute twice so it’s 52 minutes per day. Multiply that by the cost per minute and you’re spending roughly $17 per day on your commutes. 2016 had 261 working days. Which means the average person with a 26min commute spent $4,437 in 2016 just to drive back and forth from work! (if your commute is longer, I have some bad, bad news). Remember you said living closer to work is more expensive? How about this; with $4,437 on commutes you could instead live in a place that’s walking distance from work, costs $350 more per month than your current location, and you’d STILL have more money by the end of the year! That’s without mentioning the hours. 52min per day means 260min per week. That’s half a workday! You’re giving away an extra HALF a workday every week just to sit in your car. Are you angry yet? How about the 17% of Americans who have commutes that are 45 minutes or longer? Yeah, “wow.” Ok, I’m done blowing your mind. Take a deep breath. It’s over. Let’s look at solutions. But I live in San Francisco So, you decided to live in an expensive city like San Francisco or New York. Firstly, that’s not such a bad thing because it gives you access to some of the world’s biggest money-making machines. In 2015, the median US household income was around $55,000 but in San Francisco, it was $88,000. Secondly, it’s fine if you’re in the right industry. It makes sense to live in SF if you work in tech, NY if you work in finance or fashion, or LA if you work in movies. Don’t forget, the best thing is for you to live where there’s an abundance of opportunities. Therefore, in some cases the high price is justifiable. Note: To find your dream city, here’s a great website. However, before moving to any city I recommend you check out Trulia and their “affordability heat map” to find the cheapest area to live. SF affordability heat map. Stay away from red! Stay away from red!! The real value of your location What neighborhood you live in doesn’t matter. “Ok, that’s crazy,” you say. “Of course it matters! Neighborhood x is better than neighborhood y, that’s where I want to be!” You know what matters more than neighborhood x, y, or z? Community. It doesn’t matter how many Ferraris are parked in each driveway. If you feel lonely where you live, you’ll be miserable. In fact, Eric Weiner put it perfectly in his book, “The Geography of Bliss: One Grump’s Search for the Happiest Place on Earth”: “The self-help industrial complex hasn’t helped. By telling us that happiness lives inside us, it’s turned us inward just when we should be looking outward. Not to money but to other people, to community and to the kind of human bonds that so clearly are the sources of our happiness. Americans work longer hours and commute greater distances than virtually any other people in the world. Commuting, in particular, has been found to be detrimental to our happiness, as well as our physical health. Every minute spent on the road is one less minute that we can spend with family and friends — the kind of activities, in other words, that make us happy. Political scientist Robert Putnam makes a convincing case in his book Bowling Alone that our sense of connection is fraying. We spend less time visiting family and friends; we belong to fewer community groups. Increasingly, we lead fragmented lives. The Internet and other technologies may salve our loneliness, but they have not, I believe, eliminated it.” — Eric Weiner No matter where you live, feeling connected or lonely will determine whether or not you love or hate it (this is why I moved right across the street from my friend who I build apps with). Humans are meant to live in small communities (and if more people did it, less of us would be depressed!). “But I’m shy,” you say. I understand. So am I. Which is why you should check out NextDoor. It’s the best way to indirectly meet your neighbors. Just browsing through I can see I’ve been invited to some “International Party & Lunch to celebrate Canada” next week. I can also see one of my neighbors is giving away a free chair while another is giving away a lawnmower. Now that’s how you build community! Bonus I know, I know. After reading everything I talked about, you rushed to Zillow and started looking for places closer to work. You’re smart. I know it’s hard to believe, but I have another reason (besides more money and happiness) why turning your car commute into a walking commute is the best decision you’ll make. That reason is health. Would you like to know: It’s this: WALKING. Don’t believe me? Watch this video. Not only is this the best habit you can pick up for your health, you’ll also be in good company. In his book “The Geography of Genius: A Search for the World’s Most Creative Places from Ancient Athens to Silicon Valley”, Eric Weiner investigates what geniuses through the ages (the ancient Greek philosophers, the Renaissance artists, the Silicon Valley geniuses) have in common. You can guess one of their habits, right? That’s it! They walked, a lot. “‘The ancient Greeks walked everywhere, all the time.’ They were great walkers and great thinkers and preferred to do their philosophizing while on the go. The Greeks, as usual, knew what they were doing. Many a genius has done his or her best thinking while walking. While working on A Christmas Carol, Dickens would walk fifteen or twenty miles through the back streets of London, turning over the plot in his mind, as the city slept. Mark Twain walked a lot, too, though he never got anywhere. He paced while he worked […] Recently, researchers have begun to investigate scientifically the link between walking and creativity. […] The results, published in the Journal of Experimental Psychology, confirm that the ancient Greeks were onto something. Creativity levels were “consistently and significantly” higher for the walkers versus the sitters. […] It didn’t take a lot of walking to boost creativity, either — anywhere from five to sixteen minutes.’” — Eric Weiner If Plato, Einstein, and Steve Jobs walked every day, maybe there’s something to it? Studies have shown that walking 30min a day is the ideal dose for all the goodies (that sounds like a perfect daily commute). And that’s it for today! Hopefully, after reading this you will: See you next week, be well. R P.S.: After sharing this post with a friend, here’s her reply (I don’t have kids, so the thought didn’t even cross my mind. But if you do, living close to their school is very important. Otherwise, you get a double commute! Who wants that??) Is this helpful? Please ❤️ it below, comment or Tweet me 😊 Hearing from your fellow readers and you is what makes writing these letters such a joy. Since I write about finance, legal jargon is obligatory (because the guys in suits made me). Before following any of my advice, read this disclaimer. Letter 13. Rock Your Retirement Plans— Tips For Older Young Adults ← PREVIOUS NEXT → Letter 15. The Ultimate Money-Saving Device: A Bike INDEX ", "title": "Why Where You Live Can Make You Wealthier, Healthier, And Happier", "sentences": [{"ecad": "Why Where You Live Can Make You Wealthier, Healthier, And Happier"}, {"26b4": "By Richard Reis"}, {"ed6a": "Hello dear,"}, {"b221": "I just got back from my daily walk. Of course, it’s a gorgeous, sunny, and warm, California day."}, {"ee63": "Perfect timing too, since walking fits nicely into the theme of this letter."}, {"7830": "You know, our past two letters have been pretty heavy. Talking about taxes and retirement plans ain’t easy."}, {"b2b7": "This is why I’m so happy we are going lighter today! (but it’s just as important, so pay attention)"}, {"2061": "Location — aka where you live"}, {"d550": "Picking the right address is so important, it can make or break your bank!"}, {"4975": "Yet, I think most people haven’t put much thought into it (as evidenced by the strange phenomenon known as “rush hour”)."}, {"f864": "Jacob at Early Retirement Extreme put it perfectly; the three most important things that matter for where you live are:"}, {"ec73": "Notice, in none of these reasons did he include “the place must be nice”."}, {"bbcd": "In other words, if you live further away from work just to live in a “nicer” apartment or house, you’re hurting yourself (of course, this excludes moving to a bad/ unsafe neighborhood)."}, {"91d3": "“Choosing a Place to Live is not about kitchen countertop surfaces or closet arrangements. It’s about putting you in the center of where you want your life to be. You can always decorate and optimize, but you cannot teleport. So location is everything, even if it means downsizing or renting instead of buying. Living in the right place gives you back time, energy, and friends.” — Mr. Money Mustache"}, {"c927": "So, there you have it. In simple words; live close to where you live."}, {"3ba0": "That means your work and grocery outlet should be walking distance from where you live!"}, {"d99f": "“I’m still not convinced,” you say? “The places closer to my job are more expensive.”"}, {"3e5f": "That might be true. It’s something I hear a lot. But rarely has that person done the math."}, {"b22e": "So, before making the same conclusion, let’s test your assumption."}, {"6d22": "Did you calculate the true cost of commuting?"}, {"abb8": "According to the U.S. Census Bureau, the average American commute is 26 minutes."}, {"076e": "If you own your car, you’re paying roughly $0.34 per minute driven."}, {"c746": "You commute twice so it’s 52 minutes per day. Multiply that by the cost per minute and you’re spending roughly $17 per day on your commutes."}, {"9395": "2016 had 261 working days. Which means the average person with a 26min commute spent $4,437 in 2016 just to drive back and forth from work! (if your commute is longer, I have some bad, bad news)."}, {"b103": "Remember you said living closer to work is more expensive? How about this; with $4,437 on commutes you could instead live in a place that’s walking distance from work, costs $350 more per month than your current location, and you’d STILL have more money by the end of the year!"}, {"6be1": "That’s without mentioning the hours. 52min per day means 260min per week. That’s half a workday! You’re giving away an extra HALF a workday every week just to sit in your car."}, {"20a7": "Are you angry yet?"}, {"2356": "How about the 17% of Americans who have commutes that are 45 minutes or longer?"}, {"c831": "Yeah, “wow.”"}, {"3cc1": "Ok, I’m done blowing your mind. Take a deep breath. It’s over."}, {"0598": "Let’s look at solutions."}, {"69f5": "But I live in San Francisco"}, {"e96d": "So, you decided to live in an expensive city like San Francisco or New York."}, {"08bd": "Firstly, that’s not such a bad thing because it gives you access to some of the world’s biggest money-making machines. In 2015, the median US household income was around $55,000 but in San Francisco, it was $88,000."}, {"b2c4": "Secondly, it’s fine if you’re in the right industry. It makes sense to live in SF if you work in tech, NY if you work in finance or fashion, or LA if you work in movies. Don’t forget, the best thing is for you to live where there’s an abundance of opportunities. Therefore, in some cases the high price is justifiable."}, {"278a": "Note: To find your dream city, here’s a great website."}, {"1929": "However, before moving to any city I recommend you check out Trulia and their “affordability heat map” to find the cheapest area to live."}, {"8a7d": "SF affordability heat map. Stay away from red! Stay away from red!!"}, {"4bfd": "The real value of your location"}, {"2738": "What neighborhood you live in doesn’t matter."}, {"c03e": "“Ok, that’s crazy,” you say. “Of course it matters! Neighborhood x is better than neighborhood y, that’s where I want to be!”"}, {"333e": "You know what matters more than neighborhood x, y, or z? Community."}, {"31f0": "It doesn’t matter how many Ferraris are parked in each driveway. If you feel lonely where you live, you’ll be miserable."}, {"6d3a": "In fact, Eric Weiner put it perfectly in his book, “The Geography of Bliss: One Grump’s Search for the Happiest Place on Earth”:"}, {"50b6": "“The self-help industrial complex hasn’t helped. By telling us that happiness lives inside us, it’s turned us inward just when we should be looking outward. Not to money but to other people, to community and to the kind of human bonds that so clearly are the sources of our happiness."}, {"08ab": "Americans work longer hours and commute greater distances than virtually any other people in the world. Commuting, in particular, has been found to be detrimental to our happiness, as well as our physical health. Every minute spent on the road is one less minute that we can spend with family and friends — the kind of activities, in other words, that make us happy."}, {"fae3": "Political scientist Robert Putnam makes a convincing case in his book Bowling Alone that our sense of connection is fraying. We spend less time visiting family and friends; we belong to fewer community groups. Increasingly, we lead fragmented lives. The Internet and other technologies may salve our loneliness, but they have not, I believe, eliminated it.” — Eric Weiner"}, {"bede": "No matter where you live, feeling connected or lonely will determine whether or not you love or hate it (this is why I moved right across the street from my friend who I build apps with)."}, {"f70c": "Humans are meant to live in small communities (and if more people did it, less of us would be depressed!)."}, {"f432": "“But I’m shy,” you say."}, {"c1e9": "I understand. So am I. Which is why you should check out NextDoor. It’s the best way to indirectly meet your neighbors."}, {"5ee7": "Just browsing through I can see I’ve been invited to some “International Party & Lunch to celebrate Canada” next week. I can also see one of my neighbors is giving away a free chair while another is giving away a lawnmower. Now that’s how you build community!"}, {"9908": "Bonus"}, {"c988": "I know, I know. After reading everything I talked about, you rushed to Zillow and started looking for places closer to work. You’re smart."}, {"08e6": "I know it’s hard to believe, but I have another reason (besides more money and happiness) why turning your car commute into a walking commute is the best decision you’ll make."}, {"a421": "That reason is health. Would you like to know:"}, {"3a73": "It’s this: WALKING."}, {"8665": "Don’t believe me? Watch this video."}, {"2b63": "Not only is this the best habit you can pick up for your health, you’ll also be in good company."}, {"aefc": "In his book “The Geography of Genius: A Search for the World’s Most Creative Places from Ancient Athens to Silicon Valley”, Eric Weiner investigates what geniuses through the ages (the ancient Greek philosophers, the Renaissance artists, the Silicon Valley geniuses) have in common."}, {"1bc7": "You can guess one of their habits, right? That’s it! They walked, a lot."}, {"e55c": "“‘The ancient Greeks walked everywhere, all the time.’ They were great walkers and great thinkers and preferred to do their philosophizing while on the go."}, {"ebc6": "The Greeks, as usual, knew what they were doing. Many a genius has done his or her best thinking while walking. While working on A Christmas Carol, Dickens would walk fifteen or twenty miles through the back streets of London, turning over the plot in his mind, as the city slept. Mark Twain walked a lot, too, though he never got anywhere. He paced while he worked […]"}, {"4d9a": "Recently, researchers have begun to investigate scientifically the link between walking and creativity. […]"}, {"bf65": "The results, published in the Journal of Experimental Psychology, confirm that the ancient Greeks were onto something. Creativity levels were “consistently and significantly” higher for the walkers versus the sitters. […] It didn’t take a lot of walking to boost creativity, either — anywhere from five to sixteen minutes.’” — Eric Weiner"}, {"a4f3": "If Plato, Einstein, and Steve Jobs walked every day, maybe there’s something to it?"}, {"6dbe": "Studies have shown that walking 30min a day is the ideal dose for all the goodies (that sounds like a perfect daily commute)."}, {"9911": "And that’s it for today!"}, {"586b": "Hopefully, after reading this you will:"}, {"14be": "See you next week, be well."}, {"0d84": "R"}, {"4c15": "P.S.: After sharing this post with a friend, here’s her reply (I don’t have kids, so the thought didn’t even cross my mind. But if you do, living close to their school is very important. Otherwise, you get a double commute! Who wants that??)"}, {"7491": "Is this helpful? Please ❤️ it below, comment or Tweet me 😊 Hearing from your fellow readers and you is what makes writing these letters such a joy."}, {"3d98": "Since I write about finance, legal jargon is obligatory (because the guys in suits made me). Before following any of my advice, read this disclaimer."}, {"c175": "Letter 13. Rock Your Retirement Plans— Tips For Older Young Adults ← PREVIOUS"}, {"54de": "NEXT → Letter 15. The Ultimate Money-Saving Device: A Bike"}, {"3c71": "INDEX"}], "child": "932_1\t932_2\t932_3\t932_4\t932_5\t932_6932_1\t932_2\t932_3\t932_4\t932_5\t932_6932_1\t932_2\t932_3\t932_4\t932_5\t932_6932_1\t932_2\t932_3\t932_4\t932_5\t932_6"}