{"name": "935", "parent": "", "content": "Jamie Dimon’s Shareholder (Advocacy) Letter On April 4, JPMorgan Chase Chairman and CEO Jamie Dimon published his annual shareholder letter, much of which focused on public policy and financial regulation. At 46 pages, Mr. Dimon’s letter includes a lot of interesting commentary. In this essay, I am going to respond to two of his main points because I strongly disagree with them. First, Mr. Dimon asserts that “essentially, Too Big to Fail has been solved — taxpayers will not pay if a bank fails.” Second, Mr. Dimon asserts that “it is clear that the banks have too much capital.” Both of these assertions are demonstrably false. Too big to fail has not been solved To make his argument that TBTF has been solved, Mr. Dimon repeatedly points to various regulatory schemes that all have the same unrealistic feature: In a crisis, bondholders will take losses rather than taxpayers. He refers to “bail-inable debt,” “total loss absorbing capacity,” “receivership where unsecured debt … would convert to equity,” “Chapter 14 bankruptcy” and “resolution.” All of these essentially mean the same thing: A bank runs into trouble; then either regulators or the courts trigger a conversion of debt to equity. Bondholders take losses. The firm is recapitalized and taxpayers are spared. Systemic risk is neutralized and bailouts are avoided. It sounds like an ideal solution. The problem is that it almost never actually works in real life. We learned from past financial crises, including the 2008 financial crisis, that nothing beats equity for absorbing losses. Equity holders have long taken losses in the United States and thus expect that outcome. Moreover, equity holders cannot run during a crisis. In contrast, debt holders of the most systemically important banks in the United States and around the world have repeatedly experienced bailouts and likely will expect such an outcome during the next financial crisis. Indeed, the most recent crisis showed that even some debt holders who had been explicitly told that they would take losses during a crisis got bailed out. Governments are reluctant to impose losses on creditors of a TBTF bank during a crisis because of the risk of contagion: Creditors at other TBTF banks may fear they will face similar losses and will then try to pull whatever funding they can, or at least refuse to reinvest when debt comes due. This is why, regardless of their promises during good times, governments do not want to impose losses on bondholders during a crisis. History has repeatedly shown this to be true and, while we can hope for the best, there is no credible reason to believe this won’t be true in the next crisis. Only true equity should be considered loss-absorbing in a crisis. The largest banks do not have enough equity today to protect taxpayers. Too big to fail is alive and well. Taxpayers are on the hook. Large banks have too little capital, not too much To make his argument that banks have too much capital, Mr. Dimon points to losses estimated by the Federal Reserve’s stress test and compares them to banks’ combined equity and long-term debt. Again, Mr. Dimon unrealistically assumes that debt will absorb losses in a crisis. As explained above, that is extremely unlikely. In addition, stress tests are just hypothetical scenarios. By definition, regulators (and bankers) won’t see the next crisis coming, and it will almost certainly look different from past crises, or scenarios modeled in a stress test. Mr. Dimon argues that the current capital standards are restraining lending and impairing economic growth, yet he also points out that JPMorgan bought back $26 billion in stock over the past five years. If JPMorgan really had demand for additional loans from creditworthy borrowers, why did it turn those customers away and instead choose to buy back its stock? The truth is that borrowing costs for homeowners and businesses are near record lows. If loans were scarce, borrowers would be competing for them, driving up costs. That isn’t happening. Nor do other indicators suggest a lack of loans. Bank credit has grown 23 percent over the past three years, about twice as much as nominal gross domestic product. Only 4 percent of small businesses surveyed by the National Federation of Independent Business report not having their credit needs met. Capital is the best defense against bailouts. Although capital standards are higher than before the last crisis, they are not nearly high enough. The odds of a bailout in the next century are still nearly 70 percent. Large banks need to be able to withstand around a 20 percent loss on their assets to protect against taxpayer bailouts in a downturn like the Great Recession, according to a 2015 analysis by the Federal Reserve. Unfortunately, regulators have taken it easy on the large banks, which today have only about half of the equity they need. Doubling the equity capital requirements for the largest banks would substantially address the TBTF problem and protect taxpayers. It also passes a cost-benefit test for society. Areas of agreement Mr. Dimon calls for reducing regulatory complexity, and I agree with this principle. In fact, a higher equity requirement produces the most protection for taxpayers in the simplest, most effective way. Once we have addressed TBTF by forcing large banks to fund themselves with far more common equity, I believe we can streamline other regulations, especially on small banks that have been severely burdened with regulation, but do not pose a systemic risk to society. ", "title": "Jamie Dimon’s Shareholder (Advocacy) Letter", "sentences": [{"b0ba": "Jamie Dimon’s Shareholder (Advocacy) Letter"}, {"0b03": "On April 4, JPMorgan Chase Chairman and CEO Jamie Dimon published his annual shareholder letter, much of which focused on public policy and financial regulation. At 46 pages, Mr. Dimon’s letter includes a lot of interesting commentary. In this essay, I am going to respond to two of his main points because I strongly disagree with them. First, Mr. Dimon asserts that “essentially, Too Big to Fail has been solved — taxpayers will not pay if a bank fails.” Second, Mr. Dimon asserts that “it is clear that the banks have too much capital.” Both of these assertions are demonstrably false."}, {"d349": "Too big to fail has not been solved"}, {"b362": "To make his argument that TBTF has been solved, Mr. Dimon repeatedly points to various regulatory schemes that all have the same unrealistic feature: In a crisis, bondholders will take losses rather than taxpayers. He refers to “bail-inable debt,” “total loss absorbing capacity,” “receivership where unsecured debt … would convert to equity,” “Chapter 14 bankruptcy” and “resolution.” All of these essentially mean the same thing: A bank runs into trouble; then either regulators or the courts trigger a conversion of debt to equity. Bondholders take losses. The firm is recapitalized and taxpayers are spared. Systemic risk is neutralized and bailouts are avoided. It sounds like an ideal solution. The problem is that it almost never actually works in real life."}, {"3179": "We learned from past financial crises, including the 2008 financial crisis, that nothing beats equity for absorbing losses. Equity holders have long taken losses in the United States and thus expect that outcome. Moreover, equity holders cannot run during a crisis. In contrast, debt holders of the most systemically important banks in the United States and around the world have repeatedly experienced bailouts and likely will expect such an outcome during the next financial crisis. Indeed, the most recent crisis showed that even some debt holders who had been explicitly told that they would take losses during a crisis got bailed out."}, {"17f5": "Governments are reluctant to impose losses on creditors of a TBTF bank during a crisis because of the risk of contagion: Creditors at other TBTF banks may fear they will face similar losses and will then try to pull whatever funding they can, or at least refuse to reinvest when debt comes due. This is why, regardless of their promises during good times, governments do not want to impose losses on bondholders during a crisis. History has repeatedly shown this to be true and, while we can hope for the best, there is no credible reason to believe this won’t be true in the next crisis. Only true equity should be considered loss-absorbing in a crisis. The largest banks do not have enough equity today to protect taxpayers. Too big to fail is alive and well. Taxpayers are on the hook."}, {"65d2": "Large banks have too little capital, not too much"}, {"1c30": "To make his argument that banks have too much capital, Mr. Dimon points to losses estimated by the Federal Reserve’s stress test and compares them to banks’ combined equity and long-term debt. Again, Mr. Dimon unrealistically assumes that debt will absorb losses in a crisis. As explained above, that is extremely unlikely. In addition, stress tests are just hypothetical scenarios. By definition, regulators (and bankers) won’t see the next crisis coming, and it will almost certainly look different from past crises, or scenarios modeled in a stress test."}, {"dd8f": "Mr. Dimon argues that the current capital standards are restraining lending and impairing economic growth, yet he also points out that JPMorgan bought back $26 billion in stock over the past five years. If JPMorgan really had demand for additional loans from creditworthy borrowers, why did it turn those customers away and instead choose to buy back its stock?"}, {"2b82": "The truth is that borrowing costs for homeowners and businesses are near record lows. If loans were scarce, borrowers would be competing for them, driving up costs. That isn’t happening. Nor do other indicators suggest a lack of loans. Bank credit has grown 23 percent over the past three years, about twice as much as nominal gross domestic product. Only 4 percent of small businesses surveyed by the National Federation of Independent Business report not having their credit needs met."}, {"6bfd": "Capital is the best defense against bailouts. Although capital standards are higher than before the last crisis, they are not nearly high enough. The odds of a bailout in the next century are still nearly 70 percent. Large banks need to be able to withstand around a 20 percent loss on their assets to protect against taxpayer bailouts in a downturn like the Great Recession, according to a 2015 analysis by the Federal Reserve. Unfortunately, regulators have taken it easy on the large banks, which today have only about half of the equity they need."}, {"f03c": "Doubling the equity capital requirements for the largest banks would substantially address the TBTF problem and protect taxpayers. It also passes a cost-benefit test for society."}, {"5ec4": "Areas of agreement"}, {"6633": "Mr. Dimon calls for reducing regulatory complexity, and I agree with this principle. In fact, a higher equity requirement produces the most protection for taxpayers in the simplest, most effective way. Once we have addressed TBTF by forcing large banks to fund themselves with far more common equity, I believe we can streamline other regulations, especially on small banks that have been severely burdened with regulation, but do not pose a systemic risk to society."}], "child": "935_1\t935_2\t935_3\t935_4\t935_5\t935_6\t935_7\t935_8"}