{"name": "950", "parent": "", "content": "Philosophy for Business Thinking clearly as a management model There’s been a lot of handwringing about America’s performance in STEM education and increasing concern that we need to step up our efforts. As the world becomes progressively more technological, so the thinking goes, those without requisite skills will get left behind. Yet Fareed Zakaria disagrees, arguing in his book, In Defense of a Liberal Education, that it has been America’s commitment to a broad-based education that has led to our current level of prosperity. He also notes that other high tech countries, like Sweden and Israel, perform even worse on STEM tests than we do. Writing in Harvard Business Review, David Brendel takes it a step further. In addition to the liberal arts skills that Zakaria cites, Brendel argues that philosophical reflection is essential for effective leadership. I agree. However, I also think that he overlooks another benefit of philosophy: it teaches practical skills that managers need now more than ever. The Logic of Aristotle Logic is a term that is frequently misused. Often, when people say something is “logical” or “valid,” they mean that they think it is true, but that’s a misnomer. Validity has to do with the internal structure of an argument rather than whether the individual statements within it are true. An argument can be logically valid yet be filled with false statements, just as an argument can be invalid yet filled with true statements. That’s the essence of Aristotle’s logic, which survived for nearly 2000 years without any significant addition or amendment. At the core of Aristotelian logic is the syllogism, which allows us to judge the validity of statements by their structure alone, even when stripped of content. Here’s Why You Shouldn’t Copycat StrategyThe case for a custom-built approacharcdigital.media Once you become trained in logic, you will find a surprising amount of common business communication doesn’t meet its standard. For example, if I say that social media is a good idea because “everybody knows it is,” I am making a logical error called begging the question, because I am taking for granted precisely what is in dispute. In the digital age, it is becoming increasingly difficult to separate logic from technology. Learning calculus is useful for engineering bridges, but software engineers code by logic. I might even go as far as to say that logicians make better coders, but that would open me up to accusations of confirmation bias, which often leads to logical errors. Gödel’s Incompleteness Theorems Although Aristotle’s theory of logic is almost unparalleled in its power and longevity, by the late 19th century, thinkers such as Gottlob Frege and Georg Cantor began to notice some flaws. They tried to patch up the system, but every time they did, more holes appeared. Eventually, Russell’s paradox unearthed a contradiction that no one seemed to be able to reconcile. That created a full-scale crisis which threatened the very fabric of Western thought. Logicians scrambled to close the hole, but in 1931 a 25-year-old Austrian logician named Kurt Gödel published his incompleteness theorems, which determined that logic was broken forever. In effect, he proved that every logical system crashes eventually. It’s just a matter of time. Infinite AmericaOn the dawning of a new era of innovationarcdigital.media Managers should take note. Every time you think you have built the perfect system for compensation, logistics, etc., it is far likelier that there are difficulties — some even potentially insurmountable — lurking around the corner. If the brightest philosophers and mathematicians pose devastating problems to each other’s works, we can’t expect our business systems to be without flaws. Ironically, our current dependence on logic is based on the Austrian’s work. A few years after he published his famous theorems, a young Alan Turing used Gödel’s methods to develop a universal computer, which led to the digital economy we know today. Wittgenstein On Communication One reality that executives need to face is the increasing importance of communication and collaboration. As Leonard Read aptly pointed out in his 1966 essay, “I, Pencil,” even the manufacture of a simple object is beyond the reach of a single person. Today, the world has become far more complex and the need to communicate effectively even greater. The journal Nature recently noted that the average scientific paper has four times as many authors as it did when Read published his essay, so communication has become essential for innovation. Unfortunately, many executives communicate quite poorly, but can find very helpful guidance from Ludwig Wittgenstein. Wittgenstein’s work in this area is vast, but perhaps his most important idea is his refutation of private language. Anybody who has sat through a jargon filled meeting is familiar with the problem of a private language. Acronyms and neologisms can provide helpful shorthand for complex ideas, but can also obscure their meaning. Wittgenstein’s point was not only that private languages such as jargon can confuse the listener, but also the speaker. In effect, he argued that if you can’t explain something in a public language that everyone can understand, you don’t really understand it yourself. So, while technical language can be helpful, even necessary, try to explain things in everyday terms — even to yourself. Not only will you become a better communicator, your own grasp will improve as well. Rawls’ Veil Of Ignorance A final issue that is of great concern of executives today is fairness. From executive pay to discrimination complaints, treating people fairly is no longer just a moral concern, but a major source of liability. Besides legal liability, consumers often levy a heavy social tax on firms they see as acting unfairly. Executives are often urged to show empathy — to put themselves in others shoes — and that can be helpful in one-on-one encounters. However, for creating a just organization, John Rawls’ concept of the veil of ignorance can be much more helpful. The Veil of IgnoranceOn the famous Rawlsian thought experimentarcdigital.media The basic idea is to think about how you would like things to work if you had no idea where you would end up in the system. So, for example, if you were a line worker, you might be offended by the higher salaries of executives. On the other hand, if you were a manager, you would also want to be compensated for your advancement and achievement. The veil of ignorance, like other philosophical concepts, doesn’t lead to easy answers, but it does help lead to the right questions. And, aside from the intrinsic enrichment that reflecting on important questions can provide, that’s the major value of philosophy in business life. It can lead, as Brendel argues, to valuable self reflection. But perhaps more importantly, it can help us think more clearly about the practical issues we face everyday. ", "title": "Philosophy for Business", "sentences": [{"9978": "Philosophy for Business"}, {"67df": "Thinking clearly as a management model"}, {"ee40": "There’s been a lot of handwringing about America’s performance in STEM education and increasing concern that we need to step up our efforts. As the world becomes progressively more technological, so the thinking goes, those without requisite skills will get left behind."}, {"2d7c": "Yet Fareed Zakaria disagrees, arguing in his book, In Defense of a Liberal Education, that it has been America’s commitment to a broad-based education that has led to our current level of prosperity. He also notes that other high tech countries, like Sweden and Israel, perform even worse on STEM tests than we do."}, {"740c": "Writing in Harvard Business Review, David Brendel takes it a step further. In addition to the liberal arts skills that Zakaria cites, Brendel argues that philosophical reflection is essential for effective leadership. I agree. However, I also think that he overlooks another benefit of philosophy: it teaches practical skills that managers need now more than ever."}, {"9dff": "The Logic of Aristotle"}, {"4c42": "Logic is a term that is frequently misused. Often, when people say something is “logical” or “valid,” they mean that they think it is true, but that’s a misnomer. Validity has to do with the internal structure of an argument rather than whether the individual statements within it are true. An argument can be logically valid yet be filled with false statements, just as an argument can be invalid yet filled with true statements."}, {"a311": "That’s the essence of Aristotle’s logic, which survived for nearly 2000 years without any significant addition or amendment. At the core of Aristotelian logic is the syllogism, which allows us to judge the validity of statements by their structure alone, even when stripped of content."}, {"f2e7": "Here’s Why You Shouldn’t Copycat StrategyThe case for a custom-built approacharcdigital.media"}, {"3dc1": "Once you become trained in logic, you will find a surprising amount of common business communication doesn’t meet its standard. For example, if I say that social media is a good idea because “everybody knows it is,” I am making a logical error called begging the question, because I am taking for granted precisely what is in dispute."}, {"61d7": "In the digital age, it is becoming increasingly difficult to separate logic from technology. Learning calculus is useful for engineering bridges, but software engineers code by logic. I might even go as far as to say that logicians make better coders, but that would open me up to accusations of confirmation bias, which often leads to logical errors."}, {"5d01": "Gödel’s Incompleteness Theorems"}, {"b973": "Although Aristotle’s theory of logic is almost unparalleled in its power and longevity, by the late 19th century, thinkers such as Gottlob Frege and Georg Cantor began to notice some flaws. They tried to patch up the system, but every time they did, more holes appeared. Eventually, Russell’s paradox unearthed a contradiction that no one seemed to be able to reconcile."}, {"31c4": "That created a full-scale crisis which threatened the very fabric of Western thought. Logicians scrambled to close the hole, but in 1931 a 25-year-old Austrian logician named Kurt Gödel published his incompleteness theorems, which determined that logic was broken forever. In effect, he proved that every logical system crashes eventually. It’s just a matter of time."}, {"391d": "Infinite AmericaOn the dawning of a new era of innovationarcdigital.media"}, {"f653": "Managers should take note. Every time you think you have built the perfect system for compensation, logistics, etc., it is far likelier that there are difficulties — some even potentially insurmountable — lurking around the corner. If the brightest philosophers and mathematicians pose devastating problems to each other’s works, we can’t expect our business systems to be without flaws."}, {"8e0a": "Ironically, our current dependence on logic is based on the Austrian’s work. A few years after he published his famous theorems, a young Alan Turing used Gödel’s methods to develop a universal computer, which led to the digital economy we know today."}, {"a0f9": "Wittgenstein On Communication"}, {"b0d7": "One reality that executives need to face is the increasing importance of communication and collaboration. As Leonard Read aptly pointed out in his 1966 essay, “I, Pencil,” even the manufacture of a simple object is beyond the reach of a single person. Today, the world has become far more complex and the need to communicate effectively even greater."}, {"8b8b": "The journal Nature recently noted that the average scientific paper has four times as many authors as it did when Read published his essay, so communication has become essential for innovation. Unfortunately, many executives communicate quite poorly, but can find very helpful guidance from Ludwig Wittgenstein."}, {"6c01": "Wittgenstein’s work in this area is vast, but perhaps his most important idea is his refutation of private language. Anybody who has sat through a jargon filled meeting is familiar with the problem of a private language. Acronyms and neologisms can provide helpful shorthand for complex ideas, but can also obscure their meaning."}, {"d10b": "Wittgenstein’s point was not only that private languages such as jargon can confuse the listener, but also the speaker. In effect, he argued that if you can’t explain something in a public language that everyone can understand, you don’t really understand it yourself."}, {"4d7d": "So, while technical language can be helpful, even necessary, try to explain things in everyday terms — even to yourself. Not only will you become a better communicator, your own grasp will improve as well."}, {"2c65": "Rawls’ Veil Of Ignorance"}, {"aa35": "A final issue that is of great concern of executives today is fairness. From executive pay to discrimination complaints, treating people fairly is no longer just a moral concern, but a major source of liability. Besides legal liability, consumers often levy a heavy social tax on firms they see as acting unfairly."}, {"e844": "Executives are often urged to show empathy — to put themselves in others shoes — and that can be helpful in one-on-one encounters. However, for creating a just organization, John Rawls’ concept of the veil of ignorance can be much more helpful."}, {"2b36": "The Veil of IgnoranceOn the famous Rawlsian thought experimentarcdigital.media"}, {"1858": "The basic idea is to think about how you would like things to work if you had no idea where you would end up in the system. So, for example, if you were a line worker, you might be offended by the higher salaries of executives. On the other hand, if you were a manager, you would also want to be compensated for your advancement and achievement."}, {"1f0c": "The veil of ignorance, like other philosophical concepts, doesn’t lead to easy answers, but it does help lead to the right questions. And, aside from the intrinsic enrichment that reflecting on important questions can provide, that’s the major value of philosophy in business life. It can lead, as Brendel argues, to valuable self reflection. But perhaps more importantly, it can help us think more clearly about the practical issues we face everyday."}], "child": "950_1\t950_2"}