{"name": "954", "parent": "", "content": "There Can be No Progressive Coalition Without Working Class Whites In direct conflict with the self-interest of the Democratic Party or any notion of progressive humanism, many liberals have expressed disgust at Bernie Sanders’ suggestion that the party should attempt to coalition build with low-income white voters. Their reasoning is as follows: acknowledging racists is tantamount to agreeing with them, and courting their votes necessitates adopting their bigoted views. This approach is politically destructive, logically flawed, and fundamentally illiberal. The blog-o-Twitter-sphere has latched on to a series of logical and factual fallacies to substantiate their anti-poor-white evangelism: 1) That Trump won because of the intractable racism of certain irredeemable white voters who, despite twice voting for a purported Muslim whose name evokes two infamous extremists, refused to vote for one of the whitest woman on record; 2) that the Trump base is comprised of poor, hopeless ‘hicks,’ who are chiefly to blame for his victory and; 3) that any low-income white person who voted for Trump should not be courted because they are lost causes, deplorable human beings, and scabs on society whose suffering is not the concern of the Democratic party. First it should be obvious that the only people hurt by this self-righteous isolationism are liberals and the vulnerable populations they purport to protect. Democrats just lost an election to a vainglorious dolt with a third-grade vocabulary, the critical reasoning skills of a cocker spaniel and personal ethics that would make a Ferengi blush. How? The plurality of Election 2016 post mortems blame Clinton’s failure to campaign or run policy-centered ads in those states where lower-income white voters twice turned out in critical numbers for Obama. Clinton lost a million Rust Belt voters compared to Obama in 2012 — that’s a 13 percent loss. (It should be noted that these were not necessarily “Trump voters,” but white voters who declined to come out for Clinton. Still, these “working class whites” get charged indiscriminately with racism when referenced in the context of Sanders’ appeals). Although the Democratic Party has long been hopeful that a shift in national demographics would liberate it from relying on the white vote, it is becoming increasingly clear that a minority-majority country may not be the panacea it was once thought to be. Democrats cannot rely on political biological determinism to carry the day — at least not yet. Until then, the party can ignore poor white swing voters at it’s own peril. But instead of focusing on how to re-engage the voters that aided Obama’s victories, these voters have been stigmatized as uniquely racist, “deplorable,” and beneath political recognition. The venom directed at this group is not only politically disadvantageous, it’s capricious: why not focus rage on white women — the majority of whom voted for Trump? Middle class whites formed the bulk of his support, yet twitter-venom is reserved for the poor. This focus is not only classist, its counter-factual and destructive. Second, it simply is not possible to create a coalition that genuinely serves the poor but also excludes poor whites — especially while it enthusiastically ushers Wall Street under the tent. That certain liberals can simultaneously attack Sanders for emphasizing an economic message which, if manifested, will disproportionately uplift people of color and women, while celebrating women and people of color who have sold out the interests of their demographic groups again and again, speaks to the negative power of weaponized identitarianism, and is one of most serious threats faced by the progressive movement. It is possible to craft a message which appeals to poor or working class white voters without race-baiting or marginalizing the interests of other identity groups. Again, take Obama’s winning formula as an example. I trust that the Democratic Party can manage to address the genuine economic and health concerns of failing, post-industrial economies without slandering Mexicans, mocking the disabled, or instituting Jim Crow laws — even if its own members express doubt. Democratic party: you are good enough, you’re smart enough, and, damnit, people like you! Trust that since the economic concerns of the Rust Belt fuel the racial animus which many argue Sanders should center, focusing on economic issues is a complement to, not a distraction from, racial justice advocacy. Breaking up the banks can, in fact, put a dent in racism — regardless of what you might have heard from certain friends of Wall Street. It should not be the exclusive racial justice approach, but of course, Sanders has never argued it should be, no matter how many strawmen bleat otherwise. Now, the concern that marginalized groups may become more marginalized if economics take center stage is a genuine concern that I share. But the hand wringing seems disingenuous in this case. During the primary, the same cohort who now fret about who Sanders’ economic justice movement would exclude was willing to absolve Wall Street (who disappeared 50% of black wealth during the recession), abandon single payer health care as something that could “never ever happen,” and embrace a pro-fracking candidate who, to date, has declined to take a position on #NODAPL — all in the interest of winning an election. Clinton’s demonstrated failure to stand behind these interests should not be judged more generously than the mere prospective risk that racial coalition building presents. Sanders is neither playing purity politics, as claimed, nor selling out marginalized groups. Certainly, it is inconsistent to claim he is doing both. If it has no other benefits, Sanders’ plan to unite the bottom 47% is more likely to be effective than one which requires leftists to forge race-based coalitions from smaller and more balkanized groups. Hillary supporters advocated pragmatism throughout the primary, so perhaps if none of the others I’ve articulated resonant, this argument will. I will agree with Bernie critics on one point — he shouldn’t deny that Trump voters are racist. Of course many Trump voters are racist, and all are at least indifferent to the racial consequences of their pro-Trump vote. But importantly, the point that I believe Sanders is trying to make is that Republicans are hardly uniquely racist. During the primary, Democrats smugly cited statistics explaining that one-third of Trump voters thought black people were intellectually inferior to whites, ignoring that twenty-two percent of Clinton voters shared those attitudes. As a black woman, I am not enthusiastic about belonging to either camp. If being racist makes you “deplorable” and beyond the reach of party outreach, then there are quite a few Democrats that should be unsubscribed from the email list. Even ignoring the fact that racists come in shades of red and blue, a distaste for bigotry should not translate into a belief that the political system shouldn’t respect the humanity of all citizens. The spate of hot takes and tweets celebrating Trump voters who may lose their health care or their husbands to deportation suggest a troubling indifference to suffering which, notably, was echoed in the complaints many Trump voters had about Democrats around the time of the election, as well as in accounts by Sarah Smarsh and other writers who have reflected on liberal elitism from the perspective of the country’s interior. Famously, to Clinton, these people were “deplorables”: a word that reads as a shakable insult in adjective form, but an immutable characteristic when made into a noun. Like the word “untouchable,” it is too essentializing to co-exist comfortably alongside the American dream. Consider what it would mean for the president of the United States to be entrusted with the lives of citizens whom she considers “irredeemable.” What helpful policy interventions can a poor white racist expect from a president believes they are beyond hope? Why should a former Obama voter consider a progressive agenda if the left continues to echo these sentiments? Liberals are quite able to understand that Mike Brown did not deserve to be murdered regardless of whether he stole cigarillos, even if he did start an altercation with the cops, even if he were a drug user or somehow not “blameless” in the eyes of society. We understand that black and brown people who disproportionately fill America’s jails are largely products of their environments: bad schools, lack of job opportunity, crime-filled, segregated neighborhoods created through racist government programs. But sympathy for poor whites is anathema. Now, I completely understand those who are frustrated that sympathy seems to find struggling whites more easily than those with black and brown skin. I’m frustrated by that too. Maddened by it. But ignoring anyone’s humanity is dangerous — both politically and ethically. Republicans have spent millions of dollars (and dozens of years) creating a fictive causal relationship between the negative fates of poor whites and the existence of people of color. It is in our interest to undo that damage rather than aid conservative recruitment efforts by advertising an indifference that goes against progressive values. Should we play a smaller violin for poor whites? Yes. We should not care more about them than other, more vulnerable and worse-off populations, and we should remain vigilant against the risk that the marginalized could be pushed entirely off the page. After all, Black Lives Matter. But the irony is that the class-based coalition Sanders is assembling can demand more than the crumbs of tokenism and PC language people of color have settled for — stuck between the scylla and charybdis of the two-party system. This is something Martin Luther King Jr. understood, and it is a dream we should continue to pursue. This is why leading with economic justice is so important. Identity politics has convinced many that white folks are the enemy, as though it is race, rather than power, that corrupts absolutely. It tricks us into caring more about the gender of our politicians than their record on abortion rights. It convinces us that poor white people are the enemy even when their interests are largely (though not completely) aligned with poor people of color. And it seduces us into using language that appears to exclude poor whites from the uplift and benefit they would receive as a result of Democratic social programs. It’s time to stop acting like a more inclusive rhetorical strategy requires a policy prescription that diminishes the marginalized. This needn’t be a zero sum game. So next time Sanders appeals to whites, applaud him. Because if you had paid more attention to him (and polls) back in March of last year, we wouldn’t even be in this mess to begin with. #berniewouldhavewon ", "title": "There Can be No Progressive Coalition Without Working Class Whites", "sentences": [{"3cbc": "There Can be No Progressive Coalition Without Working Class Whites"}, {"ddcf": "In direct conflict with the self-interest of the Democratic Party or any notion of progressive humanism, many liberals have expressed disgust at Bernie Sanders’ suggestion that the party should attempt to coalition build with low-income white voters. Their reasoning is as follows: acknowledging racists is tantamount to agreeing with them, and courting their votes necessitates adopting their bigoted views."}, {"9e34": "This approach is politically destructive, logically flawed, and fundamentally illiberal."}, {"a419": "The blog-o-Twitter-sphere has latched on to a series of logical and factual fallacies to substantiate their anti-poor-white evangelism: 1) That Trump won because of the intractable racism of certain irredeemable white voters who, despite twice voting for a purported Muslim whose name evokes two infamous extremists, refused to vote for one of the whitest woman on record; 2) that the Trump base is comprised of poor, hopeless ‘hicks,’ who are chiefly to blame for his victory and; 3) that any low-income white person who voted for Trump should not be courted because they are lost causes, deplorable human beings, and scabs on society whose suffering is not the concern of the Democratic party."}, {"ee54": "First it should be obvious that the only people hurt by this self-righteous isolationism are liberals and the vulnerable populations they purport to protect. Democrats just lost an election to a vainglorious dolt with a third-grade vocabulary, the critical reasoning skills of a cocker spaniel and personal ethics that would make a Ferengi blush. How? The plurality of Election 2016 post mortems blame Clinton’s failure to campaign or run policy-centered ads in those states where lower-income white voters twice turned out in critical numbers for Obama. Clinton lost a million Rust Belt voters compared to Obama in 2012 — that’s a 13 percent loss. (It should be noted that these were not necessarily “Trump voters,” but white voters who declined to come out for Clinton. Still, these “working class whites” get charged indiscriminately with racism when referenced in the context of Sanders’ appeals). Although the Democratic Party has long been hopeful that a shift in national demographics would liberate it from relying on the white vote, it is becoming increasingly clear that a minority-majority country may not be the panacea it was once thought to be. Democrats cannot rely on political biological determinism to carry the day — at least not yet. Until then, the party can ignore poor white swing voters at it’s own peril."}, {"fc23": "But instead of focusing on how to re-engage the voters that aided Obama’s victories, these voters have been stigmatized as uniquely racist, “deplorable,” and beneath political recognition. The venom directed at this group is not only politically disadvantageous, it’s capricious: why not focus rage on white women — the majority of whom voted for Trump? Middle class whites formed the bulk of his support, yet twitter-venom is reserved for the poor. This focus is not only classist, its counter-factual and destructive."}, {"837c": "Second, it simply is not possible to create a coalition that genuinely serves the poor but also excludes poor whites — especially while it enthusiastically ushers Wall Street under the tent. That certain liberals can simultaneously attack Sanders for emphasizing an economic message which, if manifested, will disproportionately uplift people of color and women, while celebrating women and people of color who have sold out the interests of their demographic groups again and again, speaks to the negative power of weaponized identitarianism, and is one of most serious threats faced by the progressive movement."}, {"9c45": "It is possible to craft a message which appeals to poor or working class white voters without race-baiting or marginalizing the interests of other identity groups. Again, take Obama’s winning formula as an example. I trust that the Democratic Party can manage to address the genuine economic and health concerns of failing, post-industrial economies without slandering Mexicans, mocking the disabled, or instituting Jim Crow laws — even if its own members express doubt. Democratic party: you are good enough, you’re smart enough, and, damnit, people like you! Trust that since the economic concerns of the Rust Belt fuel the racial animus which many argue Sanders should center, focusing on economic issues is a complement to, not a distraction from, racial justice advocacy. Breaking up the banks can, in fact, put a dent in racism — regardless of what you might have heard from certain friends of Wall Street. It should not be the exclusive racial justice approach, but of course, Sanders has never argued it should be, no matter how many strawmen bleat otherwise."}, {"5280": "Now, the concern that marginalized groups may become more marginalized if economics take center stage is a genuine concern that I share. But the hand wringing seems disingenuous in this case. During the primary, the same cohort who now fret about who Sanders’ economic justice movement would exclude was willing to absolve Wall Street (who disappeared 50% of black wealth during the recession), abandon single payer health care as something that could “never ever happen,” and embrace a pro-fracking candidate who, to date, has declined to take a position on #NODAPL — all in the interest of winning an election. Clinton’s demonstrated failure to stand behind these interests should not be judged more generously than the mere prospective risk that racial coalition building presents. Sanders is neither playing purity politics, as claimed, nor selling out marginalized groups. Certainly, it is inconsistent to claim he is doing both. If it has no other benefits, Sanders’ plan to unite the bottom 47% is more likely to be effective than one which requires leftists to forge race-based coalitions from smaller and more balkanized groups. Hillary supporters advocated pragmatism throughout the primary, so perhaps if none of the others I’ve articulated resonant, this argument will."}, {"2998": "I will agree with Bernie critics on one point — he shouldn’t deny that Trump voters are racist. Of course many Trump voters are racist, and all are at least indifferent to the racial consequences of their pro-Trump vote. But importantly, the point that I believe Sanders is trying to make is that Republicans are hardly uniquely racist. During the primary, Democrats smugly cited statistics explaining that one-third of Trump voters thought black people were intellectually inferior to whites, ignoring that twenty-two percent of Clinton voters shared those attitudes. As a black woman, I am not enthusiastic about belonging to either camp. If being racist makes you “deplorable” and beyond the reach of party outreach, then there are quite a few Democrats that should be unsubscribed from the email list."}, {"8a7d": "Even ignoring the fact that racists come in shades of red and blue, a distaste for bigotry should not translate into a belief that the political system shouldn’t respect the humanity of all citizens. The spate of hot takes and tweets celebrating Trump voters who may lose their health care or their husbands to deportation suggest a troubling indifference to suffering which, notably, was echoed in the complaints many Trump voters had about Democrats around the time of the election, as well as in accounts by Sarah Smarsh and other writers who have reflected on liberal elitism from the perspective of the country’s interior. Famously, to Clinton, these people were “deplorables”: a word that reads as a shakable insult in adjective form, but an immutable characteristic when made into a noun. Like the word “untouchable,” it is too essentializing to co-exist comfortably alongside the American dream. Consider what it would mean for the president of the United States to be entrusted with the lives of citizens whom she considers “irredeemable.” What helpful policy interventions can a poor white racist expect from a president believes they are beyond hope? Why should a former Obama voter consider a progressive agenda if the left continues to echo these sentiments?"}, {"b2eb": "Liberals are quite able to understand that Mike Brown did not deserve to be murdered regardless of whether he stole cigarillos, even if he did start an altercation with the cops, even if he were a drug user or somehow not “blameless” in the eyes of society. We understand that black and brown people who disproportionately fill America’s jails are largely products of their environments: bad schools, lack of job opportunity, crime-filled, segregated neighborhoods created through racist government programs. But sympathy for poor whites is anathema."}, {"dc2b": "Now, I completely understand those who are frustrated that sympathy seems to find struggling whites more easily than those with black and brown skin. I’m frustrated by that too. Maddened by it. But ignoring anyone’s humanity is dangerous — both politically and ethically. Republicans have spent millions of dollars (and dozens of years) creating a fictive causal relationship between the negative fates of poor whites and the existence of people of color. It is in our interest to undo that damage rather than aid conservative recruitment efforts by advertising an indifference that goes against progressive values."}, {"c5d6": "Should we play a smaller violin for poor whites? Yes. We should not care more about them than other, more vulnerable and worse-off populations, and we should remain vigilant against the risk that the marginalized could be pushed entirely off the page. After all, Black Lives Matter. But the irony is that the class-based coalition Sanders is assembling can demand more than the crumbs of tokenism and PC language people of color have settled for — stuck between the scylla and charybdis of the two-party system. This is something Martin Luther King Jr. understood, and it is a dream we should continue to pursue."}, {"124c": "This is why leading with economic justice is so important. Identity politics has convinced many that white folks are the enemy, as though it is race, rather than power, that corrupts absolutely. It tricks us into caring more about the gender of our politicians than their record on abortion rights. It convinces us that poor white people are the enemy even when their interests are largely (though not completely) aligned with poor people of color. And it seduces us into using language that appears to exclude poor whites from the uplift and benefit they would receive as a result of Democratic social programs."}, {"672a": "It’s time to stop acting like a more inclusive rhetorical strategy requires a policy prescription that diminishes the marginalized. This needn’t be a zero sum game."}, {"db55": "So next time Sanders appeals to whites, applaud him. Because if you had paid more attention to him (and polls) back in March of last year, we wouldn’t even be in this mess to begin with."}, {"d7db": "#berniewouldhavewon"}], "child": "954_1\t954_2\t954_3\t954_4"}