{"name": "955", "parent": "", "content": "Still Not A Bro, Still Not A Russian Agent, Still Glad Hillary Lost You can’t always tell how crazy someone is at first glance. When everything’s going their way and nothing psychologically abrasive is pressing up against the demons in their mind, even the most psychotic rageaholic can seem pretty normal to the casual observer. It’s not until the guy cuts them off in traffic, the lady at the checkout counter is a little too slow, or their spouse makes a tiny mistake that the mask comes off and you get a true taste for how bat shit insane they really are. This is what is happening with Democrats in America today. My handful of conservative readers will disagree with what I’m about to say, but to a hard-left Australian looking at America from the outside Democrats have seemed relatively sane, at least compared to the Republicans. I mean sure they consented to the crushing exploitation of the Walmart economy and tolerated Obama’s expansion of all of Bush’s most evil policies, but at least they were pretty mellow about it. They were chill during the Obama years and opposed the neocons during the Bush years, so the gibbering, drooling, screaming-Bible-verses-at-passing-cars psychosis that lurked just below the surface never had occasion to come to the foreground. All that changed with Trump’s election. Though the Clinton campaign deliberately elevated the phenomenally unpopular reality TV star above his primary Republican opponents, his stated agendas conflicted with those of America’s unelected power structures in some very significant ways and they were never going to let him actually win the White House. But then he actually won the White House. After more than a year of using their corporate media mouthpieces to pummel the psyche of liberal Democrats with horror stories of what would happen if Trump got in, Trump got in. The American public’s unprecedented ability to network and share information combined with WikiLeaks drops and a surging alternative media to cripple the campaign of the establishment candidate and caused the deep state to lose control of the narrative for the first time in its existence. It was like watching a glass plate shatter in slow motion. After more than a year of being told the world would end if Trump got in, Trump got in. After more than a year of being told Trump couldn’t win, Trump won. Democrats stood stupefied for a moment like a little kid who just got hit with a ball but hasn’t started crying yet… and then all the crazy came pouring right out into the open. It was Comey’s fault. No, it was Bernie’s fault. No, it was third parties. Wait, no, it was Russia. Yeah, that’s it! Russia. Russia, Russia, Russia Russia Russia. Everyone who says we’re acting crazy right now is a Russian agent. Isn’t the CIA awesome? Gosh I love the CIA. Also Dick Cheney and John McCain, they’re great too. Know who I hate though? Russia. Did you know Russian bots convinced Sanders supporters to hate Hillary Clinton? Also, any Sanders supporters you saw criticizing Hillary were actually Russian bots disguising as Bernie Bros. Basically Hillary was perfect and the DNC scandal never happened. If you think you hated Hillary you imagined it. Have I mentioned I hate Russia? They committed an act of war against us, you know. War war war war war war war. I like war now. Not Russia though. Have I mentioned I hate Russia? Sheer yammering lunacy. It’s like the lifetime’s worth of consent-manufacturing establishment media propaganda they’d been spoon-fed since birth suddenly started making them sick, like when you eat a few too many marshmallows or jello shots and it starts coming out the way it came in. All the psychological abuse America’s rank-and-file political left have been suffering at the hands of the oligarchy is now spewing out in a jumbled hot mess of gibberish and McCarthyism, and they don’t know how to make it stop. Well you can make it stop, Democrats. What you are doing looks intensely psychologically uncomfortable, and you cannot possibly be enjoying yourselves. So stop. It’s easy: all you have to do is realize that you’ve been lied to your entire life by everyone you respect and admire. Okay, so maybe that’s not necessarily easy, but it is simple and straightforward. Everyone on television has been lying to you. Every mainstream media outlet has been lying to you. Everyone you know who consumes these forms of media and believes them has been lying to you by regurgitating the lies they were fed. The fact that you even for a second considered Hillary Rodham Clinton to be an acceptable candidate proves this. Did you know that Hillary Clinton campaigned on a promise to install a no-fly zone in Syria, which top military officials attested would necessitate a war with both Syria and Russia? No? Did Rachel Maddow and the Washington Post not make you aware of that indisputably true, critically-important, world-threatening fact? Guess what? That’s because they’re liars. They lie to you. Constantly. As bad as Trump is, nothing he has done is anywhere remotely close to as horrible as a war with a nuclear superpower and its allies. All the horror stories you were told about this man pale in comparison to the horror stories they were deliberately omitting from their coverage of the candidate they were attempting to inflict upon this planet. Trump could tank the economy, stop all immigration, build a wall around the entire continental United States and be featured in a viral video getting urinated on by Vladimir Putin himself, and as long as he spared America from a world war with a nuclear superpower, he would still have been a better president than Hillary Clinton would have been. The further into conflict two nuclear superpowers get, the greater the likelihood of a nuclear warhead being deployed either by accident, on purpose, or some mixture of the two due to unforeseeable circumstances in the unpredictable chaos of war, and once one nuke gets deployed, they all do. If you can shake off the mental bondage to the false reality you’ve been coaxed into by the corporate media of a corporatist government, all that psychological discomfort you’ve been experiencing will fall away. You know you’re not enjoying this. You know all this war talk is getting scary. You know Dick Cheney is not really your friend. I’m not a Russian agent telling you this. I’m not a sexist Bernie Bro. I’m nothing special, just someone who stopped believing the lies. You can do this too. I stand nothing to gain from lying to you, but the plutocrats who own your government and your media certainly do. Stop trusting these monsters. Stop believing the lies. — - Thanks for reading! If you enjoyed this, please consider helping me out by sharing it around, liking me on Facebook, following me on Twitter, or even tossing me some money on Patreon so I can keep this gig up. ", "title": "Still Not A Bro, Still Not A Russian Agent, Still Glad Hillary Lost", "sentences": [{"e263": "Still Not A Bro, Still Not A Russian Agent, Still Glad Hillary Lost"}, {"8b77": "You can’t always tell how crazy someone is at first glance. When everything’s going their way and nothing psychologically abrasive is pressing up against the demons in their mind, even the most psychotic rageaholic can seem pretty normal to the casual observer. It’s not until the guy cuts them off in traffic, the lady at the checkout counter is a little too slow, or their spouse makes a tiny mistake that the mask comes off and you get a true taste for how bat shit insane they really are."}, {"6e50": "This is what is happening with Democrats in America today. My handful of conservative readers will disagree with what I’m about to say, but to a hard-left Australian looking at America from the outside Democrats have seemed relatively sane, at least compared to the Republicans. I mean sure they consented to the crushing exploitation of the Walmart economy and tolerated Obama’s expansion of all of Bush’s most evil policies, but at least they were pretty mellow about it. They were chill during the Obama years and opposed the neocons during the Bush years, so the gibbering, drooling, screaming-Bible-verses-at-passing-cars psychosis that lurked just below the surface never had occasion to come to the foreground."}, {"7cde": "All that changed with Trump’s election. Though the Clinton campaign deliberately elevated the phenomenally unpopular reality TV star above his primary Republican opponents, his stated agendas conflicted with those of America’s unelected power structures in some very significant ways and they were never going to let him actually win the White House. But then he actually won the White House. After more than a year of using their corporate media mouthpieces to pummel the psyche of liberal Democrats with horror stories of what would happen if Trump got in, Trump got in. The American public’s unprecedented ability to network and share information combined with WikiLeaks drops and a surging alternative media to cripple the campaign of the establishment candidate and caused the deep state to lose control of the narrative for the first time in its existence."}, {"7df6": "It was like watching a glass plate shatter in slow motion. After more than a year of being told the world would end if Trump got in, Trump got in. After more than a year of being told Trump couldn’t win, Trump won. Democrats stood stupefied for a moment like a little kid who just got hit with a ball but hasn’t started crying yet… and then all the crazy came pouring right out into the open."}, {"7667": "It was Comey’s fault. No, it was Bernie’s fault. No, it was third parties. Wait, no, it was Russia. Yeah, that’s it! Russia. Russia, Russia, Russia Russia Russia. Everyone who says we’re acting crazy right now is a Russian agent. Isn’t the CIA awesome? Gosh I love the CIA. Also Dick Cheney and John McCain, they’re great too. Know who I hate though? Russia. Did you know Russian bots convinced Sanders supporters to hate Hillary Clinton? Also, any Sanders supporters you saw criticizing Hillary were actually Russian bots disguising as Bernie Bros. Basically Hillary was perfect and the DNC scandal never happened. If you think you hated Hillary you imagined it. Have I mentioned I hate Russia? They committed an act of war against us, you know. War war war war war war war. I like war now. Not Russia though. Have I mentioned I hate Russia?"}, {"dcae": "Sheer yammering lunacy. It’s like the lifetime’s worth of consent-manufacturing establishment media propaganda they’d been spoon-fed since birth suddenly started making them sick, like when you eat a few too many marshmallows or jello shots and it starts coming out the way it came in. All the psychological abuse America’s rank-and-file political left have been suffering at the hands of the oligarchy is now spewing out in a jumbled hot mess of gibberish and McCarthyism, and they don’t know how to make it stop."}, {"16b2": "Well you can make it stop, Democrats. What you are doing looks intensely psychologically uncomfortable, and you cannot possibly be enjoying yourselves. So stop. It’s easy: all you have to do is realize that you’ve been lied to your entire life by everyone you respect and admire. Okay, so maybe that’s not necessarily easy, but it is simple and straightforward."}, {"5588": "Everyone on television has been lying to you. Every mainstream media outlet has been lying to you. Everyone you know who consumes these forms of media and believes them has been lying to you by regurgitating the lies they were fed. The fact that you even for a second considered Hillary Rodham Clinton to be an acceptable candidate proves this. Did you know that Hillary Clinton campaigned on a promise to install a no-fly zone in Syria, which top military officials attested would necessitate a war with both Syria and Russia? No? Did Rachel Maddow and the Washington Post not make you aware of that indisputably true, critically-important, world-threatening fact? Guess what? That’s because they’re liars. They lie to you. Constantly."}, {"e930": "As bad as Trump is, nothing he has done is anywhere remotely close to as horrible as a war with a nuclear superpower and its allies. All the horror stories you were told about this man pale in comparison to the horror stories they were deliberately omitting from their coverage of the candidate they were attempting to inflict upon this planet. Trump could tank the economy, stop all immigration, build a wall around the entire continental United States and be featured in a viral video getting urinated on by Vladimir Putin himself, and as long as he spared America from a world war with a nuclear superpower, he would still have been a better president than Hillary Clinton would have been. The further into conflict two nuclear superpowers get, the greater the likelihood of a nuclear warhead being deployed either by accident, on purpose, or some mixture of the two due to unforeseeable circumstances in the unpredictable chaos of war, and once one nuke gets deployed, they all do."}, {"0b63": "If you can shake off the mental bondage to the false reality you’ve been coaxed into by the corporate media of a corporatist government, all that psychological discomfort you’ve been experiencing will fall away. You know you’re not enjoying this. You know all this war talk is getting scary. You know Dick Cheney is not really your friend. I’m not a Russian agent telling you this. I’m not a sexist Bernie Bro. I’m nothing special, just someone who stopped believing the lies. You can do this too. I stand nothing to gain from lying to you, but the plutocrats who own your government and your media certainly do. Stop trusting these monsters. Stop believing the lies."}, {"ba33": "— -"}, {"8a41": "Thanks for reading! If you enjoyed this, please consider helping me out by sharing it around, liking me on Facebook, following me on Twitter, or even tossing me some money on Patreon so I can keep this gig up."}], "child": "955_1\t955_2\t955_3\t955_4\t955_5\t955_6\t955_7\t955_8\t955_9\t955_10\t955_11\t955_12\t955_13\t955_14\t955_15\t955_16\t955_17\t955_18\t955_19\t955_20\t955_21\t955_22\t955_23\t955_24\t955_25"}