{"name": "957", "parent": "", "content": "I’ve Already Marched I will not march. I will remember all the times you refused to march with me. I will remember all the long, lonely nights that I marched alone. I will remember all of those I marched with, long before you decided to arrive. I will remember all those I marched for, long before you decided to acknowledge them. I will remember marching away from my school, my home, my family, my entire lifestyle, into a vast unknown that challenged every aspect of my being, marching toward what I believed in. I will remember you saying marching was too far out of your comfort zone. I will remember the many hours I marched, through parking lots, grocery stores, campuses, parks, hot summer events, and downtown streets, registering every person I found. I will remember the many miles I marched, door to door, pleading with people to march themselves to the polls. I will remember you were too busy, it was too rainy, too hot, too cold, for you to march with me. I will remember marching through neighborhoods of people depending on the Affordable Care Act, Planned Parenthood, and the Supplemental Nutrition Assistance Program. I will remember you were too “uncomfortable” there to march with me. I will remember dreaming of a women’s march on January 20th, with one woman who told the world women’s rights are human rights before you claimed it as your truth. I will remember you insisting she was too flawed, too stuffy, and too off putting to march for. I will remember marching against a man who spoke approvingly of sexual assault. I will remember you deciding, on your moral high ground, you could not march for someone who messed up her emails. I will remember pleading with you, begging you, imploring you to march with me because our outcome was not certain. I will remember you saying Nate Silver told you marching was unnecessary. I will remember asking you to march. I will remember you did not. I will not march with you, I’ve already marched. ", "title": "I’ve Already Marched", "sentences": [{"7a7a": "I’ve Already Marched"}, {"678e": "I will not march."}, {"a55e": "I will remember all the times you refused to march with me."}, {"e793": "I will remember all the long, lonely nights that I marched alone."}, {"6501": "I will remember all of those I marched with, long before you decided to arrive."}, {"09ee": "I will remember all those I marched for, long before you decided to acknowledge them."}, {"dcce": "I will remember marching away from my school, my home, my family, my entire lifestyle, into a vast unknown that challenged every aspect of my being, marching toward what I believed in."}, {"0fff": "I will remember you saying marching was too far out of your comfort zone."}, {"6a9f": "I will remember the many hours I marched, through parking lots, grocery stores, campuses, parks, hot summer events, and downtown streets, registering every person I found."}, {"508a": "I will remember the many miles I marched, door to door, pleading with people to march themselves to the polls."}, {"3038": "I will remember you were too busy, it was too rainy, too hot, too cold, for you to march with me."}, {"3a42": "I will remember marching through neighborhoods of people depending on the Affordable Care Act, Planned Parenthood, and the Supplemental Nutrition Assistance Program."}, {"ff25": "I will remember you were too “uncomfortable” there to march with me."}, {"2256": "I will remember dreaming of a women’s march on January 20th, with one woman who told the world women’s rights are human rights before you claimed it as your truth."}, {"541c": "I will remember you insisting she was too flawed, too stuffy, and too off putting to march for."}, {"6d8b": "I will remember marching against a man who spoke approvingly of sexual assault."}, {"a0e3": "I will remember you deciding, on your moral high ground, you could not march for someone who messed up her emails."}, {"a3c8": "I will remember pleading with you, begging you, imploring you to march with me because our outcome was not certain."}, {"eefc": "I will remember you saying Nate Silver told you marching was unnecessary."}, {"3300": "I will remember asking you to march."}, {"5142": "I will remember you did not."}, {"3c8c": "I will not march with you, I’ve already marched."}], "child": "957_1\t957_2\t957_3\t957_4\t957_5\t957_6\t957_7\t957_8\t957_9\t957_10\t957_11\t957_12\t957_13\t957_14\t957_15\t957_16\t957_17\t957_18\t957_19\t957_20\t957_21\t957_22\t957_23\t957_24\t957_25"}