{"name": "959", "parent": "", "content": "I Agree With Hugh Hewitt, For Many Reluctant Trump Voters It Came Down To The Supreme Court For many Republican-leaning Christians I know the choice of Mr. Trump versus Mrs. Clinton last November represented a steep moral decline no matter the victor. Whether or not they supported him politically, most voters of faith I know felt comfortable with the Obamas as a wholesome representation of American family life writ large. I think for obvious reasons the public morality of both Trump and Clinton was deemed lax or lacking by these voters. With that in mind the thought of the Clintons back in the White House, coupled with the possibility of maintaining a conservative in the Scalia seat proved too powerful a draw for 4 out of 5 evangelicals. If the balance of the Supreme Court was not basically on the ballot, perhaps Mrs. Clinton could have narrowed that 60 point gap substantially. ", "title": "I Agree With Hugh Hewitt, For Many Reluctant Trump Voters It Came Down To The Supreme Court", "sentences": [{"446c": "I Agree With Hugh Hewitt, For Many Reluctant Trump Voters It Came Down To The Supreme Court"}, {"4068": "For many Republican-leaning Christians I know the choice of Mr. Trump versus Mrs. Clinton last November represented a steep moral decline no matter the victor. Whether or not they supported him politically, most voters of faith I know felt comfortable with the Obamas as a wholesome representation of American family life writ large. I think for obvious reasons the public morality of both Trump and Clinton was deemed lax or lacking by these voters. With that in mind the thought of the Clintons back in the White House, coupled with the possibility of maintaining a conservative in the Scalia seat proved too powerful a draw for 4 out of 5 evangelicals. If the balance of the Supreme Court was not basically on the ballot, perhaps Mrs. Clinton could have narrowed that 60 point gap substantially."}], "child": "959_1"}