{"name": "960", "parent": "", "content": "The Miracle of Trump: Why Did Evangelicals Deliver the Votes for a Sinner? A lot of people prefer to think in terms of miracles rather than contemplating the boots-on-the-ground work of incremental social change. By James McWilliams Eighty-one percent of evangelicals voted for Donald Trump. In a sense, the choice isn’t surprising. Trump’s nominee to the Supreme Court, Neil Gorsuch, is unambiguously pro-life, and Trump’s promise to “destroy” the Johnson Amendment — a provision in the tax code barring non-profits from political participation — closely follows the evangelical playbook. But in another way, Christian support for Trump is puzzling. Trump’s Christian bona fides are (at best) shaky and his personal demeanor, marked by swashbuckling moral indecency, contradicts the evangelical temperament. Evangelicals made these concerns widely known during the campaign. The Atlantic noted how the Trump vote “concealed deep, painful fractures.” Still, for all the angst over electing a moral reprobate, the evangelicals delivered. Why? One explanation is pragmatic: The ends (desired political outcomes) justified the means (Trump’s ethically offensive personal demeanor). Ingrained Sexism Helps Explain Why Evangelicals Support TrumpNew research finds evangelical Protestants — especially Republicans — are highly biased against female political…psmag.com But to stop with this explanation would be to overlook a deeper and less tangible motivation. Remember: Evangelicals — and Christians in general — elected a man who has systematically and blatantly denigrated women, suggested that he’d date his daughter were she not his daughter, proclaimed “you can never be too greedy,” mocked a disabled reporter, characterized Mexicans as rapists and criminals, and bragged that “the beauty of me is that I’m very rich.” None of this is especially Christ-like. Ends-means pragmatism can only take us so far. To better understand the evangelical mindset, I contacted Jon Bialecki, honorary fellow with the School of Social and Political Sciences at the University of Edinburgh, and the author of the forthcoming A Diagram for Fire: Miracles and Variation in an American Charismatic Movement. Bialecki spent three years doing an ethnographic study on members of the Vineyard, an American evangelical movement that started in Southern California in 1975 and has since become a global religious movement (with over 1,500 churches). During his fieldwork, Bialecki attended Vineyard services, recorded and studied sermons, conversed daily with church members, visited prayer groups, observed and analyzed rituals (which often included casting out demons or being healed), and interviewed church leaders. He studied several Vineyard chapters, but eventually settled on one, a Southern California congregation whose leaders welcomed him into its inner sanctum. Vineyard members, as with many charismatic Christians, “are part of an evangelical Left concerned with combating racism and anti-immigrant sentiments, criticizing American military overreach, and exposing the deleterious effects of unhampered capitalism.” One might expect a congregation of evangelicals to be universally politically conservative. But, much to Bialecki’s surprise, this was not entirely the case with his subjects. He writes that some Vineyard members, as with many charismatic Christians, “are part of an evangelical Left concerned with combating racism and anti-immigrant sentiments, criticizing American military overreach, and exposing the deleterious effects of unhampered capitalism.” Many members “have even argued for a more open and affirming attitude toward gay, lesbian, and transgender people.” These opinions did not always resonate well with the Vineyard establishment. Internal arguments sometimes ensued. But the fact remains that genuine political diversity — at least in terms of different opinions over specific issues — prevailed within the Vineyard community. For all the diversity of opinion within Vineyard churches, members of the “evangelical Left” didn’t necessarily represent that diversity at the polls. While some obviously voted for Hillary Clinton, third-party candidates, or abstained from voting, many pressed the button for Trump despite the fact that his platform and policies ran counter to their political opinions. On the surface, this disparity makes little sense. Why would people vote against their interests? Or could it be that we have misunderstood what is meant by “interests”? Bialecki thinks the latter. One of his central discoveries was that the evangelical mindset, whatever its political suasion, craves something beyond policy prescriptions to political change: it craves a miracle. In an email, he explains: I was surprised how “left” or “progressive” many of these Vineyard believers were. But when they talked about political action, they kept on talking about “big things” where someone would change their mind, or where some unjust institution would fall away. In short, the surprising nature of the turn was what allowed them to understand politics as being “of God” and not “of Man” or “the flesh.” It seems that what mattered politically was less the platform than the miraculous implications in its delivery. To a non-evangelical person, this distinction will likely seem inane, but, as Bialecki further elaborates the idea, “the progressive wing of the Vineyard, instead of calling for incremental social activism through coalition politics, is drawn toward hopeful anticipation of large transformative events.” Such a “politics of the miraculous” taps into a spiritualized disposition that not only favors the “logic of surprise,” but it’s a logic of surprise that “hampers the capacity to work through the usual institutions.” Bialecki believes this quest for the miraculous is not necessarily limited to his Vineyard members. A lot of Christians — and I suppose some non-Christians — prefer to think in terms of miracles rather than contemplating the boots-on-the-ground work of incremental social change, at least enough to shape their choice at the polls. Bialecki developed his argument well before the rise of Trump. But when I ask him to relate his research to the election of 2016, he explains: On the day after the election, Franklin Graham, the son of Billy Graham, posted on Facebook to explain why he felt that the “secular media” didn’t see [Trump] coming. The secular media, he said, was “shocked.” This, Graham said, was because they didn’t understand “the God-factor.” He explained that, all over America, Christians were praying, and that, when they went to the polls, “God showed up.” Bialecki adds: There are two things that have to be highlighted here: first, this was counter to the usual order of things. Stuff like Trump’s election does not happen, and was even unimaginable by the secular media. This was, in other words, a surprise. The second thing to highlight was that the election was not framed as, say, a group of people reclaiming power after having been marginalized (which is one of many other ways that Graham could have presented it). It was presented as God showing up. And he had weird hair, a fake tan, and small hands. In 1964, the historian Richard Hofstadter published The Paranoid Style of American Politics. In it, he argued that American political activity was driven by paranoia-like fear of unknown corporate, intellectual, and religious conspiracies. Perhaps today, as the most recent reminder that American voters of all political persuasions do not necessarily vote their interests in the way we might expect them to, we should acknowledge the miraculous style of American politics. Trump, after all, is, according to Bialecki, “a break with the natural order of things.” He demands, in turn, “an unusual causal account.” ", "title": "The Miracle of Trump: Why Did Evangelicals Deliver the Votes for a Sinner?", "sentences": [{"a71a": "The Miracle of Trump: Why Did Evangelicals Deliver the Votes for a Sinner?"}, {"cfa7": "A lot of people prefer to think in terms of miracles rather than contemplating the boots-on-the-ground work of incremental social change."}, {"8cf4": "By James McWilliams"}, {"dba2": "Eighty-one percent of evangelicals voted for Donald Trump. In a sense, the choice isn’t surprising. Trump’s nominee to the Supreme Court, Neil Gorsuch, is unambiguously pro-life, and Trump’s promise to “destroy” the Johnson Amendment — a provision in the tax code barring non-profits from political participation — closely follows the evangelical playbook."}, {"e00c": "But in another way, Christian support for Trump is puzzling. Trump’s Christian bona fides are (at best) shaky and his personal demeanor, marked by swashbuckling moral indecency, contradicts the evangelical temperament. Evangelicals made these concerns widely known during the campaign. The Atlantic noted how the Trump vote “concealed deep, painful fractures.”"}, {"4c14": "Still, for all the angst over electing a moral reprobate, the evangelicals delivered. Why? One explanation is pragmatic: The ends (desired political outcomes) justified the means (Trump’s ethically offensive personal demeanor)."}, {"936b": "Ingrained Sexism Helps Explain Why Evangelicals Support TrumpNew research finds evangelical Protestants — especially Republicans — are highly biased against female political…psmag.com"}, {"ebbc": "But to stop with this explanation would be to overlook a deeper and less tangible motivation. Remember: Evangelicals — and Christians in general — elected a man who has systematically and blatantly denigrated women, suggested that he’d date his daughter were she not his daughter, proclaimed “you can never be too greedy,” mocked a disabled reporter, characterized Mexicans as rapists and criminals, and bragged that “the beauty of me is that I’m very rich.” None of this is especially Christ-like. Ends-means pragmatism can only take us so far."}, {"d684": "To better understand the evangelical mindset, I contacted Jon Bialecki, honorary fellow with the School of Social and Political Sciences at the University of Edinburgh, and the author of the forthcoming A Diagram for Fire: Miracles and Variation in an American Charismatic Movement. Bialecki spent three years doing an ethnographic study on members of the Vineyard, an American evangelical movement that started in Southern California in 1975 and has since become a global religious movement (with over 1,500 churches)."}, {"a51d": "During his fieldwork, Bialecki attended Vineyard services, recorded and studied sermons, conversed daily with church members, visited prayer groups, observed and analyzed rituals (which often included casting out demons or being healed), and interviewed church leaders. He studied several Vineyard chapters, but eventually settled on one, a Southern California congregation whose leaders welcomed him into its inner sanctum."}, {"3d83": "Vineyard members, as with many charismatic Christians, “are part of an evangelical Left concerned with combating racism and anti-immigrant sentiments, criticizing American military overreach, and exposing the deleterious effects of unhampered capitalism.”"}, {"9a74": "One might expect a congregation of evangelicals to be universally politically conservative. But, much to Bialecki’s surprise, this was not entirely the case with his subjects. He writes that some Vineyard members, as with many charismatic Christians, “are part of an evangelical Left concerned with combating racism and anti-immigrant sentiments, criticizing American military overreach, and exposing the deleterious effects of unhampered capitalism.” Many members “have even argued for a more open and affirming attitude toward gay, lesbian, and transgender people.”"}, {"1f38": "These opinions did not always resonate well with the Vineyard establishment. Internal arguments sometimes ensued. But the fact remains that genuine political diversity — at least in terms of different opinions over specific issues — prevailed within the Vineyard community."}, {"8451": "For all the diversity of opinion within Vineyard churches, members of the “evangelical Left” didn’t necessarily represent that diversity at the polls. While some obviously voted for Hillary Clinton, third-party candidates, or abstained from voting, many pressed the button for Trump despite the fact that his platform and policies ran counter to their political opinions."}, {"da97": "On the surface, this disparity makes little sense. Why would people vote against their interests? Or could it be that we have misunderstood what is meant by “interests”? Bialecki thinks the latter. One of his central discoveries was that the evangelical mindset, whatever its political suasion, craves something beyond policy prescriptions to political change: it craves a miracle. In an email, he explains:"}, {"ac43": "I was surprised how “left” or “progressive” many of these Vineyard believers were. But when they talked about political action, they kept on talking about “big things” where someone would change their mind, or where some unjust institution would fall away. In short, the surprising nature of the turn was what allowed them to understand politics as being “of God” and not “of Man” or “the flesh.”"}, {"7788": "It seems that what mattered politically was less the platform than the miraculous implications in its delivery. To a non-evangelical person, this distinction will likely seem inane, but, as Bialecki further elaborates the idea, “the progressive wing of the Vineyard, instead of calling for incremental social activism through coalition politics, is drawn toward hopeful anticipation of large transformative events.” Such a “politics of the miraculous” taps into a spiritualized disposition that not only favors the “logic of surprise,” but it’s a logic of surprise that “hampers the capacity to work through the usual institutions.”"}, {"3ba2": "Bialecki believes this quest for the miraculous is not necessarily limited to his Vineyard members. A lot of Christians — and I suppose some non-Christians — prefer to think in terms of miracles rather than contemplating the boots-on-the-ground work of incremental social change, at least enough to shape their choice at the polls."}, {"2b28": "Bialecki developed his argument well before the rise of Trump. But when I ask him to relate his research to the election of 2016, he explains:"}, {"5885": "On the day after the election, Franklin Graham, the son of Billy Graham, posted on Facebook to explain why he felt that the “secular media” didn’t see [Trump] coming. The secular media, he said, was “shocked.” This, Graham said, was because they didn’t understand “the God-factor.” He explained that, all over America, Christians were praying, and that, when they went to the polls, “God showed up.”"}, {"fd2d": "Bialecki adds:"}, {"36e1": "There are two things that have to be highlighted here: first, this was counter to the usual order of things. Stuff like Trump’s election does not happen, and was even unimaginable by the secular media. This was, in other words, a surprise. The second thing to highlight was that the election was not framed as, say, a group of people reclaiming power after having been marginalized (which is one of many other ways that Graham could have presented it). It was presented as God showing up."}, {"b49d": "And he had weird hair, a fake tan, and small hands."}, {"26f4": "In 1964, the historian Richard Hofstadter published The Paranoid Style of American Politics. In it, he argued that American political activity was driven by paranoia-like fear of unknown corporate, intellectual, and religious conspiracies. Perhaps today, as the most recent reminder that American voters of all political persuasions do not necessarily vote their interests in the way we might expect them to, we should acknowledge the miraculous style of American politics. Trump, after all, is, according to Bialecki, “a break with the natural order of things.” He demands, in turn, “an unusual causal account.”"}], "child": "960_1\t960_2\t960_3\t960_4\t960_5\t960_6\t960_7\t960_8"}