{"name": "961", "parent": "", "content": "Rufus Gifford: “The Politicisation of the Judiciary is the Biggest Challenge facing the US Today” The last 26 days in US politics RUFUS GIFFORD, former US Ambassador to Denmark, discussed the way forward for the US in a Politiken Live event last week, on Vestergade, just off Rådhuspladsen, the Copenhagen main town hall square. Social Media In tune with the Obama administration’s embracing of social media, Rufus (He is on first-name terms with the Danish people) is active on both Twitter and Instagram: Rufus Gifford (@rufusgifford) | TwitterThe latest Tweets from Rufus Gifford (@rufusgifford). Former Ambassador, 10 year Obama alum, eternal optimist, Viking…twitter.com Rufus Gifford (@rufusgifford) * Instagram photos and videos55.9k Followers, 401 Following, 825 Posts - See Instagram photos and videos from Rufus Gifford (@rufusgifford)www.instagram.com “John Rufus Gifford is an American diplomat. He served as the United States Ambassador to Denmark from 2013 to 2017, and was the Finance Director for Barack Obama’s presidential re-election campaign in 2012.” -no longer offically hosted by dk.usembassy.gov. Hit TV Series Rufus is star of a hit reality TV show: Big in Denmark: The U.S. Ambassador\"Rufus Gifford is a rock star.\" Gifford's popularity is partly a function of his ubiquity: He rarely turns down an…www.theatlantic.com Right to Marry Who You Want Rufus and Stephen DeVincent married in Copenhagen in October 2015: Ambassador Rufus Gifford and Dr. Stephen DeVincent's Wedding in CopenhagenStephen was over at a friend's apartment when he met Rufus in passing. The two were introduced in the building's…www.vogue.com The Ambassador Rufus has often been perceived as Obama’s ambassador not just to Denmark but to the gay world itself. Political Meeting The open-to-the-public (special price for Politiken subscribers) meeting was hosted by Politiken, a left-leaning Danish national newspaper and was chaired by Marcus Rubin, editor of the Politiken “chronicle” section for reader op-eds: Marcus Rubin (@marcusrubin) | TwitterThe latest Tweets from Marcus Rubin (@marcusrubin). Middle East Correspondent for Danish Newspaper Politiken based in…twitter.com According to his Twitter profile, Marcus is Middle Eastern Correspondent for the Danish Newspaper Politiken (which hosted the event) and is based in Beirut. The Talk Rufus kicked off by listing the triumvirate that dominated the election: the courts, the media and the people thus echoing the three arms of government, the executive, the legislative and the judiciary. Rufus stated that it was fundamentally wrong for Trump not to seek to unify. Here’s a link to JFK’s moving inauguration speech that sought to do just that: “We observe today, not a victory of party, but a celebration of freedom.” The stepping down of National security advisor General Michael Flynn on Monday night was discussed, with Rufus suggesting that Flynn’s position was possibly even more significant that that of the vice-president. No coverage of this resignation would be complete without this delightfully-ironic clip of Flynn: and an extended version of the same clip tweeted by the one-and-only Sarah Kendzior: The Anti-Establishment Narrative Was Never Directed at Obama Rufus discussed the election, including the insurgent elements. He talked about the anti-establishment narrative and why it was never directed at Obama. He talked about Bernie Sanders and the unlikliehood that he would have been elected — compared to the same likliehood of Trump being elected, which at the time seemed to be nil for both. “Bernie must get out of the way of Democrats.” Rufus made it clear that the Democratic party had not imagined that Trump would win. He described how, the night after the election, he imagined waking up the next day and reasurring his female relatives that yes, a woman could become president; instead of which he stayed up all night seeing the results unfold. Rufus reiterated what he had mentioned in a tweet a few days before: The Democrats had not heeded the warning sounded from across the Atlantic by Brexit: Goodbye and Thanks for all the Grossly-Overpriced KippersGoodbye and Thanks for All the Overpriced KippersThank you Brexit for re-igniting my passion for politics with a…medium.com even though it was clear to some already then: Trump Will WinYou’re right.medium.com As Jon Stewart put it in a remarkably prescient interview with Nancy Pelosi, the democratic party underestimated the fury of the American people against the system of corruption in Washington. Not, as Pelosi argued, a good system with a few corrupt people but a corrupt system. As questions from the floor began, Rufus made an oblique reference to the anti-intellectualism and lack of deference by the new administration to employees of state agencies and semi-state bodies whose experience and expertise ought to be invaluable to them. Under the chairmanship of Marcus Rubin, Gifford covered many aspects of the post-election situation. He spoke about the last twenty-six days and about the ALT-Right. He intimated that the checks and balances are still in place and said that the ALT-right was not a doomsday cult. When asked about Trump’s strategy chief, he said, “Stephen Bannon has made his livliehood driving a wedge between different demographic groups.” There was also a great deal of discussion about the neccessity for Trump staying in place, that his extreme unpredictability and instability (3am tweets were mentioned several times) stood in contrast to the ultra-conservative and predictable Mike Pence, who according to Rufus, is similar to George W. Bush. Rufus was asked where he gets his news and he emphasized the importance of being broadly informed across the political spectrum. He mentioned the importance and the richness of the opportunity now facing The New York Times (NYT Opinion) and Washington Post. He also mentioned The Wall Street Journal (WSJ Graphics), VOX (VoxEurop) Slate and two individuals, Ezra Klein and Paul Krugman. West Virginia and Dukakis Rufus also spoke about the disillusionment of the American people with the current party structure and spoke about the volatility of, for example, West Virginia, a coal mining area which moved from being a win for the Democrat Dukakis (one of his few state wins) in 1988 to becoming a staunchly Republican state in subsequent elections. When asked if he could say anything good about Trump, he said that he didn’t buckle to political pressure and that he garnered respect for that. Wage War against Cynicism and Apathy As the evening drew to a close, Rufus urged people to move towards greater levels of activism and engagement in the political process. This was, in fact, his prime motivation for creating his reality TV series, according to CNN: “The original intent was how do you get people in their 20s to pay attention to what an ambassador does. Because they actually don’t care.” Kennedy Rufus mentioned his beginnings in the offices of Ted Kennedy, where he met Obama for the first time, when Obamacare was mentioned in a question from the floor: KennedycareWhy do they call it Obamacare? And why the perjorative tone?healthcareinamerica.us “Edward Kennedy was my hero”, Rufus said, when reminded of the heartfelt letter the sole-surviving Kennedy brother penned to Obama; “The great unfinished business of our society”: KennedycareSenator Edward Kennedy wrote this letter to President Obama:medium.com I asked Rufus what Comey was thinking of when he successfully diverted the election away from its course towards a near-certain Trump defeat in the closing days of the campaign: James Comey and the End of The Rule Of LawVote Hillary if only to ensure that James Comey gets fired.medium.com Rufus (wisely!) refused to be drawn. Closing Remarks In his typical self-deprecating manner, Rufus described himself in his previous life as the “pale sweating guy backstage” when asked about his political ambitions. Having not previously imagined himself as a political figure, he is now considering entering the political arena. Rufus’ infectious optimism is a delightful antidote to the ubiquitous fatalism surrounding us today. Rufus possesses the unusual ability to lift your spirits with his directness and the warmth of his personality. His genuine delight in this type of town-hall event is irresistible but his light-heartedness does not detract in the slightest from the seriousness of his core message which he articulates clearly and uncompromisingly and which is the title of this article: “Politicization of the judiciary is the biggest problem facing the US today” Thank you for reading this far. If you liked this, you might also like: How Trump’s Campaign Made Me Start Drawing Cartoons Againmelmagazine.com Hail The Anti-TrumpRufus Gifford shows immense grace, humility and style.medium.com Stop Calling it “Identity Politics,” it’s Civil Rightsmedium.com How to Talk to The Enemy: Beating Them At Their Own Gamemedium.com Careless Whisper and The End of The Status QuoRIP George Michael and Rick Parfitt.festivalpeak.com The Steadfast Tin SoldierOur favourite Hans Christian Andersen storiesmedium.com I’ll Never Be My Wife’s Equalmedium.com Qui Bone-oh?medium.com 🎼 Where have you gone, Barrack O-BamaPSEUDO-VICTORY of minority-elected trumP (PEEOTUS) represents the fury of the American people against a corrupt system.medium.com ", "title": "Rufus Gifford: “The Politicisation of the Judiciary is the Biggest Challenge facing the US Today”", "sentences": [{"c44f": "Rufus Gifford: “The Politicisation of the Judiciary is the Biggest Challenge facing the US Today”"}, {"7351": "The last 26 days in US politics"}, {"50d6": "RUFUS GIFFORD, former US Ambassador to Denmark, discussed the way forward for the US in a Politiken Live event last week, on Vestergade, just off Rådhuspladsen, the Copenhagen main town hall square."}, {"d320": "Social Media"}, {"3a30": "In tune with the Obama administration’s embracing of social media, Rufus (He is on first-name terms with the Danish people) is active on both Twitter and Instagram:"}, {"6f9a": "Rufus Gifford (@rufusgifford) | TwitterThe latest Tweets from Rufus Gifford (@rufusgifford). Former Ambassador, 10 year Obama alum, eternal optimist, Viking…twitter.com"}, {"1887": "Rufus Gifford (@rufusgifford) * Instagram photos and videos55.9k Followers, 401 Following, 825 Posts - See Instagram photos and videos from Rufus Gifford (@rufusgifford)www.instagram.com"}, {"ecac": "“John Rufus Gifford is an American diplomat. He served as the United States Ambassador to Denmark from 2013 to 2017, and was the Finance Director for Barack Obama’s presidential re-election campaign in 2012.”"}, {"1326": "-no longer offically hosted by dk.usembassy.gov."}, {"4783": "Hit TV Series"}, {"ed0c": "Rufus is star of a hit reality TV show:"}, {"5ad6": "Big in Denmark: The U.S. Ambassador\"Rufus Gifford is a rock star.\" Gifford's popularity is partly a function of his ubiquity: He rarely turns down an…www.theatlantic.com"}, {"47fc": "Right to Marry Who You Want"}, {"a79f": "Rufus and Stephen DeVincent married in Copenhagen in October 2015:"}, {"60ae": "Ambassador Rufus Gifford and Dr. Stephen DeVincent's Wedding in CopenhagenStephen was over at a friend's apartment when he met Rufus in passing. The two were introduced in the building's…www.vogue.com"}, {"8a5c": "The Ambassador"}, {"3f78": "Rufus has often been perceived as Obama’s ambassador not just to Denmark but to the gay world itself."}, {"b68a": "Political Meeting"}, {"f0ce": "The open-to-the-public (special price for Politiken subscribers) meeting was hosted by Politiken, a left-leaning Danish national newspaper and was chaired by Marcus Rubin, editor of the Politiken “chronicle” section for reader op-eds:"}, {"d28d": "Marcus Rubin (@marcusrubin) | TwitterThe latest Tweets from Marcus Rubin (@marcusrubin). Middle East Correspondent for Danish Newspaper Politiken based in…twitter.com"}, {"7469": "According to his Twitter profile, Marcus is Middle Eastern Correspondent for the Danish Newspaper Politiken (which hosted the event) and is based in Beirut."}, {"375a": "The Talk"}, {"7acc": "Rufus kicked off by listing the triumvirate that dominated the election: the courts, the media and the people thus echoing the three arms of government, the executive, the legislative and the judiciary."}, {"10fe": "Rufus stated that it was fundamentally wrong for Trump not to seek to unify."}, {"d3c0": "Here’s a link to JFK’s moving inauguration speech that sought to do just that:"}, {"9fe4": "“We observe today, not a victory of party, but a celebration of freedom.”"}, {"ea5b": "The stepping down of National security advisor General Michael Flynn on Monday night was discussed, with Rufus suggesting that Flynn’s position was possibly even more significant that that of the vice-president."}, {"4b0f": "No coverage of this resignation would be complete without this delightfully-ironic clip of Flynn:"}, {"ea4f": "and an extended version of the same clip tweeted by the one-and-only Sarah Kendzior:"}, {"2005": "The Anti-Establishment Narrative Was Never Directed at Obama"}, {"35e8": "Rufus discussed the election, including the insurgent elements. He talked about the anti-establishment narrative and why it was never directed at Obama. He talked about Bernie Sanders and the unlikliehood that he would have been elected — compared to the same likliehood of Trump being elected, which at the time seemed to be nil for both."}, {"20d5": "“Bernie must get out of the way of Democrats.”"}, {"db21": "Rufus made it clear that the Democratic party had not imagined that Trump would win. He described how, the night after the election, he imagined waking up the next day and reasurring his female relatives that yes, a woman could become president; instead of which he stayed up all night seeing the results unfold."}, {"38e4": "Rufus reiterated what he had mentioned in a tweet a few days before:"}, {"64ea": "The Democrats had not heeded the warning sounded from across the Atlantic by Brexit:"}, {"e7f3": "Goodbye and Thanks for all the Grossly-Overpriced KippersGoodbye and Thanks for All the Overpriced KippersThank you Brexit for re-igniting my passion for politics with a…medium.com"}, {"fb5f": "even though it was clear to some already then:"}, {"37ed": "Trump Will WinYou’re right.medium.com"}, {"316d": "As Jon Stewart put it in a remarkably prescient interview with Nancy Pelosi, the democratic party underestimated the fury of the American people against the system of corruption in Washington. Not, as Pelosi argued, a good system with a few corrupt people but a corrupt system."}, {"06e3": "As questions from the floor began, Rufus made an oblique reference to the anti-intellectualism and lack of deference by the new administration to employees of state agencies and semi-state bodies whose experience and expertise ought to be invaluable to them."}, {"75dd": "Under the chairmanship of Marcus Rubin, Gifford covered many aspects of the post-election situation. He spoke about the last twenty-six days and about the ALT-Right. He intimated that the checks and balances are still in place and said that the ALT-right was not a doomsday cult."}, {"f1ea": "When asked about Trump’s strategy chief, he said, “Stephen Bannon has made his livliehood driving a wedge between different demographic groups.”"}, {"e4d9": "There was also a great deal of discussion about the neccessity for Trump staying in place, that his extreme unpredictability and instability (3am tweets were mentioned several times) stood in contrast to the ultra-conservative and predictable Mike Pence, who according to Rufus, is similar to George W. Bush."}, {"1922": "Rufus was asked where he gets his news and he emphasized the importance of being broadly informed across the political spectrum. He mentioned the importance and the richness of the opportunity now facing The New York Times (NYT Opinion) and Washington Post. He also mentioned The Wall Street Journal (WSJ Graphics), VOX (VoxEurop) Slate and two individuals, Ezra Klein and Paul Krugman."}, {"abc0": "West Virginia and Dukakis"}, {"76fe": "Rufus also spoke about the disillusionment of the American people with the current party structure and spoke about the volatility of, for example, West Virginia, a coal mining area which moved from being a win for the Democrat Dukakis (one of his few state wins) in 1988 to becoming a staunchly Republican state in subsequent elections."}, {"f180": "When asked if he could say anything good about Trump, he said that he didn’t buckle to political pressure and that he garnered respect for that."}, {"9d3f": "Wage War against Cynicism and Apathy"}, {"4662": "As the evening drew to a close, Rufus urged people to move towards greater levels of activism and engagement in the political process. This was, in fact, his prime motivation for creating his reality TV series, according to CNN:"}, {"77a8": "“The original intent was how do you get people in their 20s to pay attention to what an ambassador does. Because they actually don’t care.”"}, {"3378": "Kennedy"}, {"e7f8": "Rufus mentioned his beginnings in the offices of Ted Kennedy, where he met Obama for the first time, when Obamacare was mentioned in a question from the floor:"}, {"8d77": "KennedycareWhy do they call it Obamacare? And why the perjorative tone?healthcareinamerica.us"}, {"6994": "“Edward Kennedy was my hero”, Rufus said, when reminded of the heartfelt letter the sole-surviving Kennedy brother penned to Obama;"}, {"57b0": "“The great unfinished business of our society”:"}, {"6a55": "KennedycareSenator Edward Kennedy wrote this letter to President Obama:medium.com"}, {"a08b": "I asked Rufus what Comey was thinking of when he successfully diverted the election away from its course towards a near-certain Trump defeat in the closing days of the campaign:"}, {"3cfc": "James Comey and the End of The Rule Of LawVote Hillary if only to ensure that James Comey gets fired.medium.com"}, {"0409": "Rufus (wisely!) refused to be drawn."}, {"7594": "Closing Remarks"}, {"5318": "In his typical self-deprecating manner, Rufus described himself in his previous life as the “pale sweating guy backstage” when asked about his political ambitions."}, {"39ca": "Having not previously imagined himself as a political figure, he is now considering entering the political arena."}, {"e930": "Rufus’ infectious optimism is a delightful antidote to the ubiquitous fatalism surrounding us today."}, {"eeae": "Rufus possesses the unusual ability to lift your spirits with his directness and the warmth of his personality."}, {"db6a": "His genuine delight in this type of town-hall event is irresistible but his light-heartedness does not detract in the slightest from the seriousness of his core message which he articulates clearly and uncompromisingly and which is the title of this article:"}, {"38f5": "“Politicization of the judiciary is the biggest problem facing the US today”"}, {"827d": "Thank you for reading this far. If you liked this, you might also like:"}, {"9167": "How Trump’s Campaign Made Me Start Drawing Cartoons Againmelmagazine.com"}, {"da08": "Hail The Anti-TrumpRufus Gifford shows immense grace, humility and style.medium.com"}, {"aae0": "Stop Calling it “Identity Politics,” it’s Civil Rightsmedium.com"}, {"f726": "How to Talk to The Enemy: Beating Them At Their Own Gamemedium.com"}, {"1843": "Careless Whisper and The End of The Status QuoRIP George Michael and Rick Parfitt.festivalpeak.com"}, {"7f99": "The Steadfast Tin SoldierOur favourite Hans Christian Andersen storiesmedium.com"}, {"5554": "I’ll Never Be My Wife’s Equalmedium.com"}, {"7049": "Qui Bone-oh?medium.com"}, {"e96d": "🎼 Where have you gone, Barrack O-BamaPSEUDO-VICTORY of minority-elected trumP (PEEOTUS) represents the fury of the American people against a corrupt system.medium.com"}], "child": "961_1\t961_2\t961_3961_1\t961_2\t961_3961_1\t961_2\t961_3961_1\t961_2\t961_3961_1\t961_2\t961_3"}