{"name": "963", "parent": "", "content": "Don’t Count America Out Sen. John McCain Addresses The Munich Security Conference (2/17/2017) My friends: In the four decades I have attended the Munich Security Conference, I cannot recall a year where its purpose was more necessary or more important. The next panel asks us to consider whether the West will survive. In recent years, this question would invite accusations of hyperbole and alarmism. Not this year. If ever there were a time to treat this question with a deadly seriousness, it is now. This question was real, half a century ago, for Ewald von Kleist and the founders of this conference. Indeed, it is why they first started coming to Munich. They did not assume the West would survive, because they had seen its near annihilation. They saw open markets give way to beggar-thy-neighbor protectionism, and the poverty that imposed. They saw a world order fracture into clashing ethnic and nationalist passions, and the misery that wrought. They saw the rise of hostile great powers, and the failure of deterrence, and the wars that followed. From the ashes of the most awful calamity in human history was born what we call the West — a new, and different, and better kind of world order … one based not on blood-and-soil nationalism, or spheres of influence, or conquest of the weak by the strong, but rather on universal values, rule of law, open commerce, and respect for national sovereignty and independence. Indeed, the entire idea of the West is that it open to any person or any nation that honors and upholds these values. The unprecedented period of security and prosperity that we have enjoyed for the past seven decades did not happen by accident. It happened not only because of the appeal of our values, but because we backed them with our power and persevered in their defense. Our predecessors did not believe in the end of history — or that it bends, inevitably, toward justice. That is up to us. That requires our persistent, painstaking effort. And that is why we come to Munich, year after year after year. What would von Kleist’s generation say if they saw our world today? I fear that much about it would be all-too-familiar to them, and they would be alarmed by it. They would be alarmed by an increasing turn away from universal values and toward old ties of blood, and race, and sectarianism. They would be alarmed by the hardening resentment we see toward immigrants, and refugees, and minority groups, especially Muslims. They would be alarmed by the growing inability, and even unwillingness, to separate truth from lies. They would be alarmed that more and more of our fellow citizens seem to be flirting with authoritarianism and romanticizing it as our moral equivalent. But what would alarm them most, I think, is a sense that many of our peoples, including in my own country, are giving up on the West … that they see it as a bad deal that we may be better off without … and that while Western nations still have the power to maintain our world order, it is unclear whether we have the will. All of us must accept our share of the blame for this turn of events. We grew complacent. We made mistakes. At times we tried to do too much, and at others we failed to do enough. We lost touch with many of our people. We have been too slow to recognize and respond to their hardships. We need to face up to these realities, but this does not mean losing hope and retreating. That we must not do. I know there is profound concern across Europe and the world that America is laying down the mantle of global leadership. I can only speak for myself, but I do not believe that is the message you will hear from all of the American leaders who cared enough to travel here to Munich this weekend. That is not the message you heard today from Secretary of Defense Jim Mattis. That is not the message you will hear from Vice President Mike Pence. That is not the message you will hear from Secretary of Homeland Security John Kelly. And that is certainly not the message you will hear tomorrow from our bipartisan congressional delegation. Make no mistake, my friends: These are dangerous times, but you should not count America out, and we should not count each other out. We must be prudent, but we cannot wring our hands and wallow in self-doubt. We must appreciate the limits of our power, but we cannot allow ourselves to question the rightness and goodness of the West. We must understand and learn from our mistakes, but we cannot be paralyzed by fear. We cannot give up on ourselves and on each other. That is the definition of decadence. And that is how world orders really do decline and fall. This is exactly what our adversaries want. This is their goal. They have no meaningful allies, so they seek to sow dissent among us and divide us from each other. They know that their power and influence are inferior to ours, so they seek to subvert us, and erode our resolve to resist, and terrorize us into passivity. They know they have little to offer the world beyond selfishness and fear, so they seek to undermine our confidence in ourselves and our belief in our own values. We must take our own side in this fight. We must be vigilant. We must persevere. And through it all, we must never, never cease to believe in the moral superiority of our own values — that we stand for truth against falsehood, freedom against tyranny, right against injustice, hope against despair … and that even though we will inevitably take losses and suffer setbacks, through it all, so long as people of goodwill and courage refuse to lose faith in the West, it will endure. That is why we come to Munich, year in and year out — to revitalize our common moral purpose, our belief that our values are worth the fighting for. Because in the final analysis, the survival of the West is not just a material struggle; it is now, and has always been, a moral struggle. Now more than ever, we must not forget this. During one of the darkest years of the early Cold War, William Faulkner delivered a short speech in Stockholm upon receiving the Nobel Prize for Literature. ‘I decline to accept the end of man,’ Faulkner said. ‘I believe that man will not merely endure: he will prevail. He is immortal, not because he alone among creatures has an inexhaustible voice, but because he has a soul, a spirit capable of compassion and sacrifice and endurance.’ Even now, when the temptation to despair is greatest, I refuse to accept the end of the West. I refuse to accept the demise of our world order. I refuse to accept that our greatest triumphs cannot once again spring from our moments of greatest peril, as they have so many times before. I refuse to accept that our values are morally equivalent to those of our adversaries. I am a proud, unapologetic believer in the West, and I believe we must always, always stand up for it — for if we do not, who will? ", "title": "Don’t Count America Out", "sentences": [{"0dda": "Don’t Count America Out"}, {"e537": "Sen. John McCain Addresses The Munich Security Conference (2/17/2017)"}, {"f78f": "My friends: In the four decades I have attended the Munich Security Conference, I cannot recall a year where its purpose was more necessary or more important."}, {"560b": "The next panel asks us to consider whether the West will survive. In recent years, this question would invite accusations of hyperbole and alarmism. Not this year. If ever there were a time to treat this question with a deadly seriousness, it is now."}, {"20d7": "This question was real, half a century ago, for Ewald von Kleist and the founders of this conference. Indeed, it is why they first started coming to Munich. They did not assume the West would survive, because they had seen its near annihilation. They saw open markets give way to beggar-thy-neighbor protectionism, and the poverty that imposed. They saw a world order fracture into clashing ethnic and nationalist passions, and the misery that wrought. They saw the rise of hostile great powers, and the failure of deterrence, and the wars that followed."}, {"375c": "From the ashes of the most awful calamity in human history was born what we call the West — a new, and different, and better kind of world order … one based not on blood-and-soil nationalism, or spheres of influence, or conquest of the weak by the strong, but rather on universal values, rule of law, open commerce, and respect for national sovereignty and independence. Indeed, the entire idea of the West is that it open to any person or any nation that honors and upholds these values."}, {"486a": "The unprecedented period of security and prosperity that we have enjoyed for the past seven decades did not happen by accident. It happened not only because of the appeal of our values, but because we backed them with our power and persevered in their defense."}, {"973a": "Our predecessors did not believe in the end of history — or that it bends, inevitably, toward justice. That is up to us. That requires our persistent, painstaking effort. And that is why we come to Munich, year after year after year."}, {"02c2": "What would von Kleist’s generation say if they saw our world today? I fear that much about it would be all-too-familiar to them, and they would be alarmed by it."}, {"f49b": "They would be alarmed by an increasing turn away from universal values and toward old ties of blood, and race, and sectarianism."}, {"096e": "They would be alarmed by the hardening resentment we see toward immigrants, and refugees, and minority groups, especially Muslims."}, {"dd78": "They would be alarmed by the growing inability, and even unwillingness, to separate truth from lies."}, {"a106": "They would be alarmed that more and more of our fellow citizens seem to be flirting with authoritarianism and romanticizing it as our moral equivalent."}, {"d986": "But what would alarm them most, I think, is a sense that many of our peoples, including in my own country, are giving up on the West … that they see it as a bad deal that we may be better off without … and that while Western nations still have the power to maintain our world order, it is unclear whether we have the will."}, {"b251": "All of us must accept our share of the blame for this turn of events. We grew complacent. We made mistakes. At times we tried to do too much, and at others we failed to do enough. We lost touch with many of our people. We have been too slow to recognize and respond to their hardships. We need to face up to these realities, but this does not mean losing hope and retreating. That we must not do."}, {"7790": "I know there is profound concern across Europe and the world that America is laying down the mantle of global leadership. I can only speak for myself, but I do not believe that is the message you will hear from all of the American leaders who cared enough to travel here to Munich this weekend. That is not the message you heard today from Secretary of Defense Jim Mattis. That is not the message you will hear from Vice President Mike Pence. That is not the message you will hear from Secretary of Homeland Security John Kelly. And that is certainly not the message you will hear tomorrow from our bipartisan congressional delegation."}, {"2c83": "Make no mistake, my friends: These are dangerous times, but you should not count America out, and we should not count each other out."}, {"e253": "We must be prudent, but we cannot wring our hands and wallow in self-doubt. We must appreciate the limits of our power, but we cannot allow ourselves to question the rightness and goodness of the West. We must understand and learn from our mistakes, but we cannot be paralyzed by fear. We cannot give up on ourselves and on each other. That is the definition of decadence. And that is how world orders really do decline and fall."}, {"8a3e": "This is exactly what our adversaries want. This is their goal. They have no meaningful allies, so they seek to sow dissent among us and divide us from each other. They know that their power and influence are inferior to ours, so they seek to subvert us, and erode our resolve to resist, and terrorize us into passivity. They know they have little to offer the world beyond selfishness and fear, so they seek to undermine our confidence in ourselves and our belief in our own values."}, {"bf42": "We must take our own side in this fight. We must be vigilant. We must persevere. And through it all, we must never, never cease to believe in the moral superiority of our own values — that we stand for truth against falsehood, freedom against tyranny, right against injustice, hope against despair … and that even though we will inevitably take losses and suffer setbacks, through it all, so long as people of goodwill and courage refuse to lose faith in the West, it will endure."}, {"c400": "That is why we come to Munich, year in and year out — to revitalize our common moral purpose, our belief that our values are worth the fighting for. Because in the final analysis, the survival of the West is not just a material struggle; it is now, and has always been, a moral struggle. Now more than ever, we must not forget this."}, {"38c1": "During one of the darkest years of the early Cold War, William Faulkner delivered a short speech in Stockholm upon receiving the Nobel Prize for Literature. ‘I decline to accept the end of man,’ Faulkner said. ‘I believe that man will not merely endure: he will prevail. He is immortal, not because he alone among creatures has an inexhaustible voice, but because he has a soul, a spirit capable of compassion and sacrifice and endurance.’"}, {"7ea2": "Even now, when the temptation to despair is greatest, I refuse to accept the end of the West. I refuse to accept the demise of our world order. I refuse to accept that our greatest triumphs cannot once again spring from our moments of greatest peril, as they have so many times before. I refuse to accept that our values are morally equivalent to those of our adversaries. I am a proud, unapologetic believer in the West, and I believe we must always, always stand up for it — for if we do not, who will?"}], "child": "963_1\t963_2\t963_3\t963_4\t963_5\t963_6\t963_7\t963_8\t963_9\t963_10\t963_11\t963_12\t963_13\t963_14\t963_15\t963_16\t963_17\t963_18\t963_19\t963_20\t963_21\t963_22\t963_23\t963_24\t963_25"}