{"name": "968", "parent": "", "content": "Resistance is an Act of Love Resistance starts in your heart. When you turn on your phone, or the news, when you open the paper to take in the President’s daily assault on compassion, reason and basic good sense, the fear and rage feels like nothing so much as a fist closing around your heart. It threatens to stop the blood pumping through your body until your brain is as deprived of oxygen as the heads in the President’s Cabinet. The struggle to lift yourself out of the headlines and into action is as real and as weird as the machinations of a ten ounce organ tasked with keeping your whole human body alive. The great challenge of this unreal age we now live in is, at its center, a question asked of the heart. How much can you love? What can love endure? What does love demand of you? How long, under what conditions, and to what degree will you resist the death of love in America? Here’s a secret hidden in sweeping accounts of history: they did it for love. The truth is that in the moment of resistance, most people aren’t doing it because it’s the right thing to do, or because they want to be on the right side of history. Those may be the byproducts of such a choice, but at the heart of the act is normal, humdrum human love. Those that marched on the Edmund Pettus Bridge didn’t do it to make the history books. They marched for the same reason Suffragettes went on hunger strikes in prison — because the vote was a chance to make tangible improvements in their lives. For the same reason that rioters at Stonewall finally pushed back against the antagonizing NYC police. For the same reason that Baby Boomers declared too many boxed bodies had been shipped home from Vietnam. For the same reason that workers unionized for decent wages, safety provisions and reasonable hours. They did it for their friends, their families, for their children, for their neighbors. They did it for their own communities, and in doing so, lifted up all of America. It’s a terrible thing, to live through history. When you are young, revolutions seem romantic. Full of burgeoning autonomy and short on life experience, from the safe distance of time passed, it’s easy to idealize the 1960s, WWII, the American or French Revolution. But here’s the truth we grapple with today: real history is fucking terrifying. The reality of How Bad It Has to Get to unleash real revolution, real resistance, is horrifying; you shouldn’t wish it on your worst enemy. It may be necessary and ultimately liberating but it is also The Worst. It requires stamina and a very high pain threshold. It requires the ability to lose over and over and over again. It demands that we never give up or give in, even when we are exhausted, even when we are stumbling around, clutching our aching hearts. The challenge of life under an autocrat is that he will seek to divide and conquer. He will attempt to slice and dice the population, to set us against each other, to convince us that our neighbors are the enemy instead of the economic forces destroying our neighborhoods. He tells us that our tribe is defined by what’s on the outside instead of what’s on the inside. That our skin color is more indicative of who we really are than our ideals, the set of principles which govern our lives. This is bullshit and we know it but we have to remind ourselves every day anyway, because those instincts to retreat to our corners are no joke, they are deep in our lizard brains, and if we want to be better than lizards we have to remind ourselves constantly that we are human. A good way to start is by quieting the din of cultural argument and listening to the still, small voice that’s in your heart. Our culture’s seemingly swift reversal on marriage equality was actually the result of decades of gay rights activism, but it finally caught on like wildfire because its central message was so compelling. Love is Love. Once that idea hit the mainstream, it was impossible to turn back the tide. But make no mistake: all resistance movements are about love. They are about the oldest kinds of love. Loving your neighbor as yourself. Finding common cause in the struggle of someone else’s life story. Loving the refugee because your grandparents were refugees. Loving the immigrant because the whole damn country is descended from immigrants. Loving your children enough that you want them to be able to breathe the air and drink the water without risking their health. Loving the Black Lives Matter protester even if you’ve never been afraid of the police, because at some point in your life someone has made you afraid, has followed you down a dark alley or refused to hear No in the backseat of a car or bullied you out of view of teachers on the schoolyard. Loving people means not wanting them to live in fear that ICE is going to steal their parent in the middle of the night or that the government will follow them into their doctor’s offices and steal their right to choose what happens to their own body. On Valentine’s Day, when we’re surrounded by trite and wafer thin messages about love, the candy hearts and Hallmark greetings, it’s easy to forget what a truly radical act love is. Amidst the mockery of “social justice warriors” and “snowflakes” that imply our beliefs are somehow fragile or weak, it’s easy to forget what a fucking ferocious choice love is. If you’ve ever really been in love, you know. Love changes you on a cellular level. It rewrites your code. Forget moving mountains, it creates movements. It changes history. Resisting hate, oppression, division, and marginalization is a truly radical act of love. When you march in the street, that is love. When you call your senator, that’s love. When you donate your time or money to the cause of protecting people, that is love. We belong to one another, our fates are inextricably bound together, and if we hold fast to our love, to our bloody and boundless hearts, we will not be defeated. There is no force more powerful than this love. No small minded bigotry, no corrupt intent, no president or army or country that can stop the greatness and grace of real human love. If anyone tries to tell you different, resist. ", "title": "Resistance is an Act of Love", "sentences": [{"e89a": "Resistance is an Act of Love"}, {"ee07": "Resistance starts in your heart. When you turn on your phone, or the news, when you open the paper to take in the President’s daily assault on compassion, reason and basic good sense, the fear and rage feels like nothing so much as a fist closing around your heart. It threatens to stop the blood pumping through your body until your brain is as deprived of oxygen as the heads in the President’s Cabinet. The struggle to lift yourself out of the headlines and into action is as real and as weird as the machinations of a ten ounce organ tasked with keeping your whole human body alive. The great challenge of this unreal age we now live in is, at its center, a question asked of the heart. How much can you love? What can love endure? What does love demand of you? How long, under what conditions, and to what degree will you resist the death of love in America?"}, {"b5c6": "Here’s a secret hidden in sweeping accounts of history: they did it for love. The truth is that in the moment of resistance, most people aren’t doing it because it’s the right thing to do, or because they want to be on the right side of history. Those may be the byproducts of such a choice, but at the heart of the act is normal, humdrum human love. Those that marched on the Edmund Pettus Bridge didn’t do it to make the history books. They marched for the same reason Suffragettes went on hunger strikes in prison — because the vote was a chance to make tangible improvements in their lives. For the same reason that rioters at Stonewall finally pushed back against the antagonizing NYC police. For the same reason that Baby Boomers declared too many boxed bodies had been shipped home from Vietnam. For the same reason that workers unionized for decent wages, safety provisions and reasonable hours. They did it for their friends, their families, for their children, for their neighbors. They did it for their own communities, and in doing so, lifted up all of America."}, {"460d": "It’s a terrible thing, to live through history. When you are young, revolutions seem romantic. Full of burgeoning autonomy and short on life experience, from the safe distance of time passed, it’s easy to idealize the 1960s, WWII, the American or French Revolution. But here’s the truth we grapple with today: real history is fucking terrifying. The reality of How Bad It Has to Get to unleash real revolution, real resistance, is horrifying; you shouldn’t wish it on your worst enemy. It may be necessary and ultimately liberating but it is also The Worst. It requires stamina and a very high pain threshold. It requires the ability to lose over and over and over again. It demands that we never give up or give in, even when we are exhausted, even when we are stumbling around, clutching our aching hearts."}, {"d9f0": "The challenge of life under an autocrat is that he will seek to divide and conquer. He will attempt to slice and dice the population, to set us against each other, to convince us that our neighbors are the enemy instead of the economic forces destroying our neighborhoods. He tells us that our tribe is defined by what’s on the outside instead of what’s on the inside. That our skin color is more indicative of who we really are than our ideals, the set of principles which govern our lives. This is bullshit and we know it but we have to remind ourselves every day anyway, because those instincts to retreat to our corners are no joke, they are deep in our lizard brains, and if we want to be better than lizards we have to remind ourselves constantly that we are human. A good way to start is by quieting the din of cultural argument and listening to the still, small voice that’s in your heart."}, {"f7d1": "Our culture’s seemingly swift reversal on marriage equality was actually the result of decades of gay rights activism, but it finally caught on like wildfire because its central message was so compelling. Love is Love. Once that idea hit the mainstream, it was impossible to turn back the tide. But make no mistake: all resistance movements are about love. They are about the oldest kinds of love. Loving your neighbor as yourself. Finding common cause in the struggle of someone else’s life story. Loving the refugee because your grandparents were refugees. Loving the immigrant because the whole damn country is descended from immigrants. Loving your children enough that you want them to be able to breathe the air and drink the water without risking their health. Loving the Black Lives Matter protester even if you’ve never been afraid of the police, because at some point in your life someone has made you afraid, has followed you down a dark alley or refused to hear No in the backseat of a car or bullied you out of view of teachers on the schoolyard. Loving people means not wanting them to live in fear that ICE is going to steal their parent in the middle of the night or that the government will follow them into their doctor’s offices and steal their right to choose what happens to their own body."}, {"b394": "On Valentine’s Day, when we’re surrounded by trite and wafer thin messages about love, the candy hearts and Hallmark greetings, it’s easy to forget what a truly radical act love is. Amidst the mockery of “social justice warriors” and “snowflakes” that imply our beliefs are somehow fragile or weak, it’s easy to forget what a fucking ferocious choice love is."}, {"391b": "If you’ve ever really been in love, you know. Love changes you on a cellular level. It rewrites your code. Forget moving mountains, it creates movements. It changes history. Resisting hate, oppression, division, and marginalization is a truly radical act of love. When you march in the street, that is love. When you call your senator, that’s love. When you donate your time or money to the cause of protecting people, that is love. We belong to one another, our fates are inextricably bound together, and if we hold fast to our love, to our bloody and boundless hearts, we will not be defeated."}, {"e3bc": "There is no force more powerful than this love. No small minded bigotry, no corrupt intent, no president or army or country that can stop the greatness and grace of real human love. If anyone tries to tell you different, resist."}], "child": "968_1\t968_2\t968_3\t968_4\t968_5\t968_6\t968_7\t968_8\t968_9\t968_10\t968_11\t968_12\t968_13\t968_14\t968_15\t968_16\t968_17\t968_18\t968_19\t968_20\t968_21\t968_22\t968_23\t968_24\t968_25"}