{"name": "979", "parent": "", "content": "16 Memorable Books I read in 2016 Rewarding reads on love, life, knowledge, history, the future, and tools for thinking. Out of all the books I read this year, here is a list of what I found most worth reading in 2016. 1. The Psychology of Man’s Possible EvolutionThese lectures, which were originally called Six Psychological Lectures, were first privately printed in the 1940s. Of the first run of 150 copies, none were sold. The essays were published once again after Ouspensky’s death, and unlike last time became a hit. While the book is about psychology, it’s different than what we think of as psychology — “for thousands of years psychology existed under the name philosophy.” Consider this a study in what man may become — by working simultaneously on knowledge and inner unity. 2. The Island of Knowledge: The Limits of Science and the Search for MeaningImagine the sum of our knowledge as an Island in a vast and endless ocean. This is the Island of Knowledge. The coastline represents the boundary between the known and unknown. As we grow our understanding of the world, the Island grows and with it so does the shores of our ignorance. “We strive toward knowledge, always more knowledge,” Gleiser writes, “but must understand that we are, and will remain, surrounded by mystery.” The book is a fascinating and wide-ranging tour through scientific history. (Dig Deeper into this amazing read here.) 3. When Breath Becomes AirIt’s been a while since I’ve cried reading a book. This beautifully written memoir, by a young neurosurgeon diagnosed with terminal cancer, attempts to answer the question What makes a life worth living? If you read this and you’re not feeling something you’re probably a robot. 4. The Sovereign Individual: Mastering the Transition to the Information AgeThe book, which argues “the information revolution will destroy the monopoly power of the nation-state as surely as the Gunpowder Revolution destroyed the Church’s monopoly,” is making the rounds in Silicon Valley and being passed around like candy. Even if its forecasts are controversial, the book is a good read and it’s full of interesting and detailed arguments. I have underlines on nearly every page. “Information societies,” the authors write, “promise to dramatically reduce the returns to violence … When the payoff for organizing violence at a large scale tumbles, the payoff from violence at a smaller scale is likely to jump. Violence will become more random and localized.” The Sovereign Individual, who, for the first time “can educate and motivate himself,” will be “almost entirely free to invest their own work and realize the full benefits of their own productivity.” An unleashing of human potential which will, the authors argue, shift the greatest source of wealth to ideas rather than physical capital — “anyone who thinks clearly will potentially be rich.” Interestingly, in this potential transition, the effects are “likely to be centered among those of the middle talent in currently rich countries. They particularly may come to feel that information technology poses a threat to their way of life.” The book predicts the death of politics, “weakened by the challenge from technology, the state will treat increasingly autonomous individuals, its former citizens, with the same range of ruthlessness and diplomacy it has heretofore displayed in its dealings with other governments.” As technology reshapes the world, it also “antiquates laws, reshapes morals, and alters preconceptions. This book explains how.” 5. To Kill a MockingbirdI know, I know. Hear me out. Someone I respect mentioned that he thought Atticus Finch was the perfect blend of human characteristics. Tough and skilled, yet humble and understanding. He’s frequently rated as a “most admired” hero in fiction, yet he’s a lawyer competing with Jedis, Detectives, Spies, and Superheroes. Isn’t that kind of interesting? Since it had been at least 15 years since I’d read TKM, I wanted to go back and remember what made Atticus so admired. His courage, his humility, his understanding of people. I forgot just how perceptive Finch was when it came to what we’d call “group social dynamics” — he forgives the individual members of the mob that show up to hurt Tom Robinson simply because he understands that mob psychology is capable of overwhelming otherwise good people. How many of us would be able to do that? Atticus Finch is certainly a fictional, and perhaps “unattainably” moral hero. But I will point out that not only do real life “Finch’s” exist, but that even if we don’t “arrive” at a Finchian level of heroic integrity and calm temperament, it’s certainly a goal worth pursuing. Wise words from the book Rules for a Knight sums it up best: “To head north, a knight may use the North Star to guide him, but he will not arrive at the North Star. A knight’s duty is to proceed in that direction.” (Here are some of the lessons I took away from the book.) 6. Lee Kuan Yew: The Grand Master’s Insights on China, the United States, and the WorldIf you’re not familiar with Lee Kuan Yew, he’s the “Father of Modern Singapore,” the man who took a small, poor island just north of the equator in Southeast Asia with GDP per capita of ~$500 in 1965 and turned it into a modern powerhouse with GDP per capita of over $70,000 as of 2014, with some of the lowest rates of corruption and highest rates of economic freedom in the world. Finding out how he did it is worth anyone’s time. This book is a short introduction to his style of thinking: A series of excerpts of his thoughts on modern China, the modern U.S., Islamic Terrorism, economics, and a few other things. It’s a wonderful little collection. (We’ve actually posted about it before.) Consider this an appetizer (a delicious one) for the main course: From Third World to First, Yew’s full account of the rise of Singapore. (Dig deeper here.) 7. An Illustrated Book of Bad ArgumentsPerfect summer reading for adults and kids alike. One friend of mine has created a family game where they all try to spot the reasoning flaws of others. The person with the most points at the end of the week gets to pick where they go for dinner. I have a suspicion his kids will turn out to be politicians or lawyers. 8. Intuition Pumps and Other Tools for ThinkingDan Dennett is one of the most well known cognitive scientists on the planet . This book is a collection of 77 short essays on different “thinking tools,” basically thought experiments Dennett uses to slice through tough problems, including some tools for thinking about computing, thinking about meaning, and thinking about consciousness. Like Richard Feynman’s great books, this one acts as a window into a brilliant mind and how it handles interesting and difficult problems. If you only walk away with a few new mental tools, it’s well worth the time spent. (You can learn a lot more about Dennett here, here, and here.) 9. The Seven Sins of Memory (How the Mind Forgets and Remembers)I found this in the bibliography of Judith Rich Harris’ No Two Alike. Schacter is a psychology professor at Harvard who runs the Schacter Memory Lab. The book explores the seven “issues” we tend to find with regard to our memory: Absent-mindedness, transience, blocking, misattribution, suggestibility, bias, and persistence. The fallibility of memory is so fascinating: We rely on it so heavily and trust it so deeply, yet as Schacter shows, it’s extremely faulty. It’s not just about forgetting where you left your keys. Modern criminologists know that eyewitness testimony is deeply flawed. Some of our deepest and most hard-won memories — the things we know are true — are frequently wrong or distorted. Learning to calibrate our confidence in our own memory is not at all easy. Very interesting topic to explore. (We did a three part series on this book. Introduction and parts One, Two, and Three). 10. Talk Lean: Shorter Meetings. Quicker Results. Better RelationsThis book is full of useful tips on listening better, being candid and courteous, and learning what derails meetings, conversations, and relationships with people at work. Don’t worry. It’s not about leaving things unsaid that might be displeasing for other people. In fact, leaving things unsaid is often more detrimental to the relationship than airing them out. Rather, it’s about finding a way to say them so people will hear them and not feel defensive. If you want to get right to the point and not alienate people, this book will help you. I know because this is something, personally, I struggle with at times. 11. The Master Algorithm: How the Quest for the Ultimate Learning Machine Will Remake Our WorldI recently had a fascinating multi-hour dinner with the author, Pedro Domingos, on where knowledge comes from. Historically, at least, the answer has been evolution, experience, and culture. Now, however, there is a new source of knowledge: Machine learning. The book offers an accessible overview of the different ways of machine learning and the search for a master, unifying, theory. The book also covers how machine learning works and gives Pedro’s thoughts on where we’re headed. (Dig deeper in this podcast.) 12. Why Don’t We Learn from History?This is a short (~120pp) book by the military historian and strategist B.H. Liddell Hart, a man who not only wrote military history but surely influenced it, especially in Germany in the World War period. He wrote this short synthesis at the end of his life and didn’t have a chance to finish it, but the result is still fascinating. Hart takes a “negative” view of history; in other words, What went wrong? How can we avoid it? The result of that study, as he writes in the introduction, is that “History teaches us personal philosophy.” Those who learn vicariously as well as directly have a big leg up. Something to take to heart. I plan to read more of his works. 13. A Powerful Mind: The Self-Education of George WashingtonWhat a great book idea by Adrienne Harrison. There are a zillion biographies of GW out there, with Chernow’s getting a lot of praise recently. But Harrison narrows in on Washington’s self-didactic nature. Why did he read so much? How did he educate himself? Any self-motivated learner is probably going to enjoy this. 14. Sapiens: A Brief History of HumankindOne of the best books I’ve come across in a long time. Sapiens is a work of “Big History” — in the style of Jared Diamond’s Guns, Germs, and Steel — that seeks to understand humanity in a deep way. Many of Professor Harari’s solutions will be uncomfortable for some to read, there is no attempt at political correctness, but his diagnosis of human history is undeniably interesting and at least partially correct. He draws on many fields to arrive at his conclusions; a grand method of synthesis that will be familiar to long-time Farnam Street readers. The book is almost impossible to summarize given the multitude of ideas presented. But then again, most great books are. (Dig deeper into this amazing read here, here, and here.) 15. Becoming Wise: An Inquiry into the Mystery and Art of Living A refreshing signal in world of noise that should be read and immediately re-read. There is so much goodness in here that scarcely will you find more than a page or two in my copy without a mark, bent page, or highlight. The entire book offers texture to thoughts you knew you had but didn’t know how to express. 16. The Happiness Trap: How to Stop Struggling and Start LivingThe way most of us search for and attempt to hold onto fleeting moments of happiness ends up ensuring that we’re miserable. A great practical book on developing mindfulness, which is so important in many aspects of your life, including satisfaction. Might be the best self-help book I’ve read. For more great reads every week, sign up for my weekly newsletter. If you want to work smarter and not harder, subscribe to The Brain Food Newsletter — a weekly dose of insight that will help you become more effective. You can follow Shane on Twitter and Facebook. ", "title": "16 Memorable Books I read in 2016", "sentences": [{"c439": "16 Memorable Books I read in 2016"}, {"6acc": "Rewarding reads on love, life, knowledge, history, the future, and tools for thinking."}, {"8b94": "Out of all the books I read this year, here is a list of what I found most worth reading in 2016."}, {"f5c6": "1. The Psychology of Man’s Possible EvolutionThese lectures, which were originally called Six Psychological Lectures, were first privately printed in the 1940s. Of the first run of 150 copies, none were sold. The essays were published once again after Ouspensky’s death, and unlike last time became a hit. While the book is about psychology, it’s different than what we think of as psychology — “for thousands of years psychology existed under the name philosophy.” Consider this a study in what man may become — by working simultaneously on knowledge and inner unity."}, {"fb44": "2. The Island of Knowledge: The Limits of Science and the Search for MeaningImagine the sum of our knowledge as an Island in a vast and endless ocean. This is the Island of Knowledge. The coastline represents the boundary between the known and unknown. As we grow our understanding of the world, the Island grows and with it so does the shores of our ignorance. “We strive toward knowledge, always more knowledge,” Gleiser writes, “but must understand that we are, and will remain, surrounded by mystery.” The book is a fascinating and wide-ranging tour through scientific history. (Dig Deeper into this amazing read here.)"}, {"3654": "3. When Breath Becomes AirIt’s been a while since I’ve cried reading a book. This beautifully written memoir, by a young neurosurgeon diagnosed with terminal cancer, attempts to answer the question What makes a life worth living? If you read this and you’re not feeling something you’re probably a robot."}, {"9493": "4. The Sovereign Individual: Mastering the Transition to the Information AgeThe book, which argues “the information revolution will destroy the monopoly power of the nation-state as surely as the Gunpowder Revolution destroyed the Church’s monopoly,” is making the rounds in Silicon Valley and being passed around like candy. Even if its forecasts are controversial, the book is a good read and it’s full of interesting and detailed arguments. I have underlines on nearly every page. “Information societies,” the authors write, “promise to dramatically reduce the returns to violence … When the payoff for organizing violence at a large scale tumbles, the payoff from violence at a smaller scale is likely to jump. Violence will become more random and localized.” The Sovereign Individual, who, for the first time “can educate and motivate himself,” will be “almost entirely free to invest their own work and realize the full benefits of their own productivity.” An unleashing of human potential which will, the authors argue, shift the greatest source of wealth to ideas rather than physical capital — “anyone who thinks clearly will potentially be rich.” Interestingly, in this potential transition, the effects are “likely to be centered among those of the middle talent in currently rich countries. They particularly may come to feel that information technology poses a threat to their way of life.” The book predicts the death of politics, “weakened by the challenge from technology, the state will treat increasingly autonomous individuals, its former citizens, with the same range of ruthlessness and diplomacy it has heretofore displayed in its dealings with other governments.” As technology reshapes the world, it also “antiquates laws, reshapes morals, and alters preconceptions. This book explains how.”"}, {"9996": "5. To Kill a MockingbirdI know, I know. Hear me out. Someone I respect mentioned that he thought Atticus Finch was the perfect blend of human characteristics. Tough and skilled, yet humble and understanding. He’s frequently rated as a “most admired” hero in fiction, yet he’s a lawyer competing with Jedis, Detectives, Spies, and Superheroes. Isn’t that kind of interesting? Since it had been at least 15 years since I’d read TKM, I wanted to go back and remember what made Atticus so admired. His courage, his humility, his understanding of people. I forgot just how perceptive Finch was when it came to what we’d call “group social dynamics” — he forgives the individual members of the mob that show up to hurt Tom Robinson simply because he understands that mob psychology is capable of overwhelming otherwise good people. How many of us would be able to do that? Atticus Finch is certainly a fictional, and perhaps “unattainably” moral hero. But I will point out that not only do real life “Finch’s” exist, but that even if we don’t “arrive” at a Finchian level of heroic integrity and calm temperament, it’s certainly a goal worth pursuing. Wise words from the book Rules for a Knight sums it up best: “To head north, a knight may use the North Star to guide him, but he will not arrive at the North Star. A knight’s duty is to proceed in that direction.” (Here are some of the lessons I took away from the book.)"}, {"b543": "6. Lee Kuan Yew: The Grand Master’s Insights on China, the United States, and the WorldIf you’re not familiar with Lee Kuan Yew, he’s the “Father of Modern Singapore,” the man who took a small, poor island just north of the equator in Southeast Asia with GDP per capita of ~$500 in 1965 and turned it into a modern powerhouse with GDP per capita of over $70,000 as of 2014, with some of the lowest rates of corruption and highest rates of economic freedom in the world. Finding out how he did it is worth anyone’s time. This book is a short introduction to his style of thinking: A series of excerpts of his thoughts on modern China, the modern U.S., Islamic Terrorism, economics, and a few other things. It’s a wonderful little collection. (We’ve actually posted about it before.) Consider this an appetizer (a delicious one) for the main course: From Third World to First, Yew’s full account of the rise of Singapore. (Dig deeper here.)"}, {"59a6": "7. An Illustrated Book of Bad ArgumentsPerfect summer reading for adults and kids alike. One friend of mine has created a family game where they all try to spot the reasoning flaws of others. The person with the most points at the end of the week gets to pick where they go for dinner. I have a suspicion his kids will turn out to be politicians or lawyers."}, {"e37c": "8. Intuition Pumps and Other Tools for ThinkingDan Dennett is one of the most well known cognitive scientists on the planet . This book is a collection of 77 short essays on different “thinking tools,” basically thought experiments Dennett uses to slice through tough problems, including some tools for thinking about computing, thinking about meaning, and thinking about consciousness. Like Richard Feynman’s great books, this one acts as a window into a brilliant mind and how it handles interesting and difficult problems. If you only walk away with a few new mental tools, it’s well worth the time spent. (You can learn a lot more about Dennett here, here, and here.)"}, {"2233": "9. The Seven Sins of Memory (How the Mind Forgets and Remembers)I found this in the bibliography of Judith Rich Harris’ No Two Alike. Schacter is a psychology professor at Harvard who runs the Schacter Memory Lab. The book explores the seven “issues” we tend to find with regard to our memory: Absent-mindedness, transience, blocking, misattribution, suggestibility, bias, and persistence. The fallibility of memory is so fascinating: We rely on it so heavily and trust it so deeply, yet as Schacter shows, it’s extremely faulty. It’s not just about forgetting where you left your keys. Modern criminologists know that eyewitness testimony is deeply flawed. Some of our deepest and most hard-won memories — the things we know are true — are frequently wrong or distorted. Learning to calibrate our confidence in our own memory is not at all easy. Very interesting topic to explore. (We did a three part series on this book. Introduction and parts One, Two, and Three)."}, {"8b13": "10. Talk Lean: Shorter Meetings. Quicker Results. Better RelationsThis book is full of useful tips on listening better, being candid and courteous, and learning what derails meetings, conversations, and relationships with people at work. Don’t worry. It’s not about leaving things unsaid that might be displeasing for other people. In fact, leaving things unsaid is often more detrimental to the relationship than airing them out. Rather, it’s about finding a way to say them so people will hear them and not feel defensive. If you want to get right to the point and not alienate people, this book will help you. I know because this is something, personally, I struggle with at times."}, {"0565": "11. The Master Algorithm: How the Quest for the Ultimate Learning Machine Will Remake Our WorldI recently had a fascinating multi-hour dinner with the author, Pedro Domingos, on where knowledge comes from. Historically, at least, the answer has been evolution, experience, and culture. Now, however, there is a new source of knowledge: Machine learning. The book offers an accessible overview of the different ways of machine learning and the search for a master, unifying, theory. The book also covers how machine learning works and gives Pedro’s thoughts on where we’re headed. (Dig deeper in this podcast.)"}, {"199b": "12. Why Don’t We Learn from History?This is a short (~120pp) book by the military historian and strategist B.H. Liddell Hart, a man who not only wrote military history but surely influenced it, especially in Germany in the World War period. He wrote this short synthesis at the end of his life and didn’t have a chance to finish it, but the result is still fascinating. Hart takes a “negative” view of history; in other words, What went wrong? How can we avoid it? The result of that study, as he writes in the introduction, is that “History teaches us personal philosophy.” Those who learn vicariously as well as directly have a big leg up. Something to take to heart. I plan to read more of his works."}, {"fe7e": "13. A Powerful Mind: The Self-Education of George WashingtonWhat a great book idea by Adrienne Harrison. There are a zillion biographies of GW out there, with Chernow’s getting a lot of praise recently. But Harrison narrows in on Washington’s self-didactic nature. Why did he read so much? How did he educate himself? Any self-motivated learner is probably going to enjoy this."}, {"904b": "14. Sapiens: A Brief History of HumankindOne of the best books I’ve come across in a long time. Sapiens is a work of “Big History” — in the style of Jared Diamond’s Guns, Germs, and Steel — that seeks to understand humanity in a deep way. Many of Professor Harari’s solutions will be uncomfortable for some to read, there is no attempt at political correctness, but his diagnosis of human history is undeniably interesting and at least partially correct. He draws on many fields to arrive at his conclusions; a grand method of synthesis that will be familiar to long-time Farnam Street readers. The book is almost impossible to summarize given the multitude of ideas presented. But then again, most great books are. (Dig deeper into this amazing read here, here, and here.)"}, {"80fa": "15. Becoming Wise: An Inquiry into the Mystery and Art of Living A refreshing signal in world of noise that should be read and immediately re-read. There is so much goodness in here that scarcely will you find more than a page or two in my copy without a mark, bent page, or highlight. The entire book offers texture to thoughts you knew you had but didn’t know how to express."}, {"da9f": "16. The Happiness Trap: How to Stop Struggling and Start LivingThe way most of us search for and attempt to hold onto fleeting moments of happiness ends up ensuring that we’re miserable. A great practical book on developing mindfulness, which is so important in many aspects of your life, including satisfaction. Might be the best self-help book I’ve read."}, {"f91e": "For more great reads every week, sign up for my weekly newsletter."}, {"5199": "If you want to work smarter and not harder, subscribe to The Brain Food Newsletter — a weekly dose of insight that will help you become more effective."}, {"a060": "You can follow Shane on Twitter and Facebook."}], "child": "979_1\t979_2979_1\t979_2979_1\t979_2"}