{"name": "981", "parent": "", "content": "The death of a White Female American Hero — In honor of Harper Lee Harper Lee will forever be praised for her amazing book To Kill A Mockingbird I read her book later in life when I was about 2o years old rather than reading it in high school with my peers on a summer reading list — which no one ever took seriously or did for pleasure. Most people who I converse with about her book have little information to share about the meaningful content and who the author is personally. Her book is still memorable for me and many other people that have the perceptibility to appreciate artistry in written form. When I decided to read her book my friend had to convince me to do so because I felt that my time was valuable and I didn’t want to waste it reading a childish fictional book. Since my friend consistently insisted that I read it, I gave it a chance. To my surprise, the book was all my friend said it would be and more. It was sophisticated, heartfelt, and life changing. She really put her soul into her book and I continually felt her pulling the strings of my heart on social issues that are still applicable for today as they were then. Her book cried out against injustice towards black people and showed that there were actual white people who really wanted to embark on the long road of seeing change take root in America. To say that she only wrote about racial issues would be down playing the complexity of her work. On the contrary, her book was filled with pain as a single father household worked through not having a loving mother around, how to control anger in the mist of hurt, and the struggle that every person has to deal with — growing apart from a friend you love when you want things to remain joyously the same but they can’t. These are only a few things I can think of off the top of my head but I’m sure that there is a plentiful amount of more substance to takeaway from her work. The thing I love about her the most is that she didn’t feel the need to take another venture into writing after she wrote what would become one of the best books written in American literature. After writing her work of art she decided her work was done. Her heart was clear. Her life was shared. There was no more to be said. Period! I am sure people pressured her time after time to out do her first book by giving fans more of her penmanship. She stood completely content and her pen remained silent for the remainder of her life. It wasn’t about the money or fame for her. She didn’t want to force work out of herself unless she felt a calling to do so. To do such a thing is honorable, selfless, and rare to say the least. People just don’t do things of that nature regularly but I appreciate her for stepping out of the norm to follow her heart. I am fully aware that she released a book last year in July but for most of her life to Kill A Mockingbird was the only book she wrote and the sequel is debatable on if she really is the author. So to my knowledge To Kill A Mockingbird is her only real book. I am a young black man who can appreciate a excellent work of art no matter if it by the hands of a white or black person. Male or female. Great work is great work! You will forever be remembered as a woman of value, character, and moral awareness. A 89 year old mockingbird has past away but I can still hear her singing echoing in mind. ", "title": "The death of a White Female American Hero — In honor of Harper Lee", "sentences": [{"bd9f": "The death of a White Female American Hero — In honor of Harper Lee"}, {"aa15": "Harper Lee will forever be praised for her amazing book To Kill A Mockingbird"}, {"b1a5": "I read her book later in life when I was about 2o years old rather than reading it in high school with my peers on a summer reading list — which no one ever took seriously or did for pleasure. Most people who I converse with about her book have little information to share about the meaningful content and who the author is personally. Her book is still memorable for me and many other people that have the perceptibility to appreciate artistry in written form. When I decided to read her book my friend had to convince me to do so because I felt that my time was valuable and I didn’t want to waste it reading a childish fictional book. Since my friend consistently insisted that I read it, I gave it a chance."}, {"6ecd": "To my surprise, the book was all my friend said it would be and more. It was sophisticated, heartfelt, and life changing. She really put her soul into her book and I continually felt her pulling the strings of my heart on social issues that are still applicable for today as they were then. Her book cried out against injustice towards black people and showed that there were actual white people who really wanted to embark on the long road of seeing change take root in America. To say that she only wrote about racial issues would be down playing the complexity of her work. On the contrary, her book was filled with pain as a single father household worked through not having a loving mother around, how to control anger in the mist of hurt, and the struggle that every person has to deal with — growing apart from a friend you love when you want things to remain joyously the same but they can’t. These are only a few things I can think of off the top of my head but I’m sure that there is a plentiful amount of more substance to takeaway from her work."}, {"decf": "The thing I love about her the most is that she didn’t feel the need to take another venture into writing after she wrote what would become one of the best books written in American literature. After writing her work of art she decided her work was done. Her heart was clear. Her life was shared. There was no more to be said. Period! I am sure people pressured her time after time to out do her first book by giving fans more of her penmanship. She stood completely content and her pen remained silent for the remainder of her life. It wasn’t about the money or fame for her. She didn’t want to force work out of herself unless she felt a calling to do so. To do such a thing is honorable, selfless, and rare to say the least. People just don’t do things of that nature regularly but I appreciate her for stepping out of the norm to follow her heart. I am fully aware that she released a book last year in July but for most of her life to Kill A Mockingbird was the only book she wrote and the sequel is debatable on if she really is the author. So to my knowledge To Kill A Mockingbird is her only real book."}, {"2025": "I am a young black man who can appreciate a excellent work of art no matter if it by the hands of a white or black person. Male or female. Great work is great work! You will forever be remembered as a woman of value, character, and moral awareness. A 89 year old mockingbird has past away but I can still hear her singing echoing in mind."}], "child": "981_1981_1"}