{"name": "988", "parent": "", "content": "I ate a banana It is true. Yesterday on our family’s return trip from Kansas City, I ate a banana. If you know me, it’s kind of a big deal. I’d prefer a Nutty Bar. It got me thinking — as our girls watched McFarland, USA in the back of the van — about resolutions. More specifically, about how I could get better in 2016. Too often, I have been a ‘fly by the seat of my pants’ kind of guy. Most of the time, it’s gotten me in trouble. Not that life was awful, but it could have been better. Last year, my wife had me write down some goals on the notes section of my phone. I looked back on them a few times and didn’t do terrible. In fact, I’d say 2015 was a pretty productive year. So, I joined Medium to journal my thoughts for a year — to resolve to journal 300 days in 2016 — and to share my story and the stories I write with you. Some days may be 1,000 words; some days 30. It’s is, simply, my first resolution. The five rules of resolutions: specific, measurable, must be your goals, must have a time limit, must be in writing. Thanks for reading. Leave a comment for give a recommend if you think it’s worth it. I look forward to sharing my story in 2016. ", "title": "I ate a banana", "sentences": [{"6ce5": "I ate a banana"}, {"924b": "It is true. Yesterday on our family’s return trip from Kansas City, I ate a banana."}, {"4545": "If you know me, it’s kind of a big deal. I’d prefer a Nutty Bar."}, {"e915": "It got me thinking — as our girls watched McFarland, USA in the back of the van — about resolutions. More specifically, about how I could get better in 2016."}, {"77f4": "Too often, I have been a ‘fly by the seat of my pants’ kind of guy. Most of the time, it’s gotten me in trouble. Not that life was awful, but it could have been better."}, {"8001": "Last year, my wife had me write down some goals on the notes section of my phone. I looked back on them a few times and didn’t do terrible. In fact, I’d say 2015 was a pretty productive year."}, {"68c6": "So, I joined Medium to journal my thoughts for a year — to resolve to journal 300 days in 2016 — and to share my story and the stories I write with you. Some days may be 1,000 words; some days 30."}, {"a5b1": "It’s is, simply, my first resolution."}, {"eec7": "The five rules of resolutions: specific, measurable, must be your goals, must have a time limit, must be in writing."}, {"bac8": "Thanks for reading. Leave a comment for give a recommend if you think it’s worth it. I look forward to sharing my story in 2016."}], "child": "988_1\t988_2\t988_3\t988_4\t988_5"}