{"name": "992", "parent": "", "content": "2015 retrospective: wins, losses, and lessons learned I’m writing this retrospective in public because it’s important for me to create accountability outside my own head, and I’m a Snake Person who’s fairly comfortable with oversharing. 365 days ago I wrote a list of goals for 2015—emphatically not “resolutions;” these goals were concrete, achievable, and reflected a particular vision for the life I want(ed) to lead. This was my list: In 2015 I will… This is a pretty solid list. It’s made up of a mixture of financial, health, and lifestyle goals, with some creative ideas thrown in there as well. Together, these goals paint a picture of the person I wanted to be in 2015: Writing this down now, there are some glaring inconsistencies and “gotchas” that come to mind, but let’s see how I did. Run the Spartan Race: ✅ The Spartan Race is one of these currently-in-vogue obstacle course races—the Spartan is known for being particularly gnarly. This goal was all about me committing to a feat of physical fitness and doing something a bit scary, but not really dangerous. I signed up in February for the Toronto Spartan Race, which was held at Brimacombe ski resort. It was 30℃ and we ran 5 kilometres up and down the mountain. It was awful and fantastic; I will be doing it again in 2016. Camp in a national park ✅ Somehow I’d never camped outdoors in a national park before now, which is something I’ve wanted to do for ages. I like the idea of camping a bit more than actual camping, so this year I wanted to leave glamping behind and get in some real tent time. A buddy and I went to Torrance Barrens Dark Sky Preserve (near Gravenhurst) and camped overnight. It was a great experience to leave the city lights behind and really rough it for a short while. Gain 10lb 🌀 Wait, gaining weight as a yearly goal? Yes. This goal is a metric aimed at getting me to the gym, eating healthily (more), and putting on some much needed pounds. I ended 2015 only gaining ~7lb which isn’t so bad. And I definitely got stronger. Onward and upward. Eliminate my debt ❌ Bahahahaha! I don’t have a lot of debt, but it’s enough that by April or May I realized this goal wasn’t really achievable. I’ve made some good progress, paying off the provincial portion of my student loans, eliminating old unpaid accounts and crushing credit card debt. I should be debt-free by the fall of 2016! Save a $10,000 safety net❌ This goal is very achievable, and I almost did it, except for the aforementioned debt, and spending the majority of my savings in the process of moving to, and setting up, a new apartment. Not nailing this goal is pretty bad, a dual-income household with no kids and great jobs should have no problem setting up a safety net. This is priority number one for 2016. Read 12 books 🌀 Not even close. I started out strong, reading 3 books by March. Then totally didn’t read all spring and summer. I closed out 2015 having read 6 or 7 books, depending on how exactly you count. This figure includes audiobooks. I used to read so much more when I was younger, and this is still important to me. It’s much easier to turn to Netflix or the internet instead of reading books. I want to break those habits. Leave North America ✅ This was a big one—I wanted to do some serious travelling in 2015, and I did! I spent 2 weeks in Iceland in April, when it was still definitely winter. It was magical, I’ve fallen in love with the country and can’t wait to go back. Worth noting that we almost died in a freak snowstorm, nearly overturned our Land Rover in a freezing river, and camped several nights in sub-zero temperatures. Iceland was the best. Write a book of recipes 🌀 I’m pretty serious about cooking, and have been working on writing up original recipes all year. I haven’t gotten anywhere close to writing a book (or a cooking blog for that matter) and this is firmly in the “started, will continue in earnest” category. — — — — — — The final tally is: 3 goals met, 2 goals failed, and 3 goals partially met (i.e. failed but I got something done). I’m drawing some pretty clear conclusions from the data. I’m not great at managing money and debt, or keeping my nose to the grindstone to get solid work done—but I’m fantastic at finding exhilarating, fun activities that satisfy the novelty-seeking side of my ADHD brain. 2015 was the first year in my adult life that I had the ability (fiscally and emotionally) to allow myself to indulge in my thrill-seeking side. 2015 was my ultimate year of #treatyoself. So I think that’s OK. I’m not beating myself up about it. I didn’t meet all the goals I set, especially the important grown-up ones, but thinking back to the intent of my list, I feel good about who I was in 2015. I’m not making a list of concrete goals this year — instead, just a template to guide my decisions. This is who I want to be in 2016: An adventurous thrill-seeker Maybe just on the weekends. Turns out I don’t have anything to prove. Fiscally responsible // Domestic I’m engaged and we have 2 pets. We just moved into a new apartment and steady jobs. Time to learn how to run a household, and run it well. Someone who pushes their physical limits I’m not getting any younger, and I’m not particularly fit. This is important. Productive and creative Hobbies are good, especially ones that are creatively fulfilling. I’ll be writing and building more in 2016. A million blog posts about resolutions will tell you to be specific, but I’m not sure specificity works for me. For my personal goals, it matters more what the things I do say about me, not what the things are themselves. So push yourself in whichever directions you’d like to grow. And write it down, so you can reflect on the person you were the year before. It’s fun, trust me. ", "title": "2015 retrospective: wins, losses, and lessons learned", "sentences": [{"de0d": "2015 retrospective: wins, losses, and lessons learned"}, {"2013": "I’m writing this retrospective in public because it’s important for me to create accountability outside my own head, and I’m a Snake Person who’s fairly comfortable with oversharing."}, {"2bf7": "365 days ago I wrote a list of goals for 2015—emphatically not “resolutions;” these goals were concrete, achievable, and reflected a particular vision for the life I want(ed) to lead. This was my list:"}, {"bdb8": "In 2015 I will…"}, {"5430": "This is a pretty solid list. It’s made up of a mixture of financial, health, and lifestyle goals, with some creative ideas thrown in there as well. Together, these goals paint a picture of the person I wanted to be in 2015:"}, {"fb3d": "Writing this down now, there are some glaring inconsistencies and “gotchas” that come to mind, but let’s see how I did."}, {"cf70": "Run the Spartan Race: ✅"}, {"f2b1": "The Spartan Race is one of these currently-in-vogue obstacle course races—the Spartan is known for being particularly gnarly. This goal was all about me committing to a feat of physical fitness and doing something a bit scary, but not really dangerous."}, {"a8ed": "I signed up in February for the Toronto Spartan Race, which was held at Brimacombe ski resort. It was 30℃ and we ran 5 kilometres up and down the mountain. It was awful and fantastic; I will be doing it again in 2016."}, {"6662": "Camp in a national park ✅"}, {"4a58": "Somehow I’d never camped outdoors in a national park before now, which is something I’ve wanted to do for ages. I like the idea of camping a bit more than actual camping, so this year I wanted to leave glamping behind and get in some real tent time."}, {"92f1": "A buddy and I went to Torrance Barrens Dark Sky Preserve (near Gravenhurst) and camped overnight. It was a great experience to leave the city lights behind and really rough it for a short while."}, {"b6d4": "Gain 10lb 🌀"}, {"17bd": "Wait, gaining weight as a yearly goal? Yes. This goal is a metric aimed at getting me to the gym, eating healthily (more), and putting on some much needed pounds. I ended 2015 only gaining ~7lb which isn’t so bad. And I definitely got stronger. Onward and upward."}, {"50d9": "Eliminate my debt ❌"}, {"2662": "Bahahahaha! I don’t have a lot of debt, but it’s enough that by April or May I realized this goal wasn’t really achievable. I’ve made some good progress, paying off the provincial portion of my student loans, eliminating old unpaid accounts and crushing credit card debt. I should be debt-free by the fall of 2016!"}, {"75d2": "Save a $10,000 safety net❌"}, {"3eef": "This goal is very achievable, and I almost did it, except for the aforementioned debt, and spending the majority of my savings in the process of moving to, and setting up, a new apartment."}, {"36af": "Not nailing this goal is pretty bad, a dual-income household with no kids and great jobs should have no problem setting up a safety net. This is priority number one for 2016."}, {"31b8": "Read 12 books 🌀"}, {"17e5": "Not even close. I started out strong, reading 3 books by March. Then totally didn’t read all spring and summer. I closed out 2015 having read 6 or 7 books, depending on how exactly you count. This figure includes audiobooks."}, {"2e83": "I used to read so much more when I was younger, and this is still important to me. It’s much easier to turn to Netflix or the internet instead of reading books. I want to break those habits."}, {"3aeb": "Leave North America ✅"}, {"1b85": "This was a big one—I wanted to do some serious travelling in 2015, and I did! I spent 2 weeks in Iceland in April, when it was still definitely winter. It was magical, I’ve fallen in love with the country and can’t wait to go back. Worth noting that we almost died in a freak snowstorm, nearly overturned our Land Rover in a freezing river, and camped several nights in sub-zero temperatures. Iceland was the best."}, {"d7b1": "Write a book of recipes 🌀"}, {"3fcf": "I’m pretty serious about cooking, and have been working on writing up original recipes all year. I haven’t gotten anywhere close to writing a book (or a cooking blog for that matter) and this is firmly in the “started, will continue in earnest” category."}, {"d40b": "— — — — — —"}, {"c6c3": "The final tally is: 3 goals met, 2 goals failed, and 3 goals partially met (i.e. failed but I got something done)."}, {"cba9": "I’m drawing some pretty clear conclusions from the data. I’m not great at managing money and debt, or keeping my nose to the grindstone to get solid work done—but I’m fantastic at finding exhilarating, fun activities that satisfy the novelty-seeking side of my ADHD brain."}, {"b64b": "2015 was the first year in my adult life that I had the ability (fiscally and emotionally) to allow myself to indulge in my thrill-seeking side. 2015 was my ultimate year of #treatyoself. So I think that’s OK. I’m not beating myself up about it."}, {"af60": "I didn’t meet all the goals I set, especially the important grown-up ones, but thinking back to the intent of my list, I feel good about who I was in 2015. I’m not making a list of concrete goals this year — instead, just a template to guide my decisions. This is who I want to be in 2016:"}, {"5856": "An adventurous thrill-seeker"}, {"4bda": "Maybe just on the weekends. Turns out I don’t have anything to prove."}, {"945c": "Fiscally responsible // Domestic"}, {"3af2": "I’m engaged and we have 2 pets. We just moved into a new apartment and steady jobs. Time to learn how to run a household, and run it well."}, {"a7d2": "Someone who pushes their physical limits"}, {"93e2": "I’m not getting any younger, and I’m not particularly fit. This is important."}, {"4ada": "Productive and creative"}, {"aa27": "Hobbies are good, especially ones that are creatively fulfilling. I’ll be writing and building more in 2016."}, {"2236": "A million blog posts about resolutions will tell you to be specific, but I’m not sure specificity works for me. For my personal goals, it matters more what the things I do say about me, not what the things are themselves. So push yourself in whichever directions you’d like to grow. And write it down, so you can reflect on the person you were the year before. It’s fun, trust me."}], "child": "992_1"}