{"name": "994", "parent": "", "content": "Gym Dandy Girlfight As I struggled to put on size ten jeans from my favorite brand, I thought about my goals for the New Year. Top of the list is, “Go to the gym more often.” Notice that isn’t, “Join a gym.” A year and a half ago, when I was working at a temp job that I thought would turn into a permanent position, I joined a local gym that I had been walking past for years. Two weeks after I joined, I lost my job. But even with no income except unemployment insurance and the occasional house sitting job, I could still afford the $9.95 monthly fee. Getting there was no problem, as I could catch a bus there any time of the day. Mid-mornings were the best, as it was never crowded and I didn’t have to wait for a machine. When I got a full time permanent job in June, it disrupted my exercise regimen. Even though my gym was only six miles from my office, if I left work at 5:00 PM, the earliest I could get to the gym on public transportation was 6:30 PM. By car, the gym was only twenty minutes away. I thought about getting a car, but did I want to pay a monthly $300 car payment so I could get to my $9.95 gym? I struggled to get there three times a week: Sundays, Wednesdays, and Fridays. Usually, I only made it on Sunday and Friday. After the start of Daylight Savings Time my visits waned to only Sundays. Once I moved a few miles further away, my workout dwindled to every other Sunday. And soon I could no longer fit into those black jeans. But a New Year is upon us, the time to start anew or renew old promises. How could I financially and logistically make it to my gym at least three times a week? I could join a gym that is closer to my job or my home. But the only ones around are part of large chains, making them more crowded and more expensive. One of my co-workers pays $50 a month for the privilege of sweating her stress out in organized classes. But I’m not interested in Zumba, Boot Camp, or any other activity that involves following a leader. I like my gym because it is small, adults-only, and most people are there to work out, not to socialize or pick up a date for the evening. There isn’t even a snack bar, just a vending machine with water and energy drinks. I feel comfortable at my gym and I have no desire to have to reestablish my comfort zone at another facility. Maybe I could take Lyft to my gym. A one-way Lyft trip from my job would be around $7 plus tip. Since I usually give a $5 tip, a Lyft trip would cost me $12. But then, I would still have to take two buses and a train to get home. Taking Lyft both ways would reduce the money in my wallet by at least $26. Going to the gym three times a week would cost $78, more than the utility payment at my new apartment. Zipcar is also an option. Zipcar rentals start at $8.95 an hour. My gym workout is usually one hour, so I could rent a car for two hours for less than $20. But since there are no Zipcars near my workplace, I would have to spend 30–45 minutes on the bus getting to a Zipcar location, which means that I wouldn’t start my workout until 6 PM. After dropping off the car at 8:00 PM, I would have to wait for a bus home and eventually arrive at 8:30 PM. At $60 for three days of rentals, Zipcar doesn’t appear to be much better than Lyft. Then there is the final option: buying a car. With my less-than-stellar credit, I would be unlikely to get a monthly payment of less than $300. With a car, not only could I get to the gym and get home in 20 minutes each way, I would have the freedom that only comes from your own set of wheels. But unlike the other modes of transportation, the buck doesn’t stop there. Registration, insurance, a car club membership, and other expenses could bring car-related expenses up to $500 a month. Is freedom worth $500 a month, when added to rent, utilities, student loan payment, health expenses, toiletries, and other incidentals? With all of those expenses, I wouldn’t need to go to the gym to lose weight, as I couldn’t afford to buy groceries anyway. So I guess that for now, I’ll just resolve to get to the gym in the cheapest way possible and count the days until Standard Time. Maybe I’ll go today … Beatrice M. Hogg is a coal-miner’s daughter and freelance writer who was raised in Western Pennsylvania and has lived in Northern California for twenty-five years, where she wrote her novel, Three Chords One Song, and continues to write about music and life in general. ", "title": "Gym Dandy", "sentences": [{"effc": "Gym Dandy"}, {"e810": "Girlfight"}, {"d10a": "As I struggled to put on size ten jeans from my favorite brand, I thought about my goals for the New Year. Top of the list is, “Go to the gym more often.” Notice that isn’t, “Join a gym.”"}, {"bf9b": "A year and a half ago, when I was working at a temp job that I thought would turn into a permanent position, I joined a local gym that I had been walking past for years. Two weeks after I joined, I lost my job. But even with no income except unemployment insurance and the occasional house sitting job, I could still afford the $9.95 monthly fee. Getting there was no problem, as I could catch a bus there any time of the day. Mid-mornings were the best, as it was never crowded and I didn’t have to wait for a machine."}, {"2c16": "When I got a full time permanent job in June, it disrupted my exercise regimen. Even though my gym was only six miles from my office, if I left work at 5:00 PM, the earliest I could get to the gym on public transportation was 6:30 PM. By car, the gym was only twenty minutes away. I thought about getting a car, but did I want to pay a monthly $300 car payment so I could get to my $9.95 gym?"}, {"aa44": "I struggled to get there three times a week: Sundays, Wednesdays, and Fridays. Usually, I only made it on Sunday and Friday. After the start of Daylight Savings Time my visits waned to only Sundays. Once I moved a few miles further away, my workout dwindled to every other Sunday. And soon I could no longer fit into those black jeans."}, {"ed5a": "But a New Year is upon us, the time to start anew or renew old promises. How could I financially and logistically make it to my gym at least three times a week?"}, {"457c": "I could join a gym that is closer to my job or my home. But the only ones around are part of large chains, making them more crowded and more expensive. One of my co-workers pays $50 a month for the privilege of sweating her stress out in organized classes. But I’m not interested in Zumba, Boot Camp, or any other activity that involves following a leader. I like my gym because it is small, adults-only, and most people are there to work out, not to socialize or pick up a date for the evening. There isn’t even a snack bar, just a vending machine with water and energy drinks. I feel comfortable at my gym and I have no desire to have to reestablish my comfort zone at another facility."}, {"aa16": "Maybe I could take Lyft to my gym. A one-way Lyft trip from my job would be around $7 plus tip. Since I usually give a $5 tip, a Lyft trip would cost me $12. But then, I would still have to take two buses and a train to get home. Taking Lyft both ways would reduce the money in my wallet by at least $26. Going to the gym three times a week would cost $78, more than the utility payment at my new apartment."}, {"7ccc": "Zipcar is also an option. Zipcar rentals start at $8.95 an hour. My gym workout is usually one hour, so I could rent a car for two hours for less than $20. But since there are no Zipcars near my workplace, I would have to spend 30–45 minutes on the bus getting to a Zipcar location, which means that I wouldn’t start my workout until 6 PM. After dropping off the car at 8:00 PM, I would have to wait for a bus home and eventually arrive at 8:30 PM. At $60 for three days of rentals, Zipcar doesn’t appear to be much better than Lyft."}, {"7a92": "Then there is the final option: buying a car. With my less-than-stellar credit, I would be unlikely to get a monthly payment of less than $300. With a car, not only could I get to the gym and get home in 20 minutes each way, I would have the freedom that only comes from your own set of wheels. But unlike the other modes of transportation, the buck doesn’t stop there. Registration, insurance, a car club membership, and other expenses could bring car-related expenses up to $500 a month. Is freedom worth $500 a month, when added to rent, utilities, student loan payment, health expenses, toiletries, and other incidentals? With all of those expenses, I wouldn’t need to go to the gym to lose weight, as I couldn’t afford to buy groceries anyway."}, {"acb2": "So I guess that for now, I’ll just resolve to get to the gym in the cheapest way possible and count the days until Standard Time. Maybe I’ll go today …"}, {"cfa9": "Beatrice M. Hogg is a coal-miner’s daughter and freelance writer who was raised in Western Pennsylvania and has lived in Northern California for twenty-five years, where she wrote her novel, Three Chords One Song, and continues to write about music and life in general."}], "child": "994_1\t994_2\t994_3\t994_4\t994_5\t994_6\t994_7\t994_8\t994_9\t994_10\t994_11\t994_12\t994_13\t994_14"}