{"parent": "11", "title": "", "id": "2931fb678335", "name": "11_5", "content": "The inescapable navel gazing at the plight of “economically insecure” whites, the high school drop out coal miners, and opiod addicts of Appalachia ignores one glaring fact. White people squandered at 100 year+ head start called Jim Crow Terrorism, and the giant thumb on the scale of economic progress that occurred from 1945–1965 when black vets were excluded from FHA loans, educational benefits of the G.I. Bill and a host of goodies extended to many, but not all those who fought Hitler. My father, Captain Bottoms was on Omaha Beach but his bravery did little to ensure access to all the opportunities that built suburbs like Sunnyvale. The golden future offered to white men in what became Silicon Valley. Apple, HP, Google and all the rest would not exist without the wave of college education & small business loan dollars available to white men from 1945–1965. The factories and manufacturing glory days the Trump voters long for wouldn’t for the most part have existed without the leg up their grandparents and great grandparents got from Jim Crow terrorism and the G.I. Bill. Yet, with all that help, even with a twenty year headstart on the 21st Century the mighty engine of capitalism has faltered. And right on cue, white people are demanding they be made whole first, that they be dug out of the hole that greed and corruption on Wall Street threw them in. And screw the black people and others of color who are in the same situation or worse. The only difference between the mobs of the 20’s & 30’s lynching their economic competition and now they no longer say nigger, and they’re willing to let prison do for them what public hanging can no longer. The election of Donald Trump is more-ness at its most extreme, and even white who voted for Barack Obama once or even twice know when it’s time to demand they get theirs and the hell with the rest. ", "creatorid": "b1d83f1ac3e8", "timestamp": 1492093310929, "child": "", "username": "rbottoms"}