{"parent": "11", "title": "", "id": "23103354e6f2", "name": "11_8", "content": "When you open with “white people are not…”, I already know this is to be yet another exercise in racism-with-impunity like so many which have become requisite fashion statements in recent times. I don’t always cite sources or try and back up my opinions with facts either, so no problem there. Nothing really wrong with generalizing and summarizing, sometimes these are just a way to cut to the chase and come to the point, to get close enough to the truth to have a reader feel confident they can make it the rest of the way on their own from there. But this business of what “white people” do or don’t do, think or don’t think, feel or don’t feel, based purely on one person’s bigoted assessments, is just plain over the top. What, exactly, is a “white person”? Have at it, I’m all ears. You can explain to me what exactly an Irish-descended union steelworker in Boston has in common with a Greek-descended transvestite wait-er-ress in San Francisco, or a Polish Catholic in Krakow with a pale-skinned Ashkenazi in Tel Aviv, or while you’re at it, me with any of the above or even with my own next-door neighbor. And from up there on your high horse you can take into account that you almost certainly make more annual income than I do, own more assets than I do, and have more financial security than I ever will. Almost all of the “POC”s I ever met in my life have. I’ve had “white privilege” explained to me by the son of a dentist and a professor whose skin was nearly as pale as my own but with hair a tad more kinky, by native Americans sitting in brand-new one-ton pickups and carrying blood-quantum cards entitling them to free health care, by Chicanos whose families have owned the land they live on tax-free for two and a half centuries, and frankly, it never quite added up to me how I was somehow the holder of this mystic “privilege” when try as I might and turn my house inside out looking for it, I can’t seem to find that sucker. Ask for more, my ass. I make do with less because “more” as offered by a way of life based on permanent debt and being beholden to government, is a lie and a soul-killing man-trap. I don’t ask for the right to live on ten grand a year and be left alone by regimes and bureaucrats, I demand it. Whatever it is in trade that you allow them to seize a percentage of your income for and spy on you in the bargain, I never wanted in the first place and wouldn’t take it if it arrived FedEx on my doorstep. So you can keep your everyday racism, it isn’t any threat to me, just yet another silly annoyance coming from a mindset that demands the privilege of seeing the world inside out and taking the opposite of every obvious truth as your own reality, because it amuses you. It is your privilege, to do so, and don’t let me stand in your way. I couldn’t even if I tried. ", "creatorid": "bdc93f756837", "timestamp": 1492100911534, "child": "", "username": "framersqool"}