{"parent": "188", "title": "", "id": "d9e951d1eff8", "name": "188_8", "content": "Thanks for the great read, it’s a topic we really need to address more seriously. I don’t necessarily agree with hoarding your best ideas, personally I want my ideas to get out there and to be used. I’m less concerned about personally benefiting from my ideas than I am about getting them out into the world. Within reason of course. That being said, I completely agree with the “cult-agencies” perspective. Burning through employees doesn’t mean you are kicking ass and taking names, it means you have a broken business. You are compensating for broken process, poor client management, etc., by taxing your employees instead of solving the actual issue. However, frankly, I think we have a responsibility in this as well. It seems to be the trend to actually BRAG about the crazy hours, stress, and just flat out tough work. “Oh man I’m working on this sick project but it’s a crazy deadline so I’ve been burning the candle at both ends for like 3 months! 70 hours a week dude, but I’m stoked!” As their life begins to fall apart. In other words we are fostering this culture ourselves, which is arguably an even bigger problem, in my opinion. My advice, unless you are breaking into the industry, try not accepting jobs that demand 40+ hours every week, even if the pay is less! After all, if you accept the job, you are declaring you are fine with the crazy work load. Yes once in a while any of us will need to pull a 60-hour week, but the norm sure as hell should be 45 or less in my book. Don’t forget, requiring over 40 hours without extra pay (yes, even when you are on salary, though it’s somewhat looser) is in fact illegal, for whatever that’s worth. If everyone demands reasonable hours by simply not taking offers at places where that’s acceptable, then company’s will begin to compete for talent on work/life balance, not compensation and whether Nike is on your client list or not. I know that at least in Portland this is beginning to happen, however Portland is one of the most competitive markets for creative talent so any edge an agency can have they are taking. ", "creatorid": "e9485e57657e", "timestamp": 1452725841547, "child": "", "username": "donisflying"}