{"parent": "209", "title": "", "id": "c1bab06fdd08", "name": "209_3", "content": "I’d have to say Sometimes a Great Notion, by Ken Kesey is one of those books for me — both the way it’s written as well as its subject matter. I’d say I hate to toot my own horn, but since clearly I don’t, I encourage people to check out Cherry City Pulp, my first novel. I guarantee you’ve read nothing like it before. Blurb is below. Casey McGregor is a high school sophomore living in Salem, OR who lost the birth lottery — abandoned by his mother to an alcoholic father, he wastes time playing Call of Duty and shooting “stuff” in his back yard. A friend of the homeless, hopelessly bullied at school, Casey manages to do well enough, trying simply to ride everything out until he can graduate and leave for college.But the shootings have drawn the attention of the police and young lawyer Courtney Lawson, who’s forced to go on ride-alongs to learn Salem’s beat — and ensure the cops don’t foul up the DA’s investigations. As the inquiry continues with no suspects, Lawson muses on her past and the contradictory and often confusing world of men and relationships.Removed from the controversy and born lucky, Hunter Foxx, playboy star shortstop for the San Francisco Giants heads home to Cherry City for the offseason thinking of women, fishing, and some well-deserved vacation. Little does he know Salem has it’s own black hole for him: 17-year-old Destiny Smotherman — a generational beauty, young, voluptuous, and innocent, complete with a fake ID and a nose for trouble.Like Casey’s father, Mr. Scott — his teacher — likes to drink. However, he loves his students and is well liked by most everyone — except for North’s administration, who don’t take kindly to his emails about student safety. Black clouds gather, and Mr. Scott soon finds he either needs to keep his mouth shut or kiss his job goodbye. As the tale wends and weaves, our characters’ stories become intertwined, stakes are raised, and justice is doled out to all involved, culminating in an American tragedy with which we’ve become all too familiar…A whirlwind of satire and social commentary, Cherry City Pulp is at once familiar and foreign, boldly challenging the reader’s notion of what is — and is not — moral, right, and just. ", "creatorid": "e6f36490cf30", "timestamp": 1491511208172, "child": "", "username": "chuckingrocks"}