{"parent": "214", "title": "", "id": "7f77209f34cc", "name": "214_14", "content": "Judy, this is a fair and valid concern and one that I’ve shared myself when considering taking up journaling. I’ve recently decided to take the plunge and embark upon the path blazed by Darius Foroux so I wanted to share my own thoughts on this topic in the hopes it might help convince others on the fence to take up journaling themselves. Essentially, I think it can be mitigated using one of three general approaches with varying degrees of complexity: Easy Approach: I think it matters more that you journal on any topic consistently than journaling about the most significant thoughts you may have on a given day. The journey of a thousand miles begins with a single step, after all, so consider journaling about only topics that you would be comfortable being discovered by others. You don’t have to share them, and the odds are unlikely that anyone would bother to go through the trouble of finding and exposing our journals unless we’re famous (which I have little risk of ever becoming).  Starting small and just getting into the habit of practicing journaling every day will likely begin producing benefits even if we don’t write our deepest and darkest secrets or intimate personal thoughts (though I do think that being rigorously open and honest in the process produces the “next level” benefits that Darius describes in some of his posts so be open to the idea of going deeper with what you write about…at least at some point in the future). This technique eliminates the risk of anyone discovering potentially embarrassing (to you or others) content but sacrifices some of the benefits that you might get from journaling everything that you might want to write about. You can still save them and review and reflect upon your thoughts so you’re still likely to achieve many of the positive benefits of journaling and may represent a good tradeoff given how easy this approach is to undertake.Medium Complexity: Keep your journal in a physical notebook (I’m a fan of Moleskine notebooks but any type will probably suffice. I’d recommend going with a brand & type that you can keep using forever. Always using the same journal notebook will help it become part of your routine and improve the odds of developing a regular habit. I think over time that consistency will also make it become a natural extension of yourself (you’ll feel naked without it so the risk that you forget to bring it with you when you travel or otherwise won’t have it on you when you want to capture something important is low). When you fill your current notebook up, replace it and store the full one in your home safe, safety deposit box, or pick up a fire-proof storage box on Amazon for under $50 and use it to store the old notebooks. They’re such an inexpensive and easy tool to protect important paper records and digital backups that you may want to consider getting one even if you don’t journal — passports/CD-R’s/birth certificates are easy to lose / destroy after all… Although it might be “ideal” to save every one of your journals forever, practically speaking, I’m guessing it’s not a big deal to destroy the older ones after you’ve had some time to review and reflect on them. This approach allows you to achieve all of the benefits of journaling, though you sacrifice some of the longer-term benefits of reflection and retrospective that having your entire journal available to review at any time may offer. This is also probably a good tradeoff for anyone who’s not naturally inclined to the more technology-oriented approach below and as a nice side benefit you’ll have a safe environment to store other sensitive and important documents and artifacts that may currently be vulnerable to loss or fire damage.Technical Solution: This approach leverages common tools that are both inexpensive and relatively easy to use. I cover the two utilities I personally prefer to use, but any alternatives that support strong encryption will work. The core idea is that you use a password manager that is available on all your computing and mobile devices (I use 1Password, though I’ve used LastPass and it’s ok even though it’s not my personal preference) to generate a very strong password that you never have to remember and then use that password to encrypt your journal entries in whatever app you use to write your journal. I use Evernote everyday for all my note-taking and research needs because I love the interface, it’s really inexpensive, it has apps for every platform (and a website interface as a backup) PLUS it supports right-clicking any text in a note that you create and securely encrypting it with a single click — even Evernote can not decrypt the contents.  To be clear — you don’t need to use a password manager — Evernote allows you to enter any passphrase when you encrypt the content of a note and even offers a hint you can save to help you remember your password. For some use cases this may be acceptable. That said, using a password manager is the best way to ensure privacy and security so it’s the recommended best practice. You also have don’t have to use Evernote, but so far it’s the only easy to use note-taking system I’ve discovered that doesn’t actually store the key used to lock up your data, so it is impossible for even their own staff to access your encrypted content. Day One is very easy to use, but they store your keys and can unlock and access your data so I wouldn’t recommend using them for anything you really want to keep private. I should clarify that I am a programmer and information security nerd so my personal preferences don’t represent the vast majority of users but I also provide tech support for most of my family so I’m pretty sensitive to ease of use when it comes to these features :) All that said, the easiest and most secure way to journal is probably to use a paper notebook and either store them in a safe or just don’t write anything down that you don’t want to be public. Either option is pretty cheap and convenient and offers most of the advantages one can expect from consistently keeping a journal updated on a daily basis. ", "creatorid": "9aa481ce1a78", "timestamp": 1472380439610, "child": "", "username": "beejhuff"}