{"parent": "21", "title": "", "id": "d2f1ff7aba02", "name": "21_7", "content": "According to standard metrics, I am overweight. I know this, am aware of this, and have regular discussions with my doctor that surround health and wellness. I have lost 60 pounds in 18 months, and have about 60 more to go before I’m at my ideal. The mental health aspects of this kind of weight loss are key — your identity changes as you become focused on health and wellness, as you learn new strategies to cope with your emotions, and you learn that you don’t need to hide behind a layer of fat to feel safe (this was the point for me). Telling people they’re fat isn’t helping any of those things — fat people KNOW they are fat. We are well aware that going into stores is a minefield, and that a size 16 is not consistent across the board. And don’t even get me started on the fact that the majority of plus sized womens clothing thinks you still have relatively slim legs and carry your weight around your waist (I’m the opposite, a classic pear shape with a small waist). Regardless of all of this, I live my life believing that compassion is key. I believe that I can have conversations surrounding weight loss in a constructive, kind way, and help people find the right supports for them, whether it be dieticians, medical professionals, medications, exercise plans, or mental health counselling. I can do all of these things without shaming them. So — when is it appropriate to intervene in an overweight persons life? For me, my boundary would be that you must at least know my name to be able to give me unsolicited advice. For others, they may accept advice from strangers, or others only from a qualified professional. Others will watch people’s weight loss journeys on blogs and social media, and then take their advice quietly, in the comfort of their own homes, at their own pace. This was an excellent piece, and the people who are arguing in the comments are missing the entire point. ", "creatorid": "493dcdbe9e3a", "timestamp": 1492047302739, "child": "", "username": "jessschwendinger"}