{"parent": "232", "title": "", "id": "bd9b9cba8414", "name": "232_4", "content": "While I wholeheartedly agree with this statement, “every company that spends money on advertising will be forced to find a new way to do business”, I know from my experience in managing a media organization that people typically refuse to pay for access to information on the web. I also agree that the traditional advertising model that’s long supported publishers and social platforms across the web is on its way out the door as well. People just block the ads with ad blockers anyway, and the extent of their use will only continue to climb. While people often do enjoy the ad free experience of a paid subscription, the problem is getting people to want to pay, and in many cases people simply cannot afford to pay. Also, putting up paywalls blocks the webs poor from gaining access to information, as many cannot afford to pay even a $1.99 a month to access the latest stories on their favorite news sites. When it comes to paid subscriptions, no one has yet to be successful at it. When you compared games within this article, that’s not a subscription to a news site, that’s a paid for app, and there’s a huge difference. Google too is getting ready to push more subscription based models with the introduction of YouTube TV, after they realized no one is willing to pay for YouTube Red. It’s been a total flop. And even that may not work as millions of Americans are ditching their cable subscriptions as more of us fall deeper into poverty. So while our traditional advertising models are no longer sustainable, the world of online media has a serious problem on its hands, no one wants to pay, and no one likes ads. While WSJ and The New York Times may be gaining some subscribers, they’re actually alienating millions more who’ll just hit the back button and get their news somewhere else. Others who’ve tried the paywall route failed, including Destructoid, who asked their visitors to subscribe to a paid subscription after they lost so much money from ad blockers they were on the verge of shutting down. No one subscribed. And yet other publishers who continued their reliance on ad based revenue streams saw all their revenues evaporate and ultimately shut down. One of the world’s most visited gaming news sites Joystiq is now officially dead for this very reason. Sure, there’s people out there who can afford to pay for access to content, but they’re few and far between. I’m the guy running a media organization, and I cannot afford to pay, so what’s to make me think someone else can? All I got for serving the news to millions was tens of thousands of dollars of debt, with no revenue to support my work. Besides that, the average American is struggling just to survive today, and none of us are making the $60K incomes anymore that we once took for granted. In 2005 I lived on a quarter million dollars a year, today I live on Ramen noodles. While I appreciate the ideas you portrayed in the article (an awesome read that really made me think), I can’t agree that the paid subscription model will somehow save the web. If things were to change economically, it could be possible, but at present we’re facing decades of economic decline, and the average American hasn’t the money to pay their electric bill, much less for access to information across the web. ", "creatorid": "a07881e11f32", "timestamp": 1490683608134, "child": "", "username": "webguru4real"}