{"parent": "232", "title": "", "id": "643f3cdd972b", "name": "232_2", "content": "While I think you have a point regarding traditional advertising being a dying industry, I don’t have your faith in a subscription-based system as the revenue making way of the future. There simply is an inevitable threshold about the amount of subscriptions one can afford. Let’s not forget that an internet subscription is usually needed before one can stack on these other subscriptions. I have no idea about the pricing of this in the US, but in Europe I’d say you should be able to get base level access to the internet for 30–50 euro a month. Netflix, Spotify, Amazon Prime and other services come on top of that. You’re easily talking about 100 euro a month for internet and basic mainstream subscriptions. The problem is as well that we’re seeing more and more fragmentation in subscriptions. While Netflix was the first and the biggest of the video subscription deals, with Amazon and others now entering that market, it looks more and more like media isn’t being consolidated into one platform, but into multiple ones. Instead of Netflix rising in price to let’s say 20–25 euro, to accommodate for the increased content available, we see more and more platforms shoot up that all have a 10–15 euro price point for access to content scattered around multiple logins, apps and methods. A great example of this is the streaming market for professional wrestling. Every pro wrestling organisation has basically it’s own streaming channel, at the same 9(.)99 euro/dollar/yen price point, leading to wrestling fans who want to follow all the top level products shelving out something between 40–50 euro a month to get full coverage. Everything is available, but if you’re one a budget you get stuck with the same product and very little variety. It’s also a horrible user experience to have different types of interfaces, terms & conditions and supported devices for every subscription. I believe that with subscriptions you will hit market saturation really quickly. People can only spend so much on recurring bills every month before they have to heavily cut in their monthly spending. Most people, especially post financial crisis, don’t want to be on the hook for a large portion of their income to go to subscriptions. Another problem is that if eventually one subscription for audio, one for video and one for text would emerge, they would be effective monopolies, probably driving up prices and not delivering quality content. So either consumers are stuck with multiple services that add up to be expensive, or end up with a monopoly that will be expensive. It’s a horrible trade off between a lousy experience or lower quality content. While there can be benefits, I think you’re talking up the willingness to be stuck to a subscription a bit too much, especially for a lower income bracket. ", "creatorid": "f5ee5e47fff1", "timestamp": 1491659601697, "child": "", "username": "ferdylijftogt"}