{"parent": "25", "title": "", "id": "bfd80e91df14", "name": "25_25", "content": "IMO this is a two horse race Lebron is great best player in the league but this year Russ and Harden have had better all around years. IMO Kawhi is extremely overrated at least as an MVP candidate he benefits from having the best coach in the league, his quantifiable numbers pale in comparison to all the other MVP candidates outside of scoring and the Spurs system allows for his metoric rise (this is a personal opinion, I think Kawhi is a top 10 player in this league but to me he is not a realistic MVP candidate) Anyway Here’s my pro- Broadie argument using a combination of common sense, the eye test AND advanced stats It’s difficult to get a triple double You can’t just trip and fall into one. To get 42 of them and average one over the season…while also leading the league in scoring (2+ points more game than Harden) — being 3rd in assists (not even 1 less assist per game than Harden, and if you do the numbers per 100 possessions Hardens lead is less than .3) — grabbing the most rebounds by a guard over a season ever and being 9th in the NBA in that stat at only 6'3 (2+ rebounds more per game than Harden) — leading the league in PER (advanced stat) — having less turnovers than Harden despite having BY FAR the highest usage rate in NBA history — Leads the league in estimated wins added (advanced stat) — having a higher plus/minus than Harden (offensive and defensive) (advanced stat) — having a higher Value over replacement than Harden and leading the league in that stat (advanced stat) — Having a better assist percentage than Harden (since everyone tried to make it seem like Hardens less than 1 assist per game advantage is a big deal) There are more points but this is the crux of my argument. Westbrook is your MVP folks! ", "creatorid": "fcdd71e49cb6", "timestamp": 1492125326777, "child": "", "username": "GWPtheTrilogy"}