{"parent": "25", "title": "", "id": "941f1bc853f5", "name": "25_24", "content": "Here are the real reasons Westbrook should be the MVP: Entertainment value:  2. He’s got some acting chops and can make fun of himself:  3. His incredible sense of style:  Who will get the last laugh?  Oh yeah, then there are a bunch of basketball related reasons Westbrook should be the MVP: Westbrook plays in a bad system, surrounded by mostly bad 3-point shooters. You can argue all you want about OKC choosing to let Westbrook go one-on-five the entire season, but there was a guy who used to do the same thing in Cleveland, and nobody argued about his MVP worthiness. Think about the degree of difficulty involved when you have only one player on the floor who can shoot from beyond the arc— every team focuses on packing the paint to stop Westbrook, or try to take the ball out of his hand. And yet he has won these game-within-a-game battles over the entire season. (By contrast, Harden is surrounded by good 3-point shooters at all times who spread the floor. All he has to do is run a pick and roll every play to get an easy option — free jump shot, open lane to the rim, or unguarded 3-point shooter.)Harden represents so many things that fans hate about basketball: constantly forcing the refs to decide on block/charge calls because he initiates contact; slowing the game down at the free throw line; flopping; no defense (he’s better this year, but should he be rewarded after all those years of matador defense?); and always pushing the line with traveling. (Although Westbrook wins the award for the best travel of the year!)Westbrook’s efforts are better than Harden on the defensive end. He’s top 10 in defensive win shares (only .1 behind Kawhi Leonard and virtually tied wth DeAndre Jordan). He’s #2 in Defensive Box Plus/Minus (4.7), behind only Draymond Green (4.9). His defensive rating is in the top 15. And he has a slight edge in stealsOn offense, Westbrook has a slight edge over Harden in assist to turnover ratio, assist percentage, plus/minus, value over replacement, points, and PER. Harden has the edge in offensive win shares, assists, and true shooting percentage.Westbrook is the choice of the players.Westbrook has made every game of the season memorable with his unstoppable energy and aggression.Won-loss records are misleading. Forget about Vegas over/unders. Houston won 41 games last year with a totally dysfunctional line up of crybabies, old fossils, and mindless gunners. They got rid of Howard, Montiejunas, Josh Smith, Jason Terry and Beasley and they brought in Gordon, Anderson, Nene and and Williams. They brought in a new coach who blended the talent that was hand picked to work in his favorite system. The only question was if Anderson and Gordon could stay healthy. They did. Houston’s turnaround was magnificent, but D’Antoni has made average guards look like All-Stars, and turned great guards into MVP candidates. The idea that you can’t vote for an MVP if his team doesn’t win 50 games is as arbitrary as saying that the best player on the best team should always be the MVP. OKC lost an MVP winner and won eight less games this year.Interchangability. Other than a young Lebron, no player could do what Westbrook has done this year. It’s a physical impossibility to match his energy and relentlessness. But if Westbrook played for Houston, the only question would be if he could make the mental adjustment to defer to his teammates. Nobody can read minds, but if Westbrook led the league in assist percentage, and was #3 in total assists, my guess is that he wouldn’t have too much trouble deferring to shooters like Gordon, Beverly, Ariza and Williams. Considering he ended up shooting almost as well as Harden from the 3-point line (a difference of .003%), my bet is he could adapt to the D’Antoni system easily. The MVP race is razor thin, and sadly, we won’t know the ballot results until after the Rockets and Thunder play their first round series. It would have been awesome to see the players’ reactions, like Shaq destroying Duncan in 2002, or Olajuwon dominating Robinson back in the day. ", "creatorid": "e1924bab9e2d", "timestamp": 1492146515649, "child": "", "username": "lonshapiro"}