{"parent": "263", "title": "", "id": "6482bba1a700", "name": "263_16", "content": "As a Gray Wolf it’s nice to see a politics post on the Ringer that acknowledges other politics exist than the useless Democratic party line. And of course, there are libs who don’t get it. We were told ‘SHE WAS ELECTABLE’ and ‘NASTY WOMEN VOTE’, her entire message was ‘Trump is a big meanie!’ Never about anything about how she was going to help people, since she had a ‘blue wall’ and it was all just a formality. She just wanted to run up the score. Never mind the fact that millions of people in America and particularly in the Midwest have seen their quality of life visibly drop in their lifetimes, or that people around the country are justifiably concerned about affording health insurance because prices rise and their pay doesn’t. There’s real concern about things like drugs, because tens of thousands of people are dying each year from heroin (or similar) overdose. I recognize there is an issue of optics given the background of the messengers. I, like many normal people, don’t have the luxury of rich parents or the ability to just pack up and move wherever I like. But I forgive Menaker because he found Letters to Caleb. Libs just live in a fantasy world separate from the rest of the country. It’s not really a coincidence that states flipped in 2016, considering the map of economic recovery from the recession. Large swathes of the country never recovered at all from the recession. Plus, Hillary Clinton and the Democratic Party, last I checked, have lower approval ratings than Donald Trump and the Republican Party. No one likes libs. Maybe they could recognize this and learn to shut up and actually listen when people say they have grievances, but they know best right? Schumer told us the strategy. “For every blue-collar Democrat we lose in western Pennsylvania, we will pick up two moderate Republicans in the suburbs in Philadelphia, and you can repeat that in Ohio and Illinois and Wisconsin.” How’s that ass taste? Libs disgust me. You’d think libs who dedicate their lives to politics would at least be good at it. Instead they lost 1000 elected seats across the country over the past 8 years, and instead of accepting they are both reviled and bad at their jobs they shriek about Russia because yass slay queen couldn’t have possibly lost because she’s a shitty candidate. She was ‘qualified’ and the only reason anyone wouldn’t vote for her would be because they are a racist and sexist Russian spy. But I grit my teeth and I ticked that stupid box for her despite having no confidence in her to stand for anything (for what little my vote matters, living in the Deep South). After 2016 I have absolutely no illusion that the Democratic Party is of any value to me. Fuck those people. As for the people who claim to lean conservative or voted for Trump, I can understand why you think the Democratic Party does not give a shit about you, because frankly they don’t. I just don’t understand what makes you think the Republican Party gives a shit about you and yours. It wasn’t all that long ago that they sent 9000 young men and women to die in deserts and mountains and for what? They cut taxes for rich people, but do you get more time off? More salary? Better health care? ", "creatorid": "1769eb1abc67", "timestamp": 1490316620768, "child": "", "username": "adumbman"}