{"parent": "265", "title": "", "id": "18d412ba5251", "name": "265_3", "content": "Hi. I’m a conservative reader who loves using the word “snowflake” to emasculate men who happen to be progressives. It makes me feel tough and manly. I own a gun, bitch! … Ok, I ASPIRE to, so bring it on! Hmmm. What to do today? I know! I’m going to go troll the Ringer to: Tell them that nobody cares about their political opinions, and/or that sports and politics don’t mixThen I’ll turn right around and expose / reverse myself completely by stating that if sports opinions or slants ARE given, they certainly shouldn’t be liberal! And I’ll mention something about how sports and politics are ok to mix so long as it’s Ted Nugent or Dana White making some analogy to survival of the fittest or a league making tons of money and therefore the MARKET does the talking! (TF: we know about markets and that there is an audience for many things. I happen to love NASCAR)I might have, at one time, called Kaepernick an unpatriotic coward for showing a form of protest that didn’t cost my paycheck one single dime, and doesn’t threaten my life or that of my kids in any way … and not notice that the B-2 bomber that flew over Qualcomm at the Charger game cost me at least a buck or two — and by the way — what was that air squadron SUPPOSED to be protecting during that flyover?! But who cares because I got a patriotic boner and you know, Toby Keith!!I’ll then insult Bryan Curtis, make some random reference to Joe Buck praise that no one remembers anymore, and, I don’t know… call him a snob or something?Then I’ll insult The ENTIRE Ringer — except Bill Simmons, because I’m secretly hoping we still become friends one day (been hoping since the launch of Page 2 — fingers crossed!!) No, I’ll just take a softball jab at Bill, because, you know — Mailbags! (TF: they do rule, it’s true)Having earned my 14 “hearts” from other conservatives who, in the last year, could have formed their own conservative Medium site by now instead, will call out the echo chamber that liberals live in, and curse their educated ways as actually being “misinformed” and “devoid of real people’s opinions.” (because we liberals aren’t real! We don’t count… kind of like military spending doesn’t really count in the Federal budget)I’ll say I’m “outta here,” but return soon to slam another liberal column by the Ringer, absolutely shocked, shocked, despite the fact that the site has never hidden their bias and it’s current writing staff simply calls it the way they see and research it. …Write a comment blasting THIS comment, saying “you don’t understand ________,” or “if you’re so smart, why did you lose the election?” never CONSIDERING that we agree with you and KNOW HRC blew the midwest and took it for granted (you don’t think we’re mad as shit at her?) ", "creatorid": "33ae38f92b31", "timestamp": 1487287433058, "child": "", "username": "thetoddflora"}