{"parent": "265", "title": "", "id": "5b80740d9133", "name": "265_15", "content": " How Sanity Became A Liberal Position Bryan Curtis’ piece on politics in sportswriting misses key notes. Well well well. As we all know, there’s nothing that works sportswriters into a froth quite as much as, um, a piece about sportswriters. So it was entirely unsurprising when Bryan Curtis’ latest feature at The Ringer was the talk of the business for much of Thursday. Curtis’ attempt to get to the bottom of sportswriting’s move to the left was the latest in a series of pieces that have gone down this particular rabbit hole. In November of last year, he dove into the question of how sports radio would evolve in the age of Trump, and in January, he questioned whether ‘Stick To Sports’ was dead and buried forever in the wake of Trump’s inauguration. Clearly, the political tendencies of sports media are of interest to Curtis, and he’s far from alone in this regard. The ‘culture wars’ have come to manifest themselves in every aspect of our society. Why should sports be any different? And there’s undoubtedly a lot of interesting material to unpack here. There’s the continued segmentation of our media into different, self-selecting echo chambers. There’s the role of social media in spurring it all along. There’s the changing power structure, and perception, of owners and players, management and labor. There’s athlete activism, NCAA exploitation, and an actual communist in the press box! But there were also a few things missing from the narrative, and it’s worth taking the time to point those out too. We can start by listening to the brilliant Shireen Ahmed, who took issue with the fact that certain voices were conspicuously absent from Curtis’ piece.       There’s really no question that Curtis’ piece suffers from a lack of female, minority, LGBTQ, disabled voices. And to be clear, it’s not simply out of some obligation to include as many diverse perspectives as possible, (although wouldn’t that be nice), but it’s also because, quite plainly, this is a major part of the story. Trying to figure out why sportswriting has taken a turn to the left? Well, it doesn’t really take a sociology degree to figure out that it may have something to do with the fact that an occupation which has, historically, been almost exclusively the domain of white men, is finally starting to let others in, albeit far too slowly. Now that women, people of color, the disabled, don’t have to wait around for a (almost certainly) white male newspaper editor to give them their shot, but can instead build their own outlet, and create their own opportunity, all of these new voices are, unsurprisingly, forcing the whole of sports media to take a fresh look at some issues that should have been examined more critically a long time ago. Like, for example, it’s possibly a little crazy to name a football team after a racial slur, perhaps our testosterone fueled sports culture isn’t always welcoming to women, and maybe, just maybe, there’s something wrong with a system where predominantly black young men provide artificially restricted labor so that predominantly white older men may make massive profits off it. Curtis discusses all of this, but it’s impossible to tell the story of how we arrived at this new equilibrium without including the people, long marginalized, who have helped to change the conversation. Perhaps, in some sense, sportswriting hasn’t undergone an ideological shift, as much as it’s simply widened the tent, causing a reevaluation of some tenets that really didn’t hold up to intellectual scrutiny to begin with. In retrospect, what’s crazy isn’t that sportswriting “moved left” on these issues, what’s crazy is that it took so damn long for people to arrive at some rather common sense conclusions.  Which brings us to another idea that didn’t seem to get the consideration it deserved, in Curtis’ piece. Namely, the fact that for all the discussion of how sportswriting has changed, there’s very little about how the political ground itself has actually shifted, under all of us. Climate change as mythology is now a basic part of Republican orthodoxy. Even as assault weapons become more powerful and deadly, the party has drawn a clear line in the sand against even the most basic and neutered forms of gun control. Despite staggering levels of inequality, the modern GOP fights vehemently against minimum wage laws, and for right to work legislation that will continue the total devastation of union strength in this country. It is a party that takes aim at our health care system without any notion of how to replace it, and puts forward nonsensical budgets with little concern for the fact that the numbers simply don’t add up. And over the course of the last election cycle, their standard bearer, the man chosen to represent the party most prominently, stated, at various points, that women should be punished for having an abortion, that there’d be nothing wrong with a new nuclear arms race, and that an entire religion should be barred from entering this country. You simply can’t, or at least, shouldn’t, have a conversation about “sportswriting”, or any other profession, moving in a more left-leaning direction without also grappling with the notion that American conservatism, since the days of Reagan, has moved hard to the right, often past the point of logic, reason, and empirical evidence. For Curtis and others wondering why sportswriters are criticizing this President with far more frequency, it may have something to do with the fact that he routinely utters the sort of ignorant, offensive nonsense that would have been immediately condemned by all of polite society as recently as a few years ago. To quote the great Charlie Pierce over at Esquire, the modern GOP “ate the monkey brains” some time ago, and if sportswriters are speaking up with great frequency, it might not be because they’ve all turned into Karl Marx, but because, as Stephen Colbert put it more than a decade ago, “Reality has a well-known liberal bias.”  Finally, there’s one last thing absent from Curtis’ piece, and in this case, it’s simply a matter of good old fashioned missing the thread. In the article’s conclusion, while discussing what’s “gone haywire” in this new world of sportswriting, Curtis posits that this new cadre of liberal sportswriters may have inadequately covered one of the biggest stories of the last few years. Take the reaction to the Ray Rice video in 2014. There was a hue and cry throughout sportswriting: Something ought to be done! (If there was any criticism, it came from the left: that replays of the elevator video were “re-victimizing” his then-fiancée, Janay.) Unfortunately, many of the early columns didn’t always say who ought to do something or what it should be. Roger Goodell used the groundswell of rage to suspend Rice indefinitely and increase his already-fearsome power over player discipline. Sorry, but, well, no. This simply isn’t the case. A simple search of the “Ray Rice” tag over at Deadspin brings up a incredibly impressive body of work, on all angles of the story, including the most nuanced and challenging aspects of it. Greg Howard wrote thoughtfully about how timing and public relations were as much a factor in how Rice was treated as the actions themselves. Puja Patel noted with great eloquence that it was time to treat Janay Rice as more than simply a character in her husband’s narrative. Barry Petchesky tackled the emerging idea that even after serving his suspensions, Rice was in some sense being “blackballed” from the league. Oh, and that end result that Curtis notes? The idea that Goodell and the league used the Rice situation to consolidate the Commissioner’s power over player discipline? Here’s Tom Ley writing about that troubling notion in January of 2015.  Of course, it’s obviously not just Deadspin that authored rigorous, nuanced work on even the most intellectually challenging aspects of the Ray Rice story. Back in 2014, Kavitha Davidson, then with Bloomberg View, wrote about the serious problems with the NFL’s disciplinary process. Jane McManus wrote thoughtfully at ESPNW about her belief that Rice deserved another chance in the NFL, despite the seriousness of his actions. At Think Progress, Lindsay Gibbs did the important work of tracking whether the NFL had truly put their money where their mouth was when it came to fighting domestic violence. Sorry, but if Curtis believes that writers were “tying themselves in knots” trying to find “the proper, liberal response,” well, I just didn’t see it. I saw, instead, an incredible talented and brilliant group of progressive journalists delving into every corner of the Rice story. Is it challenging, at times, to balance important principles by standing against domestic violence, protecting Rice’s individual rights, ensuring that the league does not trample over its players on disciplinary matters, and attempting to answer the ultimately impossible question of what’s enough punishment for a horrifying act of abuse? Of course. But that doesn’t mean that this new, more broad, more open, more diverse, and yeah, ok, I guess, maybe even more progressive group of sportswriters isn’t up to the challenge. It goes without saying that stories will continue to come to the surface that make sportswriters, liberal and otherwise, question and even shift some of their previously held principles. That’s not something to worry about. It’s the definition of how we learn, and grow, and evolve. From where I’m sitting, sportswriting has done plenty of that in the last few decades, and while there’s undoubtedly far more work ahead, I have no problem whatsoever saying that changes in sports media aren’t something to fear, or scratch our heads over. They’re something we should celebrate.  ", "creatorid": "e076ac315f6c", "timestamp": 1487356209896, "child": "", "username": "AGoot18"}