{"parent": "270", "title": "", "id": "a6fd11b4b67", "name": "270_10", "content": "What a piece of overt and demonstrably wrong leftist propaganda.Anyone of intelligence that has researched the issue of Catastrophic Anthropogenic Global Warming (not the fraudulent misnomer ‘climate change which is idiotic as the climate always changes) can see that it is a giant hoax. All the evidence supports the skeptics, who include among their ranks top climate scientists and Nobel prize winners. They tend to be retired or have tenure of some sort as dissent against the cultish religion of global warming will get you fired, so even though virtually all climate scientists know CAGW is a hoax they cannot speak out against it.Calling someone a ‘climate denier’ is an association fallacy smear designed to create an association with ‘Holocaust denier’. This is the level the corrupt global warming alarmists sink to because the facts don’t support them. Speaking of facts: 1. The Mean Global Temperature has been stable since 1997, despite a continuous increase of the CO2 content of the air: how could one say that the increase of the CO2 content of the air is the cause of the increase of the temperature? 2. 57% of the cumulative anthropic emissions since the beginning of the Industrial revolution have been emitted since 1997, but the temperature has been stable. How to uphold that anthropic CO2 emissions (or anthropic cumulative emissions) cause an increase of the Mean Global Temperature? [Note 1: since 1880 the only one period where Global Mean Temperature and CO2 content of the air increased simultaneously has been 1978–1997. From 1910 to 1940, the Global Mean Temperature increased at about the same rate as over 1978–1997, while CO2 anthropic emissions were almost negligible. Over 1950–1978 while CO2 anthropic emissions increased rapidly the Global Mean Temperature dropped. From Vostok and other ice cores we know that it’s the increase of the temperature that drives the subsequent increase of the CO2 content of the air, thanks to ocean out-gassing, and not the opposite. The same process is still at work nowadays] 3. The amount of CO2 of the air from anthropic emissions is today no more than 6% of the total CO2 in the air (as shown by the isotopic ratios 13C/12C) instead of the 25% to 30% said by IPCC. 4. The lifetime of CO2 molecules in the atmosphere is about 5 years instead of the 100 years said by IPCC. 5. The changes of the Mean Global Temperature are more or less sinusoidal with a well defined 60 year period. We are at a maximum of the sinusoid(s) and hence the next years should be cooler as has been observed after 1950. 6. The absorption of the radiation from the surface by the CO2 of the air is nearly saturated. Measuring with a spectrometer what is left from the radiation of a broadband infrared source (say a black body heated at 1000°C) after crossing the equivalent of some tens or hundreds of meters of the air, shows that the main CO2 bands (4.3 µm and 15 µm) have been replaced by the emission spectrum of the CO2 which is radiated at the temperature of the trace-gas. 7. In some geological periods the CO2 content of the air has been up to 20 times today’s content, and there has been no runaway temperature increase! Why would our CO2 emissions have a cataclysmic impact? The laws of Nature are the same whatever the place and the time. 8. The sea level is increasing by about 1.3 mm/year according to the data of the tide-gauges (after correction of the emergence or subsidence of the rock to which the tide gauge is attached, nowadays precisely known thanks to high precision GPS instrumentation); no acceleration has been observed during the last decades; the raw measurements at Brest since 1846 and at Marseille since the 1880s are slightly less than 1.3 mm/year. 9. The “hot spot” in the inter-tropical high troposphere is, according to all “models” and to the IPCC reports, the indubitable proof of the water vapour feedback amplification of the warming: it has not been observed and does not exist. 10. The water vapour content of the air has been roughly constant since more than 50 years but the humidity of the upper layers of the troposphere has been decreasing: the IPCC foretold the opposite to assert its “positive water vapour feedback” with increasing CO2. The observed “feedback” is negative. 11. The maximum surface of the Antarctic ice-pack has been increasing every year since we have satellite observations. 12. The sum of the surfaces of the Arctic and Antarctic icepacks is about constant, their trends are phase-opposite; hence their total albedo is about constant. 13. The measurements from the 3000 oceanic ARGO buoys since 2003 may suggest a slight decrease of the oceanic heat content between the surface and a depth 700 m with very significant regional differences. 14. The observed outgoing longwave emission (or thermal infrared) of the globe is increasing, contrary to what models say on a would-be “radiative imbalance”; the “blanket” effect of CO2 or CH4 “greenhouse gases” is not seen. 15. The Stefan Boltzmann formula does not apply to gases, as they are neither black bodies, nor grey bodies: why does the IPCC community use it for gases ? 16. The trace gases absorb the radiation of the surface and radiate at the temperature of the air which is, at some height, most of the time slightly lower that of the surface. The trace-gases cannot “heat the surface“, according to the second principle of thermodynamics which prohibits heat transfer from a cooler body to a warmer body. 17. The temperatures have always driven the CO2 content of the air, never the reverse. Nowadays the net increment of the CO2 content of the air follows very closely the inter-tropical temperature anomaly. 18. The CLOUD project at the European Center for Nuclear Research is probing the Svensmark-Shaviv hypothesis on the role of cosmic rays modulated by the solar magnetic field on the low cloud coverage; the first and encouraging results have been published in Nature. 19. Numerical “Climate models” are not consistent regarding cloud coverage which is the main driver of the surface temperatures. Project Earthshine (Earthshine is the ghostly glow of the dark side of the Moon) has been measuring changes of the terrestrial albedo in relation to cloud coverage data; according to cloud coverage data available since 1983, the albedo of the Earth has decreased from 1984 to 1998, then increased up to 2004 in sync with the Mean Global Temperature. 20. The forecasts of the “climate models” are diverging more and more from the observations. A model is not a scientific proof of a fact and if proven false by observations (or falsified) it must be discarded, or audited and corrected. We are still waiting for the IPCC models to be discarded or revised; but alas IPCC uses the models financed by the taxpayers both to “prove” attributions to greenhouse gas and to support forecasts of doom. 21. As said by IPCC in its TAR (2001) “we are dealing with a coupled non-linear chaotic system, and therefore the long-term prediction of future climate states is not possible.” Has this state of affairs changed since 2001? Surely not for scientific reasons. 22. Last but not least the IPCC is neither a scientific organization nor an independent organization: the summary for policy makers, the only part of the report read by international organizations, politicians and media is written under the very close supervision of the representative of the countries and of the non-governmental pressure groups. The governing body of the IPCC is made of a minority of scientists almost all of them promoters of the environmentalist ideology, and a majority of state representatives and of non-governmental green organizations. ", "creatorid": "b39cfbe6b015", "timestamp": 1492272764411, "child": "", "username": "aaronbarlow72"}