{"parent": "270", "title": "", "id": "49ad08966d41", "name": "270_24", "content": "In a fawning press release, the Times calls Stephens “a beautiful writer” who brings to the paper, “profound intellectual depth, honesty and bravery.” I would just like to point out the guy is also a bad writer. Just look at the myriad stylistic and grammatical errors in the quote about hysteria that Joe Romm supplied. As to the bigger problem, let this serve as yet another reminder that the New York Times is an establishment propaganda rag, not a bastion of legitimate journalism. It is corporate media dressed up to appeal to the full spectrum of readership that ranges from Tesla drivers to Prius drivers, but which serves only itself and its owners. These institutions will not save us. They are not in the business of objective journalism or finding solutions to the potentially catastrophic problems that face humankind today. They are in the same category of self-serving oligarch hacks that are running the entire federal government, which, in case you have been living under a rock, also is not in the business of solving any of our problems these days. It is long past time we stopped expecting anything remotely ethical to come out of these corrupt entities devoted almost entirely to greed, and, instead, turned our attention elsewhere, to independent, ethical sources of objective information. We must take matters into our own hands. Divest from fossil fuels in every way you can. Only when millions of people refuse to give their wealth over to entities that are pillaging and destroying the planet can we hope to right this ship. No branch of the US government is going to intercede on our behalf. The fossil fuel industry is committing mass murder on an unimaginable scale, and they have bought off politicians, professors, law enforcement, and the media to help them face as little resistance as possible. Do not be a party to this. ", "creatorid": "13b39719d612", "timestamp": 1492221717294, "child": "", "username": "btawesome"}