{"parent": "321", "title": "", "id": "c87891f29466", "name": "321_15", "content": "People have told me that it takes nerve to speak your mind but it takes courage to speak from the heart. I was diagnosed with high functioning autism in my late teens. My years in school were hell because I didn’t know how to relate to other kids or understand certain lessons teachers taught. I was picked on by both, yes both. I’m fairly certain the teachers reveled in seeing me humiliated because I wasn’t a fast learner. Remember, there was no internet back then so it did no good telling my parents because I no proof. Life got easier when I moved to another city and got into junior high and high school, but by then I contemplated suicide and experimented with self-mutilation. My parents knew I wasn’t “normal” yet they didn’t know what to do with me besides ongoing therapy, medication, and learning to tolerate my tantrums. Looking back so many years later I’m embarrassed at how difficult I was as a child. Sometimes I’ll approach my parents and tell them how sorry I am for my past. And each time I tell them sorry, they always tell me I have nothing to be sorry for. I don’t have bipolar disorder but I know lots of people who have it. Our journeys are not too dissimilar. Even as a grown up nearing the age of 40 I still have trouble making friends. The constant excuses they give me for not allowing me a chance or accepting me into their circles are: “You’re too nice.”, “You just seem too needy.”, “I’m not adding more friends in my life right now.”, “so-and-so only wants to be friends with successful people.” So this is how I’m forced to interpret the world around me. We just have to keep living, learning, and loving those who love us in return. Happiness and self-acceptance are what we all have to find in the end. It’ll never be perfect, yet it’s not impossible. ", "creatorid": "67afc6bd6a27", "timestamp": 1475463199118, "child": "", "username": "Mythwoman"}