{"parent": "401", "title": "", "id": "caf0f9a08482", "name": "401_19", "content": "Sincere intentions without broad logistics inevitably becomes a paper umbrella. These little jabs are not hurting Trump or the GOP while they make the Dem Party seem bitter and nostalgic for 16th century Salem witch trials. There is no mystery to Trump and the simplicity may be his best tool because legislators, barked by constituents are so well convinced of his marriage to malfeasance they seem to be in race to brag on being the person who brought him down. To me the resources and time could have been better spent collecting data from his Florida trips, communications among his campaign with not just Russia, but looking into China and chasing down the mysterious new owner of the 19% in Rosneft. While golfing in Florida he put the press corp in a room with all windows and clear doors completely covered with black trash bags preventing any line of sight from inside the room to the outside. Many people had mistaken that move as simply a power issue but it’s possible it had nothing to with power and everything to do with paranoia. His 77 minute dirty diaper slurpfest whining about the media also more about paranoia more than simple power which is why he often tweets falsehoods about certain outlets failing. Well, to be fair he does have a keen eye for bankruptcy warning signs. The media should focus on accurate information for the electorate because they know Trump will lie, create 3 more lies, then have spox go out and sew 14 more lies keeping the press busy and his detractors distracted. Dont know about anyone else, but the revelations of new lies are absolutely meaningless in this stage. The media should not interview his spox anymore or Trump himself. Take advantage of the information age and give him enough rope because this play -by-play approach is a fail. His base is becoming more irrational and the media is feeding that monster by not appreciating the impact they could have versus the daily edging producing no results. We are not making any progress and only aiding Trump’s corruption by not exercising more thought into targets. His tax records are meaningless and would have no impact among his supporters so why spend so much energy acquiring useless information? It is also very possible he is being protected because the more experienced DC players find him to be a powerful tool for deflection on other events and issues. In his most recent despicable act he gave a short press conference following a trip to a military base regarding Seal Owen’s KIA status and he had nothing but nice things to say and enunciated they are a great family. He did not have the integrity to admit Owen’s parents refused to meet him and demand an investigation. It is just another highlight of a sociopath desiring everything but honesty and respect. Frankly, if the Seal was my brother or friend I would ask Trump the purpose of meeting him. The Seal got caught and Trump made it very clear he did not like soldiers who get caught. ", "creatorid": "6c7745fabde7", "timestamp": 1488252483221, "child": "", "username": "brylarfoustark"}