{"parent": "408", "title": "", "id": "38d49a03494f", "name": "408_2", "content": "There has to be some sort of at least nascent science of how people are persuaded. I would bet dollars to peanuts that the answer isn’t “by graphs drawn by authorities”. That’s very persuasive to scientists and like-minded folk. We look into the back-story of the graphs, the credentials of the authorities perhaps, and even the underlying logic of the case. And then we’re convinced. But most people haven’t the time, the energy, the confidence in their own ability to sort out wheat from chaff, to make decisions that way in every realm. And even smart people have gone terribly wrong believing what they shouldn’t have believed — -witness the astonishing success of Ponzi schemes over the years. Witness the drift of great nations into wars that none of them even really wanted, such as WW1. The people just went along, perhaps because there was a claque in favor of the policy and it felt good. Find times where the public stepped back from the precipice. Find times where the public over time came around. How, for instance, did British and American abolitionist and suffrage activists win the public debate? It wasn’t easy and it wasn’t quick, to be sure. Listen to the arguments of the other side. What are they really worried about? In some cases, that which they say they fear might well be very bad if it came to pass. A world government would violate one of the earliest lessons of history and ordinary prudence by putting all humanity’s eggs in one basket, for example. Can we offer solutions that don’t involve creating some supranational authority that might grow over time? Can we, on the other hand, get traction with the point that the earth’s atmosphere is physically one basket, so that if we’re right on climate change [not the right time to insist that we for sure are, even though that is the case] then the basket is endangered? Deep and serious thought needs to be given to this side of the coin. We aren’t winning the public debate. We can’t just gripe “why aren’t I winning by 50 points?” Persisting in strategies that aren’t working is no way to run a political campaign, or a movement, or even a railroad. ", "creatorid": "56592bfa8df0", "timestamp": 1492267893752, "child": "", "username": "doughensley"}