{"parent": "409", "title": "", "id": "b09646f4462e", "name": "409_12", "content": "Apples to apples, please… You are comparing the wholesale price of power (dollars per MWh) to the the retail price, when you mentioned 12c/kWh that most people pay. The wholesale price of power here runs about $30/MHh for coal fired power. The key part was that 11% share of the market. For a while yet, renewables can increase. To a certain extent renewable can mean burning less coal. And the combination of wind and solar may mean that 80–90% of our power can come from renewables. We need to discuss how to get rid of that last 20%. Even getting it to 80% requires several major (i.e. difficult) changes: We need much larger scale distribution. The distribution areas have to be large enough to have multiple weather systems in them. With enough area, wind power averages out.Dispatchable power is generation capacity that can be turned on and off rapidly. (Hydroelectric has a response time of seconds, gas turbine that of minutes, coal fired, and nuclear hours.) Dispatchable loads are power consumers that can be turned off as needed. Smart appliances are one way: Set your hot water heater to only heat the water if the price per kWh is under 8 c/kWh unless the tank temperature is below 100 F. Similarly air conditioners can be made that create cold water or ice when power is cheap, storing coolth (is that a word?) for the hot and expensive part of the day.The ideal would be some chemical process that can store surplus energy as a fuel. Current candidates are hydrogen and methyl alcohol. Electrolysis for making hydrogen is fairly efficient, but hydrogen is hard to handle. Still, storing hydrogen and oxygen from sunny days to use in fuel cells on calm nights has it’s merit. Methanol making is inefficient. At present it runs about 60% efficient in making it, and you can’t just turn the plant on and off. But methanol can be used in most internal combustion engines with little modification. If we can get an efficient way to convert surplus power into chemistry either through hydrogen, methanol, or battery, then the last barrier to shutting down coal vanishes. Meanwhile, the real criteria for renewables isn’t “Is it cheaper than coal” but “Is it cheaper than the operating costs of coal” That’s a bit harder to do. ", "creatorid": "95e9f0015abe", "timestamp": 1491586093142, "child": "", "username": "sherwoodbotsford"}