{"parent": "413", "title": "", "id": "b434afd5c8f8", "name": "413_6", "content": "The downturn didn’t start with Trump. It’s been fascinating to watch the left react to the election of Trump. That’s the way many on the right felt in 2008 with the election of Obama. The mess Obama left behind with things like Obamacare and international policies validate their concerns. The downturn began over 100 years ago when we started drifting away from the Constitution. It started with Teddy Roosevelt and Woodrow Wilson, a serious racist and a man who detested the Constitution. It was the advent of the progressive movement that started this journey. They believed that they, the elitists, could engineer a better society. If Teddy and Wilson put the sled in motion, FDR put wheels on it. If you want to know how bad it was under FDR’s meddling, look at the difference between the government reaction to the economic doldrums of 1920 and 1929. The reaction in 1920 led to the roaring 20s. The reaction in 1929 by Hoover and FDR led to a mess. And then came LBJ, who put an engine on the cart. The Great Society has cost $trillions. Not only did it not solve the problems it addressed, it has made things much worse. It’s destroyed the social fabric beginning with the family where government substituted for fathers. All of this “progress” has meant more and more government and less and less individual freedom. That is a key thing to ponder. You can’t unmoor a society from it’s moral roots or from common sense and expect it to survive. But it’s never a sudden departure. It’s taken time. It’s cut flower ethics. It’s nice that you’ve realized that there are serious problems. Study history and draw a different conclusion as to the cause. Start with “The Forgotten Man” by Amity Shlaes. Read the “Lords of Finance.” Solutions start with an informed populace that knows why the Founders did what they did and why D.C. doesn’t have all the answers. ", "creatorid": "4769f51e9d36", "timestamp": 1492095912324, "child": "", "username": "sdkeithk"}