{"parent": "441", "title": "", "id": "b2205ebc0ce2", "name": "441_2", "content": "Thanks for taking time out to reply. I do appreciate your engagement. The minutiae of the Nazi regime escape me. I readily accept this; who did what, when and to whom are reliably chronicled and no doubt an accurate narrative of how things unfolded is available. I chose not to tell that story. Instead I inquired of human nature. I questioned the nature of hate, our tendency towards tribalism and the dynamics of in groups vs. out groups. My conclusions were these: Human nature remains relatively fixed. Human greed, hatred, distrust, even prejudice, belong to deeper more primitive parts of our brain. Higher functions like altruism, love, and kindness, operate at relatively evolved levels of consciousness, but both processes occur simultaneously. There is tension between the lizard brain and the neo-cortex. We all walk a tightrope between heaven and hell of our own making. Where we focus our attention becomes our reality. Back to the story. Hitler represents a concentration of the worst of human nature. His expression of hate saw a sequential dehumanization, marginalization, isolation and eventual extermination of a people. That’s what I want to convey. There is a progression that unfolds in exactly the same way in every genocide I’ve examined. A formula for inculcating hate within the human mind, designed to push us on our internal tightropes toward evil. We can be pushed. The population of Germany broadly supported Hitler. We can be pushed. How do we resist evil? The first step is to watch out for dehumanization. As an interesting side note, what are the words used to undermine a persons’ character? Racist, Misogynist, Bigot… sound familiar? The language of dehumanization is very much in use. I told the story with broad brush strokes friends, it wasn’t meant to be factual or historically accurate. Fiction? Story? Smiling. Poetic license? Story is intended to provoke emotion, to teach without being obvious. To help us make meaningful connections between our lives and the ideas in the tale. Most times there is a sugar coat added to distract from what’s really going on under the hood. The entire human experience requires story, we love them, we are programmed to lose ourself in them. The trouble is, in our time, no one is telling stories that help us navigate the sturm und drang of modern life. I’m working on telling better stories. Let’s be clear however, I am in favor of immigration reform, and I’m an immigrant. How best it should be done is a discussion about government policy that far exceeds my ability. America has no obligation to suckle every nation at its bosom. Yet, reflect on positive possibilities of immigration. The American birth rate is falling below replacement levels but for immigrant communities -America is actively replacing its workforce and future taxpayers with legal immigration. Deporting 11 million illegals also brings to an abrupt halt their aggregate economic activity. They purchase gas, they buy groceries, they consume. What do you think will be the economic consequence of a sudden and precipitous drop in consumer activity? Collapsing stock prices? Collapsing real estate? As I see it, the US economy is a bubble awaiting a prick. I hope it’s not the Donald. (Grinning). I understand farms are complaining about entire harvests left unpicked in the fields.America’s aggregate IQ is falling (how many boys finish school?) yet America is still competitive intellectually precisely because America imports the best of the world to its shores via the HB1 visa. All immigration is not bad. I oppose the broad brush strokes with which immigration is currently being tarred. Trump’s executive orders seem incoherent. Even impromptu and literally freaks out all immigrants, legal and illegal. If we demonize immigrants, we take the first tentative steps toward evil. There must be a better way. Regarding Mexico. I understand the need to have controlled borders. Not rocket science. As Mexico’s economy unwinds, and as we contain illegal immigration, we create conditions for a failed state on our southmost border. Imagine the crime, narco traffic, state condoned tunnels to circumvent the wall, and the refugee crisis that will explode beyond ordinary containment. We’re not just talking about Mexico, we’re talking about the entire South American continent howling and wailing about our wall like zombies from World War Z. My thinking process is simple. All humans are not equal. Sorry feminists. America has the might, and the intellectual capacity to do much good in the world. If we can contrive a way to lend a hand we can do much to discourage illegal immigration. Share useful technology, train Mexicans and send them back to reconfigure failed political ideologies, encourage home grown reasons to stay where you are. These are things we could do even as we implement better border security. That’s the last concept I floated in my story. As for the Yiddish, laughing. Google; works like a charm. ", "creatorid": "32b605cf84cd", "timestamp": 1487723400298, "child": "", "username": "jhagi.bhai"}