{"parent": "442", "title": "", "id": "ceb408d73d9b", "name": "442_4", "content": "Thanks for the reply. My family are legal immigrants and citizens and we are concerned. Don’t be fooled by the immigration issue, much more is actually going on. Allow me to walk you through an economic back story of WWII. Reparations after WWI forced Germany into an impossible economic situation. They were obligated to maintain their economy as it struggled under immense debt. The German mark could not maintain its value and hyperinflation obliterated it’s purchasing power. I’ve read accounts of families being paid in the morning and rushing to buy things, anything, before the price went up that same evening. The economic upheavals sent shockwaves throughout the society, Germans began to fear for the lives of their children, their country, their race. Where to find solutions? What would work? Where could the blame lie? Who would save them? A short dark man, champion of Aryan bloodlines and wierd moustaches, found a solution. Immigrants. Those who were ‘different’. And everyday normal germans joined in to exterminate them like vermin. That’s where the anxiety of immigrants come from. We’ve seen this before. Look at the American economy. Look at the debt, and seriously, wonder how we can maintain the American way of life under burdens the like of which Atlas himself would shrug. The parallels exist in the immigrant mindset for these reasons. Broadly, the rise of an authoritarian leader followed by demonization of the easiest targets, immigrants. Global trade. The media. All of it done to disguise, to conceal to distract from the real story. The story that slip slides into the back pages and the late late night shows. Buried under an avalanche of tweets and marches and puff pieces. Our economy is unravelling. We have far too many sociologists, French poets, psychologists and welfare programs. We are drowning in baristas and uber drivers. The American way of life is under severe and sustained attack. Everyone knows it. You can feel it. Something’s not right.The standard of living of our children really will be lower than what we are accustomed to, it has to be because we are borrowing from the future to maintain the status quo. But we’ll demonize then send immigrants home. Of course, we’ll have to figure out who is a good immigrant and who isn’t. Whilst we figure that out, legal immigrants wonder how their status will be recognized. Do we wear a star or something? And when resolving the immigrant issue fails to repair a fatally wounded economy, what do you think will happen next? It happened after the German economy collapsed. The parallels are everywhere friend. Don’t get bogged down in the minutiae. Find the big picture. When all else fails, they take you to war. ", "creatorid": "32b605cf84cd", "timestamp": 1487846049815, "child": "", "username": "jhagi.bhai"}