{"parent": "442", "title": "", "id": "c4d221ff533b", "name": "442_3", "content": "Although, I have liked most of what you have written the times I have read you I can say a lot of America’s competitiveness in the tech world is caused by the importing of great talent. I know this because I am a technical recruiter. The problem is two fold, one is India is huge compared to us. Realize they are about 1.4 billion people. 1% of that population is 14 million people. So if we can think that that 1% is the top of that country and they apply here to work it gives a ton of great talent to apply here. Add that to China. Huge amount of smart people coming here which is great. With the wage suppression is a weird problem. Only the engineer doesn’t make much but the infosys’s of the world, who supply those engineers, make a lot of money that is on par with US salaries. They can just supply huge numbers of engineers. Most of it crap. I suppose there is some racket going on within our govt. that is getting kickbacks to giving them the lion share of the H1bs. The second problem is purely our problem. With racial quotas allowing less capable people to get into college over more qualified students, who could be engineers is killing us. It is also killing the students who get bogus degrees, like sociology and can’t pay back their debt but can get huge loans because Obama took the loan process public and they never say no. Also because of the liberal brainwashing process in our education system critical thinking is out the window and simplistic “fast food mentality” instant gratification so now the millenials can’t compete with people who had to work hard for their degrees because those people knew if they didn’t succeed their life is crap. If Trump can reinstill the American exceptional mentality we can have a renaissance here if we can pay off our debt. ", "creatorid": "9dab31a66858", "timestamp": 1487784212048, "child": "", "username": "isaacblack"}