{"parent": "442", "title": "", "id": "55af84a76173", "name": "442_7", "content": "I want to first say I like, at least, that you think through some of your thoughts. I do have to tell you though, for your own good, you clearly are still a product of the liberal false mantra. “Trump’s executive orders seem incoherent. Even impromptu and literally freaks out all immigrants, legal and illegal. If we demonize immigrants, we take the first tentative steps toward evil. There must be a better way.” His executive orders are aimed at illegal immigration and keeping a keen eye on not allowing people, who don’t want to assimilate into American culture, to not come here. People who are “freaking” out are doing so because they come from a country that the media is fake, like the left is doing here now. You seem to be intelligent, so I can only reason that you don’t want to know what Trump is actually doing. Being a Jew, who lost up to 20 family members in the Holocaust, I can tell you your Nazi analogy is pathetic at best. The closest we have to the Nazi mentality here is the intolerance of the left. A freely elected president by the people, although, sad for the left should be accepted flat out. Is that what the left is doing? No! They are sheep being lead by communist influencers like George Soros and Obama who are literally paying anarchists to be violent. That is what happened in Germany during the Nazi regime. College professors giving lower grade to students who don’t hide their non liberal beliefs while other college professors are harassed by the faculty for not being one of them. Public schools who spend more time on gender identification and bullying than teaching math. this is the kind of brainwashing that took place during Nazi regimes. Intolerance. What I’m writing here is not meant to insult you. It is meant to wake you up because you are living in “you don’t know that you don’t know” or Don’t want to know mentality. If you are the former, you now have been exposed to the idea that you have been sadly influenced. From here on out, if you don’t start actively looking to alternate reading materials you move into the Don’t want to know category and not really worth engaging. I’m hoping you are the former. ", "creatorid": "9dab31a66858", "timestamp": 1487782993988, "child": "", "username": "isaacblack"}