{"parent": "448", "title": "", "id": "e93aaa5b04da", "name": "448_19", "content": "“We’ve just tested the country’s willingness to capitulate to a fascist regime.” Really? that’s really what you think this is? Have you been to Cambodia? A democratically elected facist regime? Nice one. #checkyourpriviledge oh thats right your cold-war brain probably believes “it was ze russians” Say what you want about Russia, at least they are gracious in defeat and humble in victory. Keep playing that election blame game, you just look bad. This is 2017. The reason he was elected is because people think they know everything and are overzealous in regurgitating their bigoted opinions. Thats why the Greeks invented elections, so you could lowkey vote without being a crying argumentative trolling left millennial about it. “For example, reconfigure the National Security Council so that it’s led by our inner circle.” Definitely reconfigure that, because the previous National Security council was doing wonders for stabilising those “defined nations” (you don’t seem to want to talk about that) and not at all serving their own “inner circle interests” *cough* *cough* oil reserves, WMDs, gas pipelines, Japan etc OH wait! — You live in a nation backed by a military economy that is historically reliant on a foreign policy of constantly destabilizing weaker developing nations and reaping the benefits. Hopefully your new leader can lead you guys away from this destructive business of marauding (he seems like more of a developer you know) and then maybe other countries like China and Russia won’t fucking hate you. “Or gut the State Department’s ability to resist more extreme moves.” Make measures within your power and reason to prevent these questionable and deeply embedded political agendas of past from sneaking back into your advisory positions. Seems like a smart move for a guy you keep claiming is way out of his depth. But yeah I can see why after watching CNN you would feel indignant, try switching to the free thinking world. ", "creatorid": "b4017c99e21e", "timestamp": 1485855776205, "child": "", "username": "gosnafu"}