{"parent": "448", "title": "", "id": "e861662deb92", "name": "448_3", "content": "The other alternative, which falls between your two options, is that the Administration is doing what it needs to do but the media haven’t noticed. The visa stuff is incidental and relatively unimportant. It inconveniences the lives of somewhere between very few and exceedingly few non-Americans who the President has absolutely zero obligation to and about whom the US Constitution is largely silent. As a non-resident alien (with a 10 year entry visa) I’ve been detained a few times upon trying to enter the US and to this day I carry a letter from a friendly senior Congressman which has helped me explain my story. What Trump did, however, was start the process of recognising Islam as an alien political ideology bent on conquest. The media missed the most important paragraph in the Executive Order. Here it is and below is a link to a proper explanation of what he did. You won’t like it much more than your fascist fantasy because you’re probably still living in Bush’s “Islam is a religion of peace” world but the change is coming. Here’s the paragraph that matters: In order to protect Americans, the United States must ensure that those admitted to this country do not bear hostile attitudes toward it and its founding principles. The United States cannot, and should not, admit those who do not support the Constitution, or those who would place violent ideologies over American law. In addition, the United States should not admit those who engage in acts of bigotry or hatred (including “honor” killings, other forms of violence against women, or the persecution of those who practice religions different from their own) or those who would oppress Americans of any race, gender, or sexual orientation. Here’s the explanation: http://stfi.re/vxkrgzl ", "creatorid": "ca8dfe956d33", "timestamp": 1485849144833, "child": "", "username": "brianoflondon"}