{"parent": "448", "title": "", "id": "bbc8c1350ccd", "name": "448_5", "content": "RE: The Immigration Ban is a Headfake, and We’re Falling For It Wow, I feel for the tin hats that are so paranoid, that they can actually invent dribble such as this article. First of all, try reading the full text of the Executive Order (link courtesy of the New York Times: https://nyti.ms/2jGG6bX) Note that the order specifically targets “visas”. There is no mention anywhere in the order in regards to green cards, which are residency documents. In fact, the order specifically gives exclusion and override power to DHS and SoS for addressing such issues: “ the Secretaries of State and Homeland Security may, on a case-by-case basis, and when in the national interest, issue visas or other immigration benefits to nationals of countries for which visas and benefits are otherwise blocked”. Also note, that no where in the order does it mention “Muslim” countries, which the mainstream media is using to falsely describe the intent of the order. In fact, the order specifically targets countries having “Deteriorating conditions in certain countries due to war, strife, disaster, and civil unrest increase the likelihood that terrorists will use any means possible to enter the United States”. In fact, what we have actually seen over the past few days, is that the order is working precisely as designed. We have caught 100+ persons who have overstayed their student, work, or travel visas, who were dumb enough to travel abroad, and think they wouldn’t get caught. We’ve also exposed employers who have hired people illegally, and circumvented the E-Verify system. While this was not the specific intent of the order, it filled a gap in current immigration law that needed to be filled. In the end, what we really have here, is eight years of Democrat influence to place people of extreme liberal thinking, in various roles throughout government, that are now using their positions to sabotage and discredit the new administration. The new administration is fighting an insurgency from within, and it will take time to shake out all the bad actors. Until then, we can expect to see orders implemented poorly, purposeful acts that would reflect badly on the administration, stalling tactics, and outright defiance. This what is meant by “draining the swamp”. It is the cleaning out of politically appointed and career activist government employees, that act without regards to the mandate the American people voted into office. ", "creatorid": "bce2ec3d4c77", "timestamp": 1485869402482, "child": "", "username": "trboyden"}