{"parent": "450", "title": "", "id": "14375d005042", "name": "450_7", "content": "I am writing to you in regards to the immigration debate that seems to be such a hot topic these days. I am a white male that lives in Connecticut with my wife and 4 children. I have been the owner of a contracting business (home and business improvements) for 20 years based in Connecticut. Business was always good even though my advertisement was through word of mouth. In the last 10 years my business has lost 2/3 of it gross. In my opinion this decline can be traced directly to the illegal immigrant boom in the New Haven area. Ten years ago men would approach me in the parking lot of a Home Depot or Lowes asking in broken english if I needed help. About 5 years ago I noticed the same type of people driving small beat up cars with large ladders strapped to the roof. Now those same people are driving new or newer full size trucks. I have talked to many of my clients both current and former and hear the same story. These workers are willing to do the job much cheaper than I can. I currently operate at the bottom cost point to still maintain my business and still lose most jobs to the illegals. Whenever I talk to people they all say the same thing (and don’t really care) that the illegals that do the work have most things paid for so there is no need for them to charge a going rate. In most instances when I lose a bid it is to a $7hr bid, I mean come on you cant run a regular business in Connecticut on $7 an hour. A lot of people I do work for have cleaning ladies, also illegal that charge $40 to clean a 2 story house! Yet these same cleaning ladies show up in brand new cars or suvs. The home owners know what is going on but cant look past the super deal they get to get their house cleaned. Because I am upset about these types of thing am I racist? My son went to get his license and had to wait months to take the written test and is still waiting to take the driving test. It has come out that not only is the delay because of illegals being issued driving licenses but the head of the DMV got caught sending out an email to driving schools telling them not to mention about why there was such a delay. Oh and by the way the DMV official was not fired or reprimanded he just sent out an apology. If I’m upset about this am I racist? Since the affordable care act started my son, who plays college football and myself have lost our orthopedic doctor. He was located in the next town to ours but no longer takes patients from our town. The doctor was the orthopedic doctor for the University of New Haven football team. When I went to the office to ask about it all that was in the waiting room was people not speaking english. My son had an injury and we had to take him 3 towns away to a doctor that was in his 70’s and no longer did operations himself. If I’m upset about this am I racist. My wife was diagnosed with cancer and her doctor wanted to have tests done and for her to see a specialist and he wanted it done as soon as possible. Every specialist we went to took weeks to get us in and when we got there the waiting room was filled with people unable to speak english. It was so bad that they had to have receptionists that were bilingual. Do I know for a fact they were all illegal, no but I have to believe that legal citizens would speak some english. Does the fact that this bothers me make me a racist? Its always a struggle to make ends meet now. It wasn’t that long ago when I had multiple cars, a motorcycle, a boat and went on vacation once a year. That is all gone now. I stand in line at Walmart or a food store and see over flowing carriages pushed by non english speaking people paid for by a silver state credit card. I wont lie, I stand there absolutely furious. Here I am arguing with my wife what goes in the carriage and they are getting stuff for free. ITS A JOKE PERIOD! People see illegal and legal immigration as the same thing, people looking for a better life and who are they harming. Most people feel this way because they see cleaning ladies, lawn cutters, etc and say who are they bothering. The average person is not going to lose his or her job to an illegal. But what about somebody like me? In my fifties I have neither the will nor the money to back to school and lets be honest who’s gonna hire me. I have 2 kids in college and 2 more in High School, what do I tell them. Its to the point now where it just doesn’t make sense to continue my business, where is my help. Is it my bad luck I didn’t study to be a doctor so that’s on me I should have known? I just hope people think a little harder about what we are doing to this country and to people like myself. But in the end I guess its just my hard luck because they are just looking for a better life even if it is ruining mine. ", "creatorid": "b871419b2a31", "timestamp": 1490136525806, "child": "", "username": "bobburger_64517"}