{"parent": "458", "title": "", "id": "79ba7f8b0c4b", "name": "458_10", "content": "Why a little FAKE NEWS never hurt anybody has it, Arron? A real working weekend? Wow, that is different than what we become accustomed to with Barack Hussein Obama. He didn’t work through the week nor on the weekends. Here is a search link to my website, I have over 134 articles on the totally outrageous tax dollars spend on the Golfing King, and the globe-trotting Queen and princesses. http://www.hoaxandchange.com/?s=obama+vacation And we are still spending money on this crew and will forevermore. Work or play at Mar-A-Largo? White House spokeswoman Stephanie Grisham told The Post this week that Trump is always working, even when he has left Washington behind. “He is not vacationing when he goes to Mar-a-Lago,” Grisham said. “The president works nonstop every day of the week, no matter where he is.” A few of Barack Hussein Obama’s many many taxpayer funded golf outings drew extra criticism such as in 2013 when he ordered Airforce one to fly him to Palm City, Fla., to golf with Tiger Woods and the owner of the Houston Astros baseball team. Cost on that play time was $3.6 MILLION. And remember that 2014 trip to China that we sprung for, yeah, the one that Michelle took only her daughters and mother to? The one that we paid $5,000,000.00 that is $5 million for, yep that’s the one. Oh, here is a good one, so many to choose from, Michelle Obama’s Ireland trip in 2013 G8 Summit, that one was $7,921,638.66. She and her entourage booked 30 rooms at the five-star Shelbourne Hotel, with the first lady staying in the 1500 square-foot Princess Grace suite at a cost of $3,500 a night. We have 8 years worth of this lavish travel from the Obama’s yet hardly any attention by the so-called mainstream news organizations. Oh, please don’t misunderstand, I am in no way saying this mullet wrapper, ThinkProgress comes anywhere close to a New York Times or Washington Post, not close, but they do have a handful of readers every day. We are still spending millions on the Obama’s, why Barack Hussein Obama was seen and photographed learning to kite surf staying with his buddy billionaire Richard Branson, on Branson’s private island, Moskito. Why the two buddies, both shirtless, were even photographed play wrestling, hum that is a little odd if you ask me. https://www.thesun.co.uk/wp-content/uploads/2017/02/nintchdbpict000299917200.jpg Perhaps a better name for your fake news site would be ThinkHypocrite I could go on and on, but don’t want to use up too much ink on the ThinkHypocrite site. ", "creatorid": "7e8e118d6dbb", "timestamp": 1491748036593, "child": "", "username": "johnmhames"}