{"parent": "461", "title": "", "id": "157768a2da73", "name": "461_12", "content": "Once again, a purposeful untruth that needs to be corrected. I’ll not go into repeating a previous response debunking your view, but suffice to say the Emoluments Clause does not apply to a President or Vice-President, no matter how much you want it to do just that. Did you ever read up on the Emoluments Clause or are you just repeating what others have said, which seems to be the common approach many on the left use when penning their articles. “…Yet in defiance of the advice of the nonpartisan Office of Government ethics and prominent ethics experts, President Trump has refused to fully divest from his businesses. Instead of setting up an independent, blind trust as these experts advised, Trump instead has placed his assets into a revocable trust run by his sons and a longtime business associate…” Do you really think that matters Laurel? You and legions of crazed anti-American zealots will never stop trying to use something, anything to impeach the president. If it isn’t Russia, it’s the Emoluments Clause, or his supposed anti-Muslim and un-Constitutional approach to immigration. Keep it up. I’m sure there’s a way to place him on the grassy knoll, or at DNC headquarters placing the bugs in the Watergate Hotel. Fortunately President Trump mostly ignores this churlish behavior and keeps rolling along, doing what needs to be done to help all Americans. If anything, it shows how much damage the former president did behind the scenes. Reminiscent of a war zone, the political landscape is littered with land mines and entrenched operatives poised to snipe from the shadows, fully intending to emasculate President Trump and keep him and his administration embroiled in defending themselves against the seeming never-ending fake news promulgated by equally fake Americans. There is not one shred of evidence anyone associated with the Trump campaign, or even the President himself colluded with the Russians. However, now that there is actual evidence that under the Obama administration there was surveillance, unmasking and leaking against Trump and his staff, the focus conveniently must now shift to something else. Just at the moment the liberal left seems to be culpable, they pull out one of their favorite tactics; ‘pay no attention to that man behind the curtain.’ When the attempts at using the Emoluments Clause also fall short, the far-left whiteboard undoubtedly contains the next attempt on the list. Too bad you and millions just like you have decided to throw away whatever possibilities you may have had in life to dedicate yourselves to such dead-end anti-American results, then again, with the blind leading the blind, you’ll never see or understand. Thankfully, we’ll just keep voting those you admire and align with out of office and elect those that you will undoubtedly hate. Heck, but look at the bright side; you’ll always have something to piss and moan about. ", "creatorid": "e07f2e44fb90", "timestamp": 1491359444107, "child": "", "username": "dragonslayers"}