{"parent": "462", "title": "", "id": "23e020684a51", "name": "462_11", "content": "He knew he would be expected to sell all of his assets and then place that money into a blind trust. If he was not willing to comply he should have never campaigned for the office. I so often hear people, in response to stories of exploitation or ill treatment, or when common people call for fairness, compassion or limits on capitalist depravity, respond with platitudes about the freedom of those people to leave, or move, or find a new job, and claim that they only have themselves to blame for “freely” entering into a questionable or obviously detrimental situation. Often, these responses fail to acknowledge the realities of the world, meaning they exhort people to exercise their freedom to quit working when underpaid without admitting that there are no other jobs, or that one must work to survive. Those concerns, for shelter, food and survival, have never been suffered by Donald Trump. He completely and willingly undertook a campaign for the job of President of the United States, knowing full well the expectations, requirements, scrutiny, schedule and every other aspect of the position as well as the expectations of the government and American public, not to mention people the world over. Nobody can claim to have been unaware of any aspect of a job that is the most closely watched, analyzed and judged in the entire world across all of human history, and yest he expended great effort to win the election and now seems angry about so much of it, from the scrutiny to the judgement to the workload to the commentary, and yes, to both the requirements and traditions that demand he divest himself and turn over control of all of his assets to an independent third party. I’ve seen comments to the effect of, “Why should he have to get rid of his businesses?” The answer, of course, is because to truly make decisions for America one must be free of any influence aside from that of the American people. Anything less is unacceptable. And for someone who loudly boasts of their patriotism and of wanting to “make America great again,” it is absolutely obvious that is far from the case. A true patriot, having campaigned and won the election for President of the United States, would happily and immediately want to comply with the letter and spirit of the law, would want to take every step and more to make it as clear as possible that their only concern was for their country, and know that in order to truly be the best president possible you make certain the questions asked by the press and the people are not about whether you might be profiting from the office of not. You take care of that ahead of time and on day one you begin working for the people. The fact that Donald Trump knew everything about the office and still refuses to step up to the challenge is the true representation of both his patriotism and respect for the position and country. ", "creatorid": "9014030d3d30", "timestamp": 1491289717361, "child": "", "username": "scottklair"}