{"parent": "505", "title": "", "id": "1dc5e8dfcd9e", "name": "505_3", "content": "Jennifer: we have to build. And not just more technology. We have to build new, better socioeconomic systems. New social architectures. New information systems. New, open governance systems. New ways to train the mind and body to see more prosperous futures… and then go create them. We have to stop looking to the current system for answers, and build the alternatives. We have to stop focusing all this attention on Trump, and accept that the entire system is in disrepair, including the political parties that jockey for position within it. We are not really resisting him — we are resisting ourselves. The division between ‘left’ and ‘right’ has become a toxic illusion that stifles collaboration, opportunity and interpersonal growth… some of the hallmarks of any democratic republic. Part of our reformation is accepting the truth about our own history as a country (which, to your points, is not easy to confront, given all the great things it represents), and the other critical element is taking responsibility for our futures by directly participating in the development of alternatives — voter reform measures, policy information initiatives, more focused town halls, more hackathons, activism inside and alongside of corporations that contribute to the problem, civic training programs, democracy workshops, local economic design, etc. We need to get real, not idealogical. The ‘answers’ are well within our grasp. Here is one approach, which includes some powerful examples of real change initiatives we’ve engineered: An Applied Blueprint for the Restoration of Democracymedium.com If you’d like to discuss what has been written here, we are happy to have a conversation for relationship and possibility. Cheers. Keep your head up. ", "creatorid": "c2c0a10724cf", "timestamp": 1487552282426, "child": "", "username": "goonth"}