{"parent": "511", "title": "", "id": "b7216242f10c", "name": "511_10", "content": "Mr. McCain — you are such an enigma to me. I’m a registered democrat, but I remember in the 2000 election, underwhelmed by Gore, thinking how if I could vote (my first voting election wasn’t until 2004) I would actually hope for you to win the primary against Bush and then vote Republican — something that was hitherto (and since!) unthinkable to me. You had always struck me as so reasonable, level-headed, experienced, and capable — I really, genuinely, liked you, despite disagreeing with you on some core issues — and I knew more about you, living in your home state at the time. Then came 2008. Not only did Barack Obama promise everything I had ever hoped for and then some, you seemed to go off the deep end, to lose your way and some of your integrity along with it — you were no longer recognizable to me as the man I had admired in 2000. Such that, once I had a chance to actually cast a vote for you, I no longer even remotely wanted to — I never even seriously considered it (and once you picked Palin, you could completely forget it). Since then, you have had your moments in both directions — it’s seemed to me that you have been slowly heading back toward the light with some stumbles along the way. But this speech, this is vintage McCain to me — this is the man I had admired for his leadership and courage. I found this message to be very stirring and hopeful and it’s great to see you turning back to your true north once more. I hope you will continue to be a voice for all Americans — even those like me who may disagree with you often, but respect you all the same. We rely on you to bring your moderating influence to the highest levels of government, thank you for your service. ", "creatorid": "4b14436e506e", "timestamp": 1487370745048, "child": "", "username": "emi.pim"}