{"parent": "511", "title": "", "id": "c38ed8ba06a7", "name": "511_11", "content": "It’s Not Too Much To Ask Nations Who Enjoy Pax Americana To Pay Their Fair Share  I think you’re average Trump voter has regard for the benefits of the international order we as a country have been shouldering for seventy plus years, as I am sure most Brexit voters also take pride in being our strongest ally in that same effort. But just as you are aware that working and middle class families fight the wars of the United States, so to have they also helped fund this international system which has overseen serious declines in their real wages during the post-WWII period, particularly since the Ford Administration. Citizens throughout the West are fed-up with crony capitalism, unpatriotic money-first elites, and ridiculous boondoggles aimed at undermining national sovereignty without any real economic benefits to common people. If all these Eurail-avoiding, private jet-riding, Davos-devotee global citizen amateur climatologists cannot be bothered to do more to save themselves or their own countries, at what point do we call them out for their entitled assumptions about our generosity.  I have a real world analogy. In my early college days I had a couple of friends who often wrote checks their bodies couldn’t cash. Usually I would help them out of these jams, situations sometimes of their own making and sometimes because of unlucky circumstances in which they were ensnared. But what ended this dynamic was one night where they started an argument in English with an equally drunk primary Spanish speaker and expected me to protect them. My maternal grandfather learned Spanish first growing-up around San Diego and Riverside counties in 1920s-30s Southern California and worked strenuously to improve his English throughout life. This was one fight I decided I wanted no part of, and when I refused to get involved and my supposed friends got what they had coming, which was just one being slapped in the face and the other falling over a chair out of cowardice, I knew our little triad was toast. If allies cannot respect our point of view and domestic situation, then they need to nation-up and defend themselves, because the United States can get along with or without them. To this day my former friends claim I was the bad guy, but at least they learned not to run their mouths so cavalierly. ", "creatorid": "1d44522703f0", "timestamp": 1487367840717, "child": "", "username": "DVNC112"}