{"parent": "526", "title": "", "id": "6392c438b04", "name": "526_10", "content": "I just want to thank the author of this piece for taking the time to write it. It was a very refreshing perspective to hear coming from a Christian. I’ve always been more than a little perplexed by the in incoherent behavior of self-described Christians, who claim their religion to be one of peace, love, charity, and self-sacrifice, who worship a man that had little more than the clothes on his back yet would never hesitate to give what little he had to those in need, regardless of their faith. It’s confounding that they can proclaim these things, then, in the same breath, complain about how the poorest among us are just ‘welfare bums’ and ‘junkies. Even the politicians they choose to support just don’t align with what they claim their religion represents; I don’t know what percentage of Christians vote straight Republican but I imagine it is fairly large, so they’re supporting candidates who devote their careers to battling against all efforts to provide food, shelter, and healthcare to the poorest among us. Inversely, I am an atheist, as are many of my friends, and most of the non-believers I know are very liberal people. Supporting equality in all aspects of life, desiring to beef up programs to help the poor, disadvantaged, and disabled. There is a certain degree of irony in this; the non-believers are living lives more akin to that of Jesus than his self-proclaimed followers. Alongside some logical inconsistencies, this observation is a large part of what drew me away from Christianity as a young adult, so I suspect that it may be a large factor in the decline of religious belief here in the west. I do wonder how so many could have lost their way after spending much of their lives reading the New Testament, which describes the life of Jesus Christ. Looking at events such as The Crusades and The Inquisition, it would seem that, whatever the forces or human traits that are responsible for this shift, It must have begun happening a very long time ago. Here in modern times, It looks like many Christians have been getting hung up on the most trivial details of their bible while simultaneously ignoring the over-arching message — be kind to your neighbor as you would want your neighbor to be kind to you, a message I’ve chosen to follow even now that I’ve given up the faith. Anyhow, thank you for this. I hope some people read it and are convinced by it to try to live better, to live a bit more like Jesus did. ", "creatorid": "c1cb20e2474", "timestamp": 1491493392691, "child": "", "username": "titaniumbic"}