{"parent": "526", "title": "", "id": "ffa10e0d5518", "name": "526_14", "content": "Thank you for sharing this, Benjamin Sledge. I’ve often been struck by the ever growing irrelevance of cultural Christianity. Christianity as an organized movement has made many choices that have damaged the movement’s credibility. A movement that was always meant to be marked by relentless and scandalous love has become a movement known for self-righteous judgment. Instead of creating a hunger for Jesus, the movement of Christianity has left a bad taste in everyone’s mouth, including many of those who have worn the label of Christian. What I love about the story of Jesus, and something I’ve come to be reminded of more and more in the past couple years, is that Jesus was a revolutionary figure that drew people to him. Everyday people didn’t hate Jesus; they were enamored by him. Here was a man offering hope in the midst of a broken world where it felt like there couldn’t possibly be any hope. I know what it is to be human, and I know that longing inside that says, “This brokenness can’t be all there is.” People in Jesus’ day felt that same longing, and here was Jesus coming along and saying, “You’re right. This isn’t all there is.” Jesus was attractive to everyone except the religious elite, the people who thought they’d already figured things out. The people who, strangely, look a lot like the self-righteous, judgmental Christians of today. Jesus came to offer hope to people who realized that their souls were crying out for something to give. The early followers of Jesus were a mess. They didn’t have everything together. Many of them had just walked away from destructive patterns of life and were just learning how to truly be human for the first time. Christianity today as a cultural movement is about standardizing people because we have to create good PR for Jesus. We don’t want to give Jesus bad marketing. Isn’t it ironic that Jesus himself cared nothing for bad marketing. People called him a “friend of sinners.” They wondered if he was drunk, mad, in line with the devil, and probably much worse. And what he was most known for was his desperate relentless love for the people around him. And maybe for his intolerance for the religious elite who tried to make everyone else follow the rules. Are there rules to follow? Does God have expectations? Without question. I think the Bible and human experience makes that clear. But it’s God’s kindness that leads people to repentance. People don’t conform to rules because of someone imposing them on them. That’s why legislating morality will never work. Christians do a bad job of expecting people to change instead of leading them deeper into a relationship with Jesus, which is the only thing that will change anyone. When people find Jesus and the hope he offers, it melts away the darkest parts of us. It’s then that we begin to look different. It’s then that our lives begin to make people question why we’re not like everyone else, why our choices are counter-intuitive, why we’re driven by impulses that are counter to what’s normal, why we love relentlessly. I’ve been a high school English teacher for four years. Before that, I was a youth pastor in a church. I loved students and I wanted them to love Jesus and make him known. I was well-meaning like many of the church leaders I’ve known over the years. And I was part of the problem. I see students every single day, many of whom carry the label of Christian, and for whom Christianity is completely irrelevant. Their moral compass can be deduced to “whatever makes you happy is the right thing to do.” Lying is okay if it keeps you out of trouble. Cheating is okay if you don’t get caught. I know many of these students go to church every single week, but whatever they’re learning there is completely irrelevant. It’s not impacting the way they live. Sadly, it’s probably a waste of time for them and for the well-meaning people who open the Bible and teach them every week. I know because I used to be one of those people. I opened the Bible and hoped I was offering the hope Jesus had to offer and it would completely change the way they lived their lives, and my students were exactly like the ones I teach every single day today. Sometimes, I long to sit down in a room full of y0uth pastors and pour out my heart about what students really need and where Jesus is really offering hope for them. But that’s not my place. I teach because it’s what I love, and, when the opportunity arises, I offer the hope of Jesus. Forgive me for my longwindedness here. Your post really resonated, and I hope, like you, that I can make Jesus attractive and begin to see real transformation occur in the lives of the people around me. ", "creatorid": "3e2847d67d76", "timestamp": 1490479942475, "child": "", "username": "farrtom"}