{"parent": "529", "title": "", "id": "3d222eee0031", "name": "529_1", "content": "This is a very well written article that covers much of value in understanding the Trump voter and, more importantly, the Trump defender. I find myself increasingly in the position of calling these well intentioned efforts bullshit. How do we deal with a percentage of the population either advocating racism, white nationalism, misogyny and general bigotry or willing to accept open support for those things in order to shout “fuck you” to a majority of the same population? The conclusion of this piece touched on this but had to fall into the usual assumption that this is just a temporary political hissy fit. It is not. This is a split in the fabric of western and emerging planetary civilization that has been triggered by massive technological change and the failure to correct a rapidly failing economic system. We do not have political structures designed for this world and, as a result, we are screwed and don’t know what to do. The reactionary segment of the population, that is predominantly less educated and more sensitive to being called out on their social and intellectual shortcomings, has opted for, dare I say it, reaction and stupidity. Stupid and dangerous by any other name is still stupid and dangerous. An excess of political correctness is failing to call it stupid and dangerous. Insisting on following stupid and dangerous people, even if they seem exciting and interesting to you, is as clear an indication of immaturity as I know. I’ve raised kids and grandkids and have experience with them wanting to do something exciting and interesting but actually stupid and dangerous. If I stopped them they were mad at me but thanked me later. If I couldn’t stop them they were quickly mad at me for not stopping them and then, much later, sorry for that. I prefer to avoid that one. Of course this is condescending but we all eventually learn that there are people smarter than we are and we learn to pay attention and to counter them with care. If we are little bit smarter ourselves we learn that racism, misogyny, and bigotry are not indicators of intelligence. And I will go so far out on a limb as to say that caring for other people and not trying to drive them into poverty or taking away the services we all need to live or just flat killing them are indicators of maturity and intelligence. The problem that we have is profound and it is not political. It is the fork in the road that will mean the survival and chance for incredible opportunity on this planet or the loss of civilization and possible species death. We have fucked this up badly enough that the reactionary idiots have started to gain control and that is wrong. I just responded to another article going the same way as this one and went a bit more into the underlying historical situation. If you want you can read it it here. ", "creatorid": "ae38d08917ca", "timestamp": 1492213882492, "child": "", "username": "michaelmeyer"}