{"parent": "534", "title": "", "id": "944172dcd06", "name": "534_7", "content": "All this article, and a million more like it does, is continue to give people of color an ad infinitum excuse to blame others when they can’t or won’t break the cycle of bullshit taught them by schools, parents, community activists and professional race-baiters. If it’s not racist police, it’s rich, white corporatists piling up their wealth because they don’t want to share, or ancient stereotypes continuing to be promulgated by those who make quite a good living at picking at the scab of slavery and racism, while offering no true medicine to heal the scars. Liberal public education policies have done more to shape this insular, anti-American rhetoric than any invading army’s oppression could ever do. This country is being destroyed by those who use the very pillars which made America great in the first place; God, education, freedom of speech and individual liberty. It’s terribly shameful that to get votes and stay in power, Progressives have willfully decided education was the longest lasting way of changing a nation’s direction. What’s worse is that all the while they are making Pavlov’s dogs out of our nation’s schoolchildren, they also demonize the very ones that can offer them a path up from and out of the rabbit hole. Teaching others so very young to be angry, hateful and entitled only leads to bad ends. While they claim ‘we need to have the conversation’, it’s always on their terms and only after concessions that we are too-white, too-privileged and too racist. Entire communities have sprung up around the grievance industry, and there’s much more to be gained by teaching others that their failure is always someones else’s fault, rather than teaching them that consistent individual effort yields better and lasting fruit, regardless of the pitfalls encountered, which are to be expected when life is lived with, and for a purpose. It’s a lot easier for them to blame outwardly than to look inward. Instead, use that anger to demand better from those that govern you. Look at the results from those you continually elect into office. Stop looking for a bogeyman behind the face of every white person you see. Stop being convinced we are the enemy. You are your own worst enemy, and since you’ve decided that’s how you feel, who can you really blame for that??? You do matter, now start acting like it!!! ", "creatorid": "e07f2e44fb90", "timestamp": 1492349286521, "child": "", "username": "dragonslayers"}