{"parent": "535", "title": "", "id": "cd7d9a58b192", "name": "535_1", "content": "I also notice these types of articles don’t take the following into account there are European nations that did not conquer a single non-white land (you can start with Switzerland, Poland, Ukraine, Belarus, Czech Republic, Slovakia, Slovenia, Lithuania, Ireland, Latvia, Estonia,the list goes on). And yet their descendants are expected to feel unearned guilt over what the British, French, Spanish, Portuguese, Dutch and Belgians did a long time ago!There were MANY non-white tribes and nations that violently conquered other tribes/nations (you can start with the Japanese, Turks, Aztecs, Zulus, Incas, Arabs, Mongols, the list goes on), but none of their descendants are expected to feel unearned guilt for what their ancestors did!Also this <QUOTE> As this article explains, lumping people together into groups like this actually leads to decreased empathy and increased racial (and, hence, racistthinking)<UNQUOTE> That’s exactly what led to people sympathizing with Donald Trump because “he stands up to political correctness”. When people are shamed for having the “wrong ancestors”, how did you expect them to react? SJWs think their rhetoric encourages whites to be more sympathetic, but the results are in, and it backfired. Donald Trump knew this and took advantage of that! Sometimes I wonder if those so-called SJWs were paid by Donald Trump as a foil! Now, I have zero sympathy for the Deplorables, but the reality is that the SJWs and Deplorables feed off each other! It’s like they need each other to exist! Look, I’m a person with some non-white ancestry with a strong dislike of Donald Trump and his Deplorables. But the SJWs need to stop peddling White Guilt because that stuff backfires big time! Start treating people as individuals (even if they’re white) and that will reduce the appeal of Donald Trump ", "creatorid": "ff0e48584681", "timestamp": 1492142057075, "child": "", "username": "pablowegesend"}