{"parent": "536", "title": "", "id": "6b4be90bd00b", "name": "536_7", "content": "This is another article that’s a textbook example of the spreading phenomenon of white masochism. The author explores the manner in which white women in particular have had it easy and have largely escaped the scrutiny of the vengeful inquisitors in our contemporary racism witch hunt. She says that’s it time to change all that, that because white women haven’t been sufficiently persecuted, it’s time for them to start persecuting themselves and take the punishment they deserve. I’ll quote her words: [W]hite women need to do something that may be the biggest challenge we’ve ever faced. We must step out of the white tower and take what we’ve got coming. No white tears allowed. This is textbook white masochism, as I said, with the clear undertone of excitement the author betrays at the prospect of “tak[ing] what we’ve got coming.” Of course, you have to ask who exactly “we” are. Throughout the article (which gets a recommendation from @MediumStaff, who will seemingly recommend anything that calls out white people and rants about racism), the many alleged crimes and infractions of “white women” are subsumed under that tricky pronoun — “we” — as though “white women” were a corporation, WhiteWomen Inc., which, by law, retains its identity and its rights, responsibilities and liabilities even if every single shareholder changes over time. “We” are responsible for the historical acts of WhiteWomen Inc. and of all the white women who’ve ever been shareholders (and especially the worst and most oppressive ones), so that when the innumerable victims of WhiteWomen Inc.’s many infractions finally come out of the woodwork to collect what’s due to them, naturally all white women will need to step up, gleefully bare their butts for a good, hard spanking and get their well-deserved comeuppance. This is true even if many (read: virtually all) of the white women who are now part of WhiteWomen Inc. are perfectly good people who’ve never oppressed anyone or are young women just growing into adulthood and with no possible complicity in any historical anything or, for that matter, immigrants to the U.S. who had nothing to do with any historical oppressions that may have happened on these shores. It doesn’t matter who you are as an individual; it only matters whether or not you look sufficiently white. Makes a lot of sense, doesn’t it? As this article explains, lumping people together into groups like this actually leads to decreased empathy and increased racial (and, hence, racist thinking), and the only way to fight racism is to start treating people as the individuals they are, whether they be white men, white women, black women or anyone else. WhiteWomen Inc. is a nice invention when you’re looking for someone to blame, but guess what: just like Whiteness Inc. and WhiteMen Inc., it doesn’t exist! ", "creatorid": "156676a37772", "timestamp": 1492119933061, "child": "", "username": "Zoobahtov"}