{"parent": "536", "title": "", "id": "7de60872687d", "name": "536_15", "content": "You’ve never been to the ghetto. Obviously. I’m not disagreeing with you here , although I do think that society hasn’t tried to hide racism, or cruelty that we inflict on others. I think we have shown it continually in movies, media and literature. What really gets me is that — we portray morality so well in media, we all know what right and wrong is. Why are humans still so fucked up? It isn’t just white people. It’s everyone . Why are so many people still so scared to be themseleves , to stand up for truth, for what’s right and wrong ? Why are so many people so sick? So imbalanced? When I said you’ve never been to the ghetto, I meant that. Although reading your article I think it is so easy to believe that is real… I’m sure to some subconscious degree it is. I’m going to go ahead and say something that is gonna hurt. But I think, from what I’ve seen it’s more the truth. White is an archtype. It’s what is considered beautiful. It is our beauty standard. Every woman feels that. Even I did, growing up without blonde hair , tan skin, and blue eyes. I felt worthless because I wasn’t that. Imagine how a black woman feels? I think nowadays- half of the so called “racism” is projected. By black people. I think that many of them feel their blackness and have absorbed the stigma of it and they hate that blackness , somewhere subconsciously and project that into the world. They don’t really understand how we can’t feel that way about them being black. We can’t feel that mark of blackness. Black people that actually love themselves and love being black, have a totally different experience in life. I’m generalizing … Most of the “hurt” that white women in general do to the black woman today , is just jealousy. It’s not even intentional. It’s simple envy. They assume we get everything we want , they assume all men want us because we are white — they assume we have such a different level of privilege than they do. Being white solves every problem, to many a black person. That envy they have hurts. It’s a constant wound. The thing is, it’s also all in their heads. Sure white people have been notoriously cruel to everyone. Black, yellow, brown, fuck, that white man ? He is cruel to everything that isn’t rich. Isn’t he? Look around. I’m really not trying to diminish Ms. Millie. I actually stopped watching the Oscars when The Color Purple didn’t win. I was in fourth grade I think? That is a true story. I loved that movie so much that I have hated the Oscars ever since. I also think Whoopie should’ve won. I was so passionate about that then. As a child. PS I’m a white woman. ( The first black Oscars were really awarded long ago, I think. ) No, we haven’t hid that. We haven’t escaped accountability. In reality, I think the media has done just about everything it can to combat racism. Even bullying now is so not cool. Today’s world is totally different than the world I grew up in. Where football players were cool. Bullies were cool. Today’s kids? Have rallies in elementary school against bullying- like my own daughter did. Being smart is cool. Being gay is alright. Transgender kids don’t get beat up . That just isn’t cool anymore. In most places , times have changed. Ask any kid. Being the snobby rich white bitch is not cool anymore. Shit… ask any black woman. Most of them know that there are way more white women wanting to be black today. If anything . Times have just simply changed. But the story still sells. Everyone loves a victim, just like everyone loves a hero. And we all pick a part to play, don’t we? What’s the easiest way to be a hero or a victim? You’re looking at it. It’s so much easier than going out on the street and living what you believe in. Ask almost everyone. So much easier sticking with what you know works. What will sell. What will get the most likes. No one likes reality. But fuck it. As a white woman who has spent a lot of time in black neighborhoods , I can tell you, that black female aggression is extremely high.. I was constantly bullied, I was constantly threatened , and I had to constantly defend myself . I have been attacked by multiple black girls at once .. usually in fact. I will admit , that black women are so used to white women being scared of them, that they rarely have to fight them. Because white people just usually cower at a black person who shows anger or hatred or the threat of violence. They know that. By the way. One thing I always got was about my hair ironically . I have very thick, and long hair . I always have. It seemed like daily , some bitch would threaten to cut my hair off. One time even , I got in a fight with one woman, and I ended up beating her up pretty good on her stoop and her boyfriend stepped in and pulled my hair back and punched me square in the face and then yelled at his little 5 year old son to go get the scissors. I really thought finally — this was it. Some kid was gonna help his daddy cut my hair off.. You know how that fight started ? I left my make up at that house while he was in jail. I went and nicely knocked on the door to ask for it back. She attacked me because she was high as a kite and her man didn’t want her to have any one over — because she was a hooker at night ( and would walk the blvd at night and take her tricks home while her kids slept in the other room ) and he didn’t want anyone to know he was pimping out his wife for their habit. Yeah… that is life in the ghetto. And no one is a hero. And no one is a villain. Everyone is everything . The idea of the nice gentle black girl getting hurt by the mean white girls ? Funny. The reality about the black neighborhoods that I’ve lived in, is that the tougher you are — the more respected you are. It’s all about being someone nobody can fuck with. Especially in high school / teen years . You don’t get there by being someone that anyone can pick on. Name one fucking example of a black woman who allowed herself to get picked on or bullied by a group of white chicks. I have personally never met any black woman like that, and in fact the worst bullies I’ve ever seen have been those poor sad black girls. They terrorized people. Now I’m sure that there is some black woman or girl feeling picked on out there — just like there is a bunch of white girls hustling to keep up..and getting used and abused too. No…. I do not think that those snobby white women that make people feel like shit save it for poor little black girls- they do that to everyone even their boyfriends. I think the reality is that every black girl knows that all she has to do to get her power back is act tough- and that is probably why a lot of them do. Because just the threat of violence is enough to shut most white women up. It’s so strange how reality is so different than movies. Isn’t it? ", "creatorid": "6b0195a1ac60", "timestamp": 1492184252023, "child": "", "username": "AlleMcEnnis"}