{"parent": "538", "title": "", "id": "8a20a66dc238", "name": "538_4", "content": "Being an entrepreneur and a heterosexual white male I would advise against hiring Ms. Canary. I used to have a female co-founder next to me. I used to have gifted and talented girlfriends who all made impressive careers. However, I never heard them complaining or uttering/quoting nonsense like Krisserin Canary. I would not tolerate individuals supporting a deeply flawed ideology that is playing women and the LGBTQ community against white males who are still the pillars of our modern society, who are still doing all the dirty and dangerous jobs, who are still clocking in the most overtime, who invent more, who win the overwhelming majority of Nobel prizes, who are dying on foreign battle fields, who live 5 years less than women … and whose issues are never being talked about in the media within this feminism-drenched society that does not comprehend that women on average have different interests than men and that 400,000 years of evolution left their marks in our brains. The capitalistic system needs to be adjusted to the interests of women in order to increasingly replace men in leadership positions. I am for gender-balance but not for stereotyping heterosexual white males, for gender-war and gender-equalization Krisserin Canary is promoting with her article. Most white male CEOs under 35 rarely consider other people’s experiences, because they haven’t had to. How many CEOs do you know? Listen Bro(lina), I’ve heard all this before. What it means is there is systemic bias at the company that YOU share and propagate about women in leadership OR you just don’t want to listen to a woman telling you what to do. Just own it. It’s fine. Meanwhile I’ll take my vagina elsewhere. Yes, take it somewhere else! I love to work together with empathetic, smart and gifted women. You are not among them and you most likely mean trouble. And that item would be the last on my list considering that 7 of 10 start-ups fail on average. ", "creatorid": "80dd93e442f6", "timestamp": 1492153888786, "child": "", "username": "BeKindandShine"}