{"parent": "538", "title": "", "id": "fed93eafb6b6", "name": "538_22", "content": "Every woman, seriously? Is hiring discrimination and bias already in the past, so every woman can afford to be choosy about job offers? Or can every woman afford living with no paycheck for months waiting for a prince… oops, a perfect team? Is a technical woman’s priority to get the best for her skills or should she sacrifice those opportunities, since choices are limited? I dare to remind you, not all woman are created equally fitting a stereotypical “woman” hole (race, age, transgender and such included, but also too nerdy, too feminine, not feminine enough, not into “women” projects, “unwomanly” confident, not a people person, way too technical, sounding too “threatening” etc), some are struggling to just get a job, which is never perfect. It also applies to men who “fail” stereotypes. Notice, I didn’t mention “white men” anywhere. I prefer to do sorting by “is it a waste of time interviewing?”. Interviewing is unpaid labour, which is not wise giving away so managers can praise themselves “interviewing diversity” but nothing comes out of it for you. A job posting should sound like “we’re hiring people for certain skills to do the job”. Anything “culture” is indeed a big no-no. “Identity” is a trap as it’s not you making this call, don’t think “this is cool for me”, think “this is cool for them, but would they include me?”. If you’re an underprivileged woman, you may skip #3 and #4 (and #5 in some circumstances). You may even have better prospects with founders that are all men compared to a founder woman if you don’t look like her. Especially, don’t interview for tech jobs that are looking for “women”, to avoid competing with “right women” (not YOU) for a “woman’s spot”. ", "creatorid": "681b93e86b8b", "timestamp": 1491939923814, "child": "", "username": "janedoe111"}