{"parent": "543", "title": "", "id": "3a4ed92ec82", "name": "543_15", "content": "I’m not a specialist in typography and I have to say I’m not very good at it either. But I can share some of my thoughts with you. 1/The general principles are the same. The goal for typography is to create a clear visual communication and convey the clear message to the audience, so when designing the layout, we need to create visual hierarchy, the same for Chinese as well. We also need to take care of the line-height, font size, weight, kerning… 2/Some slight difference on details. There are serif and san-serif for Chinese as well, such as Songti宋体 and Heiti黑体. But I don’t think we have the concepts like ascender and descender, as Chinese characters are rectangles. Unlike the big difference between lower case and upper case like Jj, also between different letters BW, generally Chinese characters have a relatively same shape and weight. ‘I love design’ in Chinese is ‘我爱设计’.But we do have different components of a single character as well — Stroke笔画（点、横、竖、撇、捺、折、钩、提）. Also, I think generally Chinese characters need some more space when designing the layout, especially for long articles. 3/The biggest difference I think is the meaning of the characters. English letter is an abstract representative of message, so a single letter doesn’t mean anything untill it is combined with other letters to make up a word or a sentence(I may be wrong), but for Chinese, a pictograph, a visual representative evolved from the objects in the reality, a single character has thousand of information included, resulting in the different design methodology when bringing type into graphic design. When making creative typography design, for English letters, people normally focus on the abstract shape of the letter itself, for example, use some geometry shape to replace a specific part of the letter, take a circle as the O, triangle as A….People pay attention to the harmony and balance of the pattern rather than the meaning, the triangle just look like the A, I don’t think there is any connection between the meaning of a triangle and the letter A. They both convey the message of “stability” but it is just from the visual. For Chinese, when doing some de-composition of the characters, we need to think of not only the visual balance (the character itself is complicated like 曦, which means sunlight in the morning) but the meaning and relevance to the character itself. Shi Changhong is one of my favourite Chinese graphic designers, you can check out his creative typography design for The 24 Solar Terms二十四节气 here. Most of the design there actually use some related items to re-construct the Chinese character, making them relevant in both visuals and content. To design a Chinese typo system, I think it is more work as we have more than 20,ooo characters while there is only 52 letters in English. However, we never think it is easier to design English typo as there is a lot to do in adjusting the space, kerning, those details in a single letter. Here is a post in a Q&A forum like Quora introducing some beautiful Chinese fonts. Well, I think I went too far to actually designing a typo instead of utilizing typo in UI design. But I just want to share this with you. For me, the biggest challenge is to learn to look for a suitable font and pair it with another one. Because till the end, English and Chinese are very different writing systems, and it takes time to have the “eye” to see the right composition in English layouts. So thank you again for sharing your thoughts and I will push myself to walk out of “Helvetica, Arial, Times, Roboto…” to try out something new. Hope this answer part of you question and feel free to have further discussion with me :D ", "creatorid": "360855476672", "timestamp": 1491532045025, "child": "", "username": "fairylie89"}