{"parent": "569", "title": "", "id": "e672c7a0eee0", "name": "569_23", "content": "Mr. Phillips ignores a basic tenet in the world: virtually EVERYTHING is decided by violence. In nature, carnivores of the world feed on the bodies of herbivores that they have violently killed, a “redemptive violence” that keeps them alive. Among humans, every country in the world that has ever existed has been created from violence or threat of violence, and all countries defend themselves as well with violence or threat of violence. And don’t claim Switzerland was created in peace; they are famously neutral now, but they have won more wars than any other country! Mr. Phillips deplores gun violence in schools, yet fails to see that gun violence is always ended with superior violence; either a cop kills the perp — with a gun! — or the perp kills himself with his own gun. Gun violence is always ended with the use of a gun. Imagine, Mr. Phillips, that you are asleep at home when you hear glass breaking. A burglar/rapist/murderer has entered your home! If he is only a burglar, you can hide and hope he doesn’t kill you or rape your wife or daughter. But what if he has his own “redemptive violence” and is there specifically to rape or kill? Either the criminal exercises his “redemptive violence” against you and your family, or else you, using bare hands, a baseball bat, a kitchen knife, or a gun, meet his violence with superior violence and stop the violence he tried to impose on you and your family. See, some violence can indeed be “redemptive.” After eight years of Obama turning the other cheek, the enemies of the US have gotten progressively bolder and more dangerous militarily. China, Russia and even Iran have thought that the US can be attacked at will, and with Obama issuing empty threats but with no deterrent force behind it to stop them, they have greatly expanded their military forces and levels of aggression against the US. By Trump using overwhelming force in Syria, it acts as a deterrent to anyone who contemplates violence against us; they see that we now have the ability and the will to fight violence with violence. Our enemies’ aggressions toward us will subside, now that they see we are willing to fight. Violence will always be with us, since the world, by its very nature, is violent. Thinking we can somehow “evolve” beyond that is childish, merely wishful thinking that gets people killed in a world still governed by the aggressive use of force. ", "creatorid": "afbaee667af8", "timestamp": 1492201157698, "child": "", "username": "rlabruce"}