{"parent": "569", "title": "", "id": "b39e232c432f", "name": "569_15", "content": "There is a lot of dishonesty in this anti-Trump piece and quite a few major and minor misrepresentations of Christianity but one of the most offensive deceptions comes around the ‘bombing the middle-east’ standard hate propaganda. every time we bomb the shit out of some far off corner of the Middle East Yes and it saves lives. Not only saves innocent lives from horrific deaths (those might be the lucky ones) but saves absolutely disgusting torture, suffering, rape and lives of brutal poverty. Source: I do not recommend you look up sources on this! Adding to the sickening depravity of just knowing what happened — ISIS likes to take lots of photos and videos and proudly post them online. In case you don’t believe the reports of locals from their own eyes. Its absolutely savage, hell-on-earth death and mutilation and pain for those innocent civilians. But the pervasive stories of the USA deserving what it gets because it somehow just runs around bombing ‘The Middle-East’ is effective in stirring hatred and justifying violence. In reality, most strikes come as locals, Mid-East governments and good people ask for those strikes. ISIS sex-slaves, those women in a filthy underground jail, raped and tortured while their husbands and brothers are beheaded and they prayed for American bombs to drop even if it meant losing their own lives. Which they described as something merciful if it happened. Nobody ‘shrugged shoulders’ when that purported MOAB annihilated a purported massive underground base and at least 36 savage and demonic ISIS fighters. The base‘s purported fighters were purportedly terrorizing, murdering and brutalizing nearby civilians, Afghani Police and military and US soldiers. ‘Shrugs’? Try fist-pumping, high-fiving cheers by all good men and women who hate death and suffering of innocents. Except the author. Who wanted to make hate-inducing hay out of it. ", "creatorid": "e85e4aa990f9", "timestamp": 1492331954074, "child": "", "username": "trumpthepanda"}