{"parent": "570", "title": "", "id": "3aafb1a0f68a", "name": "570_5", "content": "April 15, 2017 Dear Matt Tolander, The world we live in is so messed up and becaus of that we don’t know what we doing and we don’t know where we are going. As you put it on your article, there are millions and millions people who do not know about Christianity and because of that there mind will be occupied with evil thinking and remain without religion. If ONE make his own search, study, find and follow the right one, Religion is the life of all mankind. I cannot say or anybody can’t say this is the right one and that is the wrong one. But from what we found from the ancient History Books, the Orthodox Coptic Christians is the one given to all mankind by Jesus Christ. The big question is “why Christianity is so divided?” To make the big history short, from Orthodox Christian the Catholic church branch out. From Catholic church Luther protested and created Lutheran church become Protestant. From Protestantism a lot of different churches established. This is how we get our religion. Why Jesus Christ wants to give us religion? Because the life of all mankind was messed up exactly the same as we are now. Before he came to this World he send us The Ten commandments, we didn’t follow. When the day comes to fulfill the promise he gave to our Father Adam, he Showed us how to lead our souls not our flesh; because this world is not OURS; it can be considered as a rental home or apartment. When we hear these kinf of words and about the coming of Jesus Christ, thousands of our minds won’t accept it. But all what he taught and what showed us is all true to lead OUR life in the right direction. Let me put a true story to “MEDIUM” readers. Six years ago, a friend of mine invited to visit Ethiopia and I had the opportunity to visit most of the Historical monasteries and churches. One Sunday, my friend took me to a church where one holly man was curing people by calling the devil to come out from the people. A lot of people were crying, shouting and fall down when they get near by him. He talks to the devils where he got him/her and then forced him in the name of Jesus Christ, in the name of St. Mary, St. Michael and St. Gebreal etc. to leave the person and to go to hail. After that with in two minutes the person starts asking “what happened to me?--where am I?” etc. After that the person the person will be a real human being. The most important thing I visited was “The Arck of Covenant” the Cross where the right hand of Jesus Christ was placed, The Holy people where they live. I had the opportunity to visit an amazing church, they call it “Lalibela Church”. This church was not built, but curved from the rock and that church should be considered one of the wonderers of the world etc.” After I saw all the Historical churches and places, I put myself to study more about Christianity and became an Orthodox Christian. After that my mind setled and become a real human being. I would like to thank medium for the opportunity we got to exchange ideas. Workye Zekarge ", "creatorid": "bc10ee9fc10d", "timestamp": 1492291832702, "child": "", "username": "abibete47"}