{"parent": "587", "title": "", "id": "c71b6718ef1a", "name": "587_8", "content": "“…but it would have been awesome if she’d let herself be a fantastic mom who also spent ten minutes a day … painting landscapes or developing photographs in a closet darkroom.” My mother died more than 20 years ago in Silver Spring, Maryland. She lived in a house she and my also-deceased father bought when he was transferred to the Department of Education after our return from his posting in the Middle East with the U.S. State Department. She was very excited about living in suburban Washington, D.C., and said she looked forward to being active. After all, it is the center of history for this country, an easily-accessible location to see much of what makes our country famous. One can visit the Smithsonian Museums, read original documents, even visit the house of the president. Many of them were within easy walking distance of her husband’s executive office. But she did none of those things. For some reason, she cloistered herself in her suburban house and never set foot on what was then the marvelous Metro system. Not. Once. She had no hobbies or ways to pass her time. Though she was a classically-trained singer and pianist, she had no piano and did not use her marvelous voice in her community. She never visited the Kennedy Center to hear operas sung by masters or hear the Kennedy Center Jazz Orchestra or a symphony. She never planted or worked a small urban garden. She had no pets. With the exception of my youngest sister while she was a student at George Washington University, her children were adults living and raising their families elsewhere. She remained cloistered in her house, smoking her cigarettes in her bathroom, wasting away with emphysema until the day she died. And my father never retired. He died at his desk with a retirement account full of unused potential. I promised myself I would not end like that, so in my own retirement, I have written blogs, done genealogical research into my family tree, bought a ukulele so I can learn to play and sing (unlike my mother, I am not a classically-trained singer) two songs, and begun online courses to continue my grad school studies; I want my brain to be active. ‘Doing’ is preferable to just ‘being.’ My mother always had an excuse for not doing. I refuse to play that part. ", "creatorid": "f9e5ea66971", "timestamp": 1489417574325, "child": "", "username": "denalidad"}