{"parent": "737", "title": "", "id": "2d059c41cdcf", "name": "737_24", "content": "Your article should be titled How I Detect Fake Memes. Obviously that image isn’t “news.” Fake news stories are usually very easy to debunk. The problem is, very few people have any interest in debunking them. I’ve seen many cases on Facebook of people passing along articles based on the headline without ever reading the article. Many people express their outrage after reading the headline, without reading the article. In a matter of seconds, the sequence is: Read alarming headlineType angry commentShare I used to spend time debunking fake news stories and posting comments to alert others, and alerting a group admin that a story was fake and should be removed, and often times requesting that the poster be removed as it was clear that they were only a group member for the purpose of posting click-bait. But not everyone reads the comments, and the more comments a fake news story gets, the less likely it is for anyone to see the debunking statement I made. Eventually I just gave up, realizing that people on both sides of the election were doing it, so there was little point in trying to get my side to stop it. There’s a bigger problem than fake news though. It’s memes with false information. They are rapidly consumed and shared. They’re the equivalent of gossip spreading through a crowd. No one cares if what the meme says is true or not. If it serves one’s viewpoint, they pass it along. If it doesn’t, they ignore it. Some, without a political stake, will pass it along because it’s sensational or titillating. But there’s an even bigger problem than fake memes, and that’s the apparent news we see on cable news talk shows. We assume the hosts and guests are talking about factual things that actually happened, but there is no fact-checking, and statements made are rarely asked to be backed up or sourced. These people are talking about the distorted version of events as if they were factual, and because they’re talking about them on CNN or Fox, etc., they have the appearance of being facts, and thus news. And even worse than the talk about apparent news is the actual false news from the most “trusted sources” themselves. A few examples (that those on the left will instantly reject and deny) are false claims that Trump mocked a disabled reporter, or that he confessed to sexual assault. Many people wouldn’t hesitate to pass along these alleged facts after seeing them reported endlessly, and then talked about endlessly. Other distortions come from careless repeating of partially true statements, such as “Trump called Mexicans rapists” or “Trump wants to ban Muslims.” These statements, and many more were repeated daily by those now claiming to have a concern about fake news. That’s a laughable concern. It also shows a massive blind spot on the part of those who made these falsehoods appear as truths to millions of people. The same people are blind to the opposite effect their dishonesty had on the election. Every Trump supporter I’ve ever had contact with knows what Trump actually said about some illegal aliens, so when they hear someone on CNN say that he “called them rapists,” (thus implying that Trump thinks ALL Mexicans are rapists) they also know that they’re being lied to. Or at least that the context is missing, thus creating a distortion of what he said for propaganda purposes. Long ago, news stories were actually stories. Now, more often than not, they contain a sliver of a story, which is not even a fact when isolated from its context. But due to a craving for ratings and thus profits, and a desire to smear the opposition, context is no longer provided. This was also observed in many of the debate questions and in interviews. The goal is to succeed with a Gotcha moment. The reporter or interviewer attempts to lay a trap, and if the subject steps in it, then the reporter has succeeded and may now go on for the next several days in a state of near hysteria, loudly proclaiming that they GOT the candidate. An example of this is the fact that Trump never brought up the idea of tracking Muslim immigrants in a database. It never occurred to him, and having such a thing would be redundant since such immigrants are already in databases after their entry screening. Every immigrant is. How does anyone think we know when a person’s visa runs out? Obviously because the data is recorded, and such records are called databases. But when a reporter asked Trump (who it can be argued wasn’t even paying attention to him) if he would use databases to track Muslims, and Trump replied something like, “Yes, we’ll need to do a lot of things” thinking he was being asked about illegal aliens from the southern border, the story was born: TRUMP CALLS FOR MUSLIM DATABASE And notice how that sounds like this was a Trump idea; something he came up with and proposed, when the truth is that it was a reporter’s idea, and Trump was walking through a crowd, signing a book, and not even truly engaged with the reporter who asked the stupid question. But those facts are called context, and the mainstream news has discarded any need for context because they got what they wanted which serves their opposition narrative —an alarming and untrue piece of alleged information — exactly the same way that amateur fake news and memes do the same thing. In my opinion, the fake news, such as Obama Declares He’ll Never Leave D.C., reported by an online “newspaper” that doesn’t even exist is far less damaging than the fake news promoted by those who are actually perceived as being valid news sources, such as Trump Confesses to Sexual Assault. It used to be common knowledge that you shouldn’t believe everything you read on the internet. So this talk of needing software and algorithms to weed out fake news is akin to a expressing a need to start policing gossip. (I haven’t even touched on the avalanche of false information that comes out of YouTube videos and the absolute lack of concern about lies, slander, propaganda, and general hysteria that exists there.) The mainstream news media’s sudden concern with fake news comes across as their petulant jealousy that they are no longer dominant and in control of what fake news we hear and fall for. The unresolvable problem we’re facing is the fact that our nation is polarized. We’re in a battle for minds where the opposing sides are engaged in an info war. (BTW, you should know better than to trust everything you read or hear from a website called infowars.com. They were ahead of everyone in identifying what’s really going on, but that doesn’t make them a trusted source of information.) ", "creatorid": "750ecf680e8f", "timestamp": 1480176244866, "child": "", "username": "ewolfe"}