{"parent": "783", "title": "", "id": "c79be821f547", "name": "783_7", "content": "Thanks for one the year’s most important articles. To sum up — one of the best ways to miss profits over the long term is to diminish democracy. For example, look what NAFTA did to rural America on both sides of the border: The North American Free Trade Agreement (NAFTA) encouraged U.S. manufacturers to box up their factories and send them to Mexico with their low wages and less powerful unions. Less known is NAFTA’s ripple effect of on the character and culture of both countries, particularly its devastating impact on small manufacturers, family farms and the rural economy. To quote Smithsonian magazine’s recent article on “Living in No Man’s Land,” a journalist’s account of what he learned during several months visiting communities on both sides of the U.S.-Mexican border: “One of the first consequences of NAFTA …was the emigration of the poor from southern Mexico, who had lost their livelihood as farmers and small manufacturers. NAFTA in effect since 1994 had put them out of business. Some ended up in border factories, others as border jumpers.” The author goes on to recount how large U.S. corporate farms were able to flood the Mexican market with cheaper-to-produce genetically engineered food and drive small farmers out of business. Thus, NAFTA helped large corporate farms and manufacturing firms at the expense of smaller ones and rural areas in both the U.S. and Mexico. In other words, in both countries the rich got richer and poor got poorer. Wall Street thrived while Main Street suffered. NAFTA likely contributed to the stagnation of middle class wages, less economic mobility, accelerated rural to urban migration, economic devastation of small towns, neglect of the rural economy, soil erosion and its depletion of nutrients making food less nutritious, more illegal immigrants especially to factory farms that produce inordinate amounts of polluted water, air, soil and food contaminated with hormones, pesticides, antibiotics and chemicals (fertilizers), which diminishes health and raises health care costs. Congress and successive presidents over 25 years have gone along with this. A few made money. As Mr. Trump has said, politicians benefited greatly from their campaign contributions. One would hope he would connect the dots for people and indicate what he would do to protect small business, the engine for new jobs, and the rural economy, the bread basket for the U.S. and much of the world. And why not get a better deal for people on both sides of our southern border? Secretary of Agriculture Perdue, please take note. U.S. agricultural policy has been hurting our democracy and our economy for years. Why do you think rural and small town America voted 3:1 for your boss and was the difference in delivering the White House? Will he deliver for them? What are you doing to help? ", "creatorid": "445d5cf02d61", "timestamp": 1492269907054, "child": "", "username": "bsels"}