{"parent": "850", "title": "", "id": "920fa45cede3", "name": "850_2", "content": "Congrats on your decision to make the leap into programming! It is going to be a very busy time over the 3–4 months+. And it may seem crazy to suggest but I think with your background and already being introduced/classes in Java, C++, it’s not too soon to suggest some things I wish I had done earlier in my own programming bootcamp experience. Namely when I started researching job interviews/preparation there seemed to be an unending list of things “to know” , http://blog.triplebyte.com/how-to-pass-a-programming-interview related to data structures and algorithms. I wish I had started studying these fundamentals and theory earlier and spread them over my time and not just focused on building and coding projects. Along with Cracking the Code interview for interview prep, I’ve found Robert Sedgwick’s book Algorithms 4th edition, and videos very useful and accessible(though very detailed and complex in some areas especially at first) going in depth into CS fundamentals — Search, Sort and Graphs, you name it. It will force you to start thinking about space and time complexity. It has real implementations of data structures and algorithms in Java and I think you may already be familiar with the author because Upenn’s syllabuses has his intro book in CS110. TLDR: The time will move quick, the resources below helped me feel much more comfortable with algorithms and data structures. The best way to defeat imposter syndrome is through action and preparation. Even if its only 15 minutes a day with your loaded schedule take the time to try and code up relevant examples/elementary data structures(linked lists, stacks, queues) and write out time and space complexity. Spaced repetition will make them familiar and clearer with practice. And if you already know all that great! try implementing them in javascript or just go deeper in the course its all free and out there! Good luck and looking forward to reading more about your future success on Medium :) COS 226: Lectures (Fall 2016)Lectures are pre-recorded and posted online for your convenience. Note that each lecture has a due date; you are…www.cs.princeton.edu http://algs4.cs.princeton.edu/cheatsheet/ ", "creatorid": "aa680848b37", "timestamp": 1492050861520, "child": "", "username": "twhitinger"}