{"parent": "911", "title": "", "id": "eb4dc7f2bdbf", "name": "911_7", "content": "There are two fundamental problems associated with the present system of international trade: persistent trade deficits and surpluses, and systemic manipulation of international taxation by multinational corporations. This comment addresses them separately. Beginning with the issue of persistent trade imbalances, let’s do a little elementary mathematics. It doesn’t take a Fields medal winner to understand that when you sum up all imports and exports worldwide, the total must be equal to zero. This should be obvious to the meanest intelligence. It follows that any nation that possessed of a trade deficit is subsidizing the economy of any nation that has a trade surplus. In fundamental economic terms, a trade deficit is indistinguishable from exporting jobs. It follows that the economic multiplier associated with those jobs is also exported. This is one of the elephants in the room that no one in authority seems to with to discuss. The obvious solution (which appears to be politically impossible because of the bias of the present economic system in favor of large corporations) is the institution of a system of balanced trade. There are obvious examples (German trade policy, to name just one). Most importantly, balanced trade works. So why don’t we engage in it? Balanced trade doesn’t care about currency manipulation or any other technique utilized to rig the system. It simply requires that “trading partners” are actually trading partners, not thinly disguised mercantilists or economic colonists. The underlying mechanism is exceedingly simple: trade with us or make up the difference in tariffs. We don’t care which, but the books will balance. Free trade is an illusion. It has never existed on this planet and never will. There will always be gaming of the system. Balanced trade is the simplest way, and most easily enforceable way to deal with the inequities caused by the system which is in place. There is a more detailed exposition of the topic available, but it is beyond the scope of this comment. The second topic is the manipulation of international taxation by multinational corporate entities. There is one more major problem associated with the abuse of international trade by multinational corporations: gaming of international taxation (i.e., corporate inversions, smoke and mirror accounting techniques, and tax havens, just to name a few). These abuses are allowed to exists, and even grow for the same fundamental reasons that mitigate against the institution of a policy of balanced trade: it is in the (unenlightened) self interest of the economic and political elite to permit them to continue. Unitary taxation is the principal of taxing the revenues of a multistate or multinational entity on the pro-rata share of business it does with your political entity, regardless of wherever it was earned. It eliminates any opportunity to engage in tax avoidance by internal accounting techniques such as shifting profits between subsidiaries through artificial internal pricing. It also eliminates the ability to avoid taxation through offshoring and corporate inversions. The State of California used to enforce unitary taxation before the U. S. Supreme Court found it to be unconstitutional. I have always wondered why the Court chose to rule against it. I do not care for the implications which follow from any reasonable analysis of the possible motivations underlying the decision. The problems have solutions. Unfortunately, the solutions are not in the economic self interest of what passes for economic and political leadership in the present day. ", "creatorid": "c7d8178aa757", "timestamp": 1492367676561, "child": "", "username": "r_c_jansen"}