{"parent": "913", "title": "", "id": "333dacbcb1c9", "name": "913_3", "content": "« taking the future into one’s hands and molding it with a little bit of love, a lot of courage, and a spoonful of wisdom. » My response is NOT proselytizing (I’m an atheist). I suggest to read Pope Francis’s Encyclical « Lausato Si ». If the Believer follows his/her heart and faith, a new fair world can be constructed. The Encyclical talks of concepts like the ones you mention (plus many others, as the encyclical is quite long…). But it says where the problems are, and indicates « lines of approach and actions» (chapter 5). Within Democracies, by definition, the people have the power to decide of their future. And, over decades/centuries, the people get what they have collectively constructed. Jean P. Ciron §§§§§§§§§§§§§§§§§§§§§§§§§§ Laudato Si — English : Laudato si' (24 May 2015) | FrancisEncyclical Letter Laudato si' of the Holy Father Francis on care for our common home (24 May 2015)w2.vatican.va >>> CHAPTER ONE : WHAT IS HAPPENING TO OUR COMMON HOME I. POLLUTION AND CLIMATE CHANGE III. LOSS OF BIODIVERSITY IV. DECLINE IN THE QUALITY OF HUMAN LIFE AND THE BREAKDOWN OF SOCIETY V. GLOBAL INEQUALITY VI. WEAK RESPONSES VII. A VARIETY OF OPINIONS . >>> CHAPTER TWO : THE GOSPEL OF CREATION I. THE LIGHT OFFERED BY FAITH II. THE WISDOM OF THE BIBLICAL ACCOUNTS III. THE MYSTERY OF THE UNIVERSE IV. THE MESSAGE OF EACH CREATURE IN THE HARMONY OF CREATION V. A UNIVERSAL COMMUNION VI. THE COMMON DESTINATION OF GOODS VII. THE GAZE OF JESUS . >>> CHAPTER THREE : THE HUMAN ROOTS OF THE ECOLOGICAL CRISIS I. TECHNOLOGY: CREATIVITY AND POWER II. THE GLOBALIZATION OF THE TECHNOCRATIC PARADIGM III. THE CRISIS AND EFFECTS OF MODERN ANTHROPOCENTRISM . >>> CHAPTER FOUR : INTEGRAL ECOLOGY I. ENVIRONMENTAL, ECONOMIC AND SOCIAL ECOLOGY II. CULTURAL ECOLOGY III. ECOLOGY OF DAILY LIFE IV. THE PRINCIPLE OF THE COMMON GOOD V. JUSTICE BETWEEN THE GENERATIONS . >>> CHAPTER FIVE : LINES OF APPROACH AND ACTION I. DIALOGUE ON THE ENVIRONMENT IN THE INTERNATIONAL COMMUNITY II. DIALOGUE FOR NEW NATIONAL AND LOCAL POLICIES III. DIALOGUE AND TRANSPARENCY IN DECISION-MAKING IV. POLITICS AND ECONOMY IN DIALOGUE FOR HUMAN FULFILMENT V. RELIGIONS IN DIALOGUE WITH SCIENCE . >>> CHAPTER SIX : ECOLOGICAL EDUCATION AND SPIRITUALITY I. TOWARDS A NEW LIFESTYLE II. EDUCATING FOR THE COVENANT BETWEEN HUMANITY AND THE ENVIRONMENT III. ECOLOGICAL CONVERSION IV. JOY AND PEACE V. CIVIC AND POLITICAL LOVE VI. SACRAMENTAL SIGNS AND THE CELEBRATION OF REST VII. THE TRINITY AND THE RELATIONSHIP BETWEEN CREATURES VIII. QUEEN OF ALL CREATION IX. BEYOND THE SUN (Franciscus) §§§§§§§§§§§§§§§§§§§§§§§§§§ ", "creatorid": "c19adf5a4c17", "timestamp": 1492352990273, "child": "", "username": "Ciron"}