{"parent": "915", "title": "", "id": "d5317cb2f5b0", "name": "915_20", "content": "I have to agree, I like one person businesses… I can turn on a dime, clean up the mess and get back to business. However I also get dozens of email offers of companies selling “We will make you great!” 6 figure income in 60 days BS…. Yeah, at 59 years old I have heard that sales pitch since 8 years old when I tried selling door to door for Watkins Spices… what a joke. The other day I got a sales pitch and just decided that since that email “person” asked “What is holding your sales & company growth back?” I decided to respond. I stated quite frankly, “I am a “WHISTLE BLOWER” A PERSON WHO FINDS & FIGHTS CORRUPTION. USA media makes us the bad guys so no one want to hire a “Whistle Blower” as they might turn on your bad behavior. That person responded back, “Well, I understand your position and obviously you are AFRAID TO TRY AND BUILD YOUR BUSINESS. Please contact us should you ever change your mind and decide you can build your business into something you dream of.” Wopp, insulting a truthful person & using insult to gain a sale! The title of sales & the lack of understanding what th4e client is or about was obvious. They just read a script and don’t think about what they say. I don’t know how many jobs where I have seen such behavior, but one of the best examples of “Having a Job Title with no clue of what it meant to the company was the newspaper publisher I worked 9 years for. The friend of the publisher was given the “TITLE” of IT Tech & the pay increase to match it. However everyone in the company called me for the advice and rescue of the company computers, the maintaining of the network & training of computer use. At one point the entire main office MAC system get a virus and it shut most everything down. The next day was the “big production” day, so I went home got my equipment of my home business, and after doing my work as Photo Editor for the day, about 5pm I walked around telling every to “PUT EVERY DISK they had on the TOP OF THEIR DESKS… I then as everyone when home disconnected units, disinfected them, then put that computer to work disinfecting disks. 6:30am I had finished the entire computer network, picked up my gear and when home to get some sleep before needing to come back to do Photo Editing. Yep, you guessed it, a couple hours later I get a call telling me I did not do it right everything was infected and shutting down. So I grabbed my stuff and ran back. As I checked the systems, I walked in to the “IT TECH person’s office and sitting on his desk as a COUPLE OF GAMES DISKS”! Knowing I had not seen them in the “disinfection of last night” I challenged him and he admitted he did not want me to know he played games every morning during his warm up coffee, so had not put them out. He walks in a 7 am, and had reinfected the system in just 2 hours! I did the work, he had the title & paycheck. And nope he never got in trouble either… he got shamed by the employees, the Upper Management never cared. I had the system running quickly enough to save the day for them. I’ll stick to my one person businesses… I screw up my fault, my fix… ", "creatorid": "fa4567bae4d2", "timestamp": 1491668265756, "child": "", "username": "petervanderhoof"}