{"parent": "917", "title": "", "id": "8834ce10fe5d", "name": "917_5", "content": "Full disclosure. I’m not a CEO, my friend and I have one employee! So I’d say this is more from the perspective of an employee. I can understand the desire to avoid contentious debate in the workplace. I really disagree that it should be viewed as a problem. Although I’m a quite political person and I’ll be honenst, I can be quite mouthy. I mean this from a hopefully nonpartisan viewpoint. There’s been a general trend over the last 50 years across the Western world for communities to become more homogeneous. There’s a good book about this called the Big Sort by Bill Bishop. One can see this at first hand. The boom in cheap credit and it’s associated housing bubbles has led to people to buy the most expensive house they can, especially in the UK. This leads to tight economic clustering. A driving motivation is so they can get their child into the best school. Bill Bishop points to liberal communities becoming more liberal and conservative communities more conservative. The middle sector of the economy has been eroded so if you start in a low paid job you are more likely to stay there. The social mobility that my baby boomer parents experienced has gone. Social media only delivers people news and culture that they aleady like. I would argue that our ever increasing tendency as a society to constantly take offense, whether it be liberal political correctness or more conservative family values are symptomatic of this. We increasingly live in echo chambers. I think the role of CEO’s should be, to an extent, to encourage debate and to learn how get along with people who’s views you may not like. I think the polarisation of Western politics is very much exacerbated by the tendency to be surrounded by people just like you. It’s easy to develop increasingly extreme views of the world when the only opinions you hear are ones just like yours. One could argue that this kind of civic duty is not a CEO’s role. I’d argue then, that the that CEO is simply in another echo chamber. This increasingly volatile world can’t be a very predictable place to do business. ", "creatorid": "9901aef83c7b", "timestamp": 1491852468590, "child": "", "username": "fresnobob"}