{"name": "0_4", "parent": "0", "content": "Professional? F*ck yeah! The wages of speaking truth to bullshit No question about it: dropping the f-bomb adds punch to a sentence. Be it publicly proclaimed or privately spoken; written, e-mailed, or forwarded; quoted, misquoted, or paraphrased — spritzed with a few blue notes your message leaves more of an impression. Any concern as to whether it leaves a better impression? That’s probably secondary. Will these guys ever shut up? Need to cut through the f*cking noise here… We live in a high-bandwidth world. The rate of change is speeding up faster than ever. Our limited attention spans are tapped out and oversold. Unless you just enjoy speechifyin’ or the sound of your own voice, then it’s like the old “bad publicity” chestnut suggests: whatever odors it may acquire in the process, having the message stick is preferable to seeing it washed away in the unrelenting stream. From that perspective one could argue that, at least in the business world, profanity is the state of the art in rhetoric: that venerable craft of beating a persuasive and memorable message into your audience. In our age of “shock and awe,” any carefully reasoned and well worded argument ripped from the pages of yore is most likely going to be dismissed with a side order of derision, served up in five succinct keystrokes: tl;dr. In essence, what we are talking about here is durable relevance hacking. Four score and f*ck this we got shit to disrupt So into the obdurate rock face of your listener’s memory you drive that swear word like a piton, thread the message through it, and leave your chosen web of wisdom hung up there like christmas lights on the fourth of july: a glittering conversation piece for anyone being bussed through the neighborhood. It really works! A personal example: One of the few specific recollections from my limited exposure to formal “management” training was a former airline CEO offering this advice on employee incentives: Don’t tell the fish about the goddamn water! By which he meant that the simple fact of continued employment — the employee being the fish, the water being the job — was never going to be perceived as an incentive. I’m not saying I agree or disagree with that perspective; my point is simply this: years later, I remember the exact wording, the intended meaning, and this one guy out of a cavalcade of aphorisms and talking heads. In other words, Mr. Bethune managed to cut through the goddamn noise. You can stop whenever the fuck you please Obviously there’s a lot more that could be written about this. Does the system around you become inured to — or alienated by — your salty argot? How much is too much? Are you using the f-bombs and the gd-tmeses as crutches where a lovingly turned soundbite would more nobly carry the day? In other words, are you getting results, and if so what are they “costing” you? Lastly, of course, the ever present: who, seriously, gives a shit? (Speaking of which — weren’t you promised, up there in the subtitle, some apposition involving bullshit? Indeed you were. The bullshit being, I suppose, whatever context it is into which you are thrusting or over which you are interjecting your obviously more relevant utterances. Does that sound like arrogance? Only if that other bullshit was worth a damn — and what are the odds of that?) Ultimately, as always, propriety ends up being in the eye (or ear or mind) of the beholder. Take two parts “know your audience,” one part “know thyself,” mix thoroughly until it forms an oleaginous paste, and slather it wherever the fuck you bloody well please. Good luck, and happy **cking! ", "child": "", "creatorid": "7a60965360fd", "username": "t0dampier", "title": "", "timestamp": 1430891211444, "id": "47ce9939d6c6"}