[{"model": "api.Comment", "fields": {"content": "This editorial is long, long overdue.  President Obama tried to move Congress, which wouldn't budge.It's derelict and the reason for being so, is based on a very sneaky motive: how much Congress loves to carp from the sidelines when things go wrong, but never take responsibility for decisions to move troops in in the first place.  The standard excuse is always, just a few \"advisers\" which never seem to stop at that, once bullets start flying.General Mattis should force Trump's hand on this: after all, he bragged and bragged about how strong he'd be in fighting ISIS.  That he had a \"great\" plan in mind, but wouldn't reveal it.  I wonder if his \"plan\" included making Congress authorize it?Knowing Trump, it didn't.  If Trump who thinks he knows more than the \"generals\" would ask his own General Mattis about that, maybe Mattins could convince him.Otherwise, America will continue on its merry way of asking America's poorest sons to go fight a war no politician wants his own family to fight.  If you want war, Congress, grow a spine, and authorize it.", "author": "", "sentence": 2807}}, {"model": "api.Comment", "fields": {"content": "Susan Cain addresses a real problem but frames it incorrectly, in my view. It isn't that college admissions offices are Favoring \"alpha\" types. Many colleges assess students' teamwork skills--and many (including the ones Cain mentions) emphasize academic excellence and interest first and foremost. Moreover, admissions officers wrestle with questions and uncertainties.Part of the problem is that colleges are evaluating far more applications than before, thanks to the Common App and other factors. This makes it harder for individual students to stand out; hence the pressure (perceived, real, or both) to excel on all fronts, to go \"above and beyond.\"Also, we live in an era of buzzwords and Big Ideas. Yes, there's much vague talk of the importance of leadership--but also of teamwork, social justice, creativity, etc. These terms mesn little in the abstract: as commenters have pointed out, \"leadership\" can mean many different things. Admissions officers want it to mean something; they probably won't be impressed with a president of twenty clubs. Part of the challenge, then, for students, admissions officers, op-ed writers, and others, is to use language precisely and richly and to look beyond jargons and types. Rather than embrace \"followership,\" a good college seeks students who show promise and interest in the subjects themselves. Does the current admissions process allow for this? That is another question.", "author": "", "sentence": 2809}}, {"model": "api.Comment", "fields": {"content": "My father was a NASA engineer. (Ast happens he worked at the same time and the same place as the women in \"Hidden Figures.\")  Twice he was offered promotion to division chief, and each time he turned it down.  He knew himself well and recognzed that while he was an absolute gun at structural dynamics and made contributions that influence the design and modelling of aircraft even today, he was terrible at managing people.  He just didn't care about that stuff.A few years after he retired he was cajoled into taking over a troubled project in the private sector.  The money was far better than anything he'd earned working for the government, and he let the old colleague who recruited him sell him on the romance of being the heroic leader who rides in on a white horse and keeps a $100 million contract from going down the tubes.  It nearly killed him.  He hated it.  There were technical problems that needed to be overcome, but the factors that were putting the project in jeopardy were all due to personnel.  Like you say, not everyone has to be a leader.  If you gave my old man a slide rule, a ream of graph paper and a supply of IBM punchcards, he would - and did - help put a man on the moon.  But if you asked him to inspire others to join such an endeavor or, worse, asked him to discipline those who failed to measure up, he'd just as soon jump out the window.", "author": "", "sentence": 2807}}, {"model": "api.Comment", "fields": {"content": "Congress should definitely act on the ISIS issue.  It should forbid us from spending one more penny, one more minute, or one more American life fighting ISIS.  Of course, ISIS is the perfect foe for our current military-security complex-  while we can't actually defeat them, they can't actually hurt us.  They are a ragtag militia armed with nothing more than small arms and a willingness to die. If ISIS did not exist, we'd have to invent them, to justify our bottomless spending, spying, and interference in the internal affairs of sovereign nations.    ISIS is not our problem.  If it was in Saudi Arabia's interest to do so, they would wipe ISIS out like a greasy spot.  Let Saudi Arabia carry on this fight, instead of using the jets we give them to bomb civilians in Yemen.", "author": "", "sentence": 2805}}, {"model": "api.Comment", "fields": {"content": "This is exactly the type of rhetoric that led to a protracted war in Vietnam. The passing of legislation that allows a president to, at his discretion, engage militarily in a foreign land is a direct contradiction to the values of our Constitution. It does nothing but allow an escalation of a war without the will of the people. War should be a process that has the support and consent of the people and the legislative body at every step of the way. ", "author": "", "sentence": 2802}}, {"model": "api.Comment", "fields": {"content": "Given that Donald Trump has proclivities towards fighting, abusing his power, and against checks and balances, Congress cannot give him an inch.  This is a man who spoke loosely of using torture and killing suspected terrorists' families.  This is a man who has alienated allies.  This is a man who makes up terrorist attacks and fake reasons for immigration bans.  This is a man who called President Obama the founder of ISIS, like it was a fact.  This is a man who spoke of bloody retaliation for giving the finger to an American ship.  This is a man under the sway of an outside, militaristic leader.And this is a man who is tanking domestically and could easily look for a foreign cause to distract people and rally support.  No matter how many generals he has surrounded himself with, Trump does not rely on them so much as his own whims.  And our legislators must never lose sight of their own oversight of him.", "author": "", "sentence": 2806}}, {"model": "api.Comment", "fields": {"content": "Before getting involved in Syria you should ask yourselves  ,What do I want Syria to be ?  And please not that fantasy answer : democracy. ( Democracy can only come from within , it took Europe many bloodied centuries ). No, what the west , and most locals, want is a Secular State .One where women can travel and be professionals and religious communities live side by side. As ten years ago.Now arming the  Syrian rebels to fight ISIS is arming them to continue the civil war in Syria and feed sectarian wars that are becoming religious. Or are they disarming after eventually finishing off the ISIS threat ?", "author": "", "sentence": 2802}}, {"model": "api.Comment", "fields": {"content": "The framers of the Constitution endowed Congress with the authority to declare war, partly to limit presidential power, but also to force a public debate on the advisability of military operations. Since 1945, however, we have rarely followed the rule they set down in the Constitution, and partly for that reason, we have tended to engage in conflicts that lacked clear goals or strong popular support.In the absence of a major attack that posed a serious threat to national security, as happened on 9/11, only a thoroughgoing debate in Congress and the press could forge a popular consensus in favor of military intervention.  The refusal of Congress to demand a coherent justification from presidents of either party for ongoing operations, long after the overthrow of the Taliban, has left the public confused and divided over our real goals in the Middle East.Madison and his colleagues believed that a republic could not fight a war effectively without the informed support of the people.  The mixed, generally unsatisfactory, results of our military ventures since 1945 confirms the wisdom of that view.  A vigorous debate over Vietnam, before we committed our troops, might have exposed the dubious premises behind that conflict, along with the government's vague goals.  A similar discussion over Iraq, undistorted by bad information, almost certainly would have spared both Iraqis and Americans a disaster.The framers, in this case, knew what they were doing.  ", "author": "", "sentence": 2802}}, {"model": "api.Comment", "fields": {"content": "This editorial is long overdue and unnecessarily watered down. The founders were clear that the president could order troops into battle when that meant defending the nations boarders and citizens against Indian raids.Even then, this 'defense' authority was more often coming to the aid of settlers who were illegally seizing Indian land in violation of treaty agreements. But the constitutions is clear that acts of war, recognized by international law required a declaration of war. When, as now the 'enemy' is an organized entity within a state but not an actual state, the US must be invited in by the recognized state and leave when asked to.Most of our military action over the last thirty years has ignored this requirement. We invaded Iraq and Afghanistan with congressional authorization, but not a formal declaration of war as the constitution requires.We have committed war against numerous countries without even this flimsy authorization. Recently this includes Somalia, Yemen, Libya and Syria. Earlier it has included Grenada and Panama, both full fledged invasions.Members of congress want to wave the flag but don't want to explain to their constituents why they have committed their sons and daughters to war. So they leave it to the president. If successful, they join the parade. And if not, they pretend that they didn't know what was going on.This rejection of their clear constitutional duty must stop. Explain to us why we continue to be at war for the last 16 years?", "author": "", "sentence": 2803}}, {"model": "api.Comment", "fields": {"content": "I am often responsible for hiring entry-level staff in a prestige field (literary publishing).  I get swamped with the CVs of recent grads from a wide range of colleges.  I've gotten to the point where I almost always set aside the resumes from Harvard, Stanford, Amherst, etc. in favor of the kids from flagship state schools like Wisconsin, Texas, Illinois, Minnesota.  Why?  Because the kids from \"elite\" private colleges almost always possess a pathological competitiveness that compels them to try to dominate every situation and every relationship.  By contrast, the state-school kids offer the same intelligence with humility and cooperativeness.  For me, it's become a no-brainer where to go for recruitment.", "author": "", "sentence": 2809}}, {"model": "api.Comment", "fields": {"content": "I'm in general very introverted, and I graduated not ever having been president of anything. I'm currently a freshman in college, and, as you might expect, the \"leadership\" thing haunted me throughout the application process. Every now and then I see writers in publications like the NYT or the Atlantic take up this topic (they never seems to change much), and every time I see one of these articles there's usually a lean towards, and in some cases a total embrace, of a paradigm in which the world has only two kinds of people--leaders and followers. This article mentions that people can be things like \"team players\" or \"artists\", but although it doesn't necessarily mark them down as \"followers\", the title and introductory paragraph of the article seem to suggest that these people are, indeed, intended to fit into that category. It seems to me that by accepting these sorts of binary labels, even those critical of the \"leadership\" attitude implicitly accept that the world is made up of a faceless mass of \"followers\" who are put in their places and only set on the way to greatness by the few exceptional individuals--the leaders. I don't think that sort of rhetoric helps us escape this mindset any more than a visit to the Harvard admissions page does. So why keep using it?", "author": "", "sentence": 2809}}, {"model": "api.Comment", "fields": {"content": "I thought being an American during the George W. Bush years was embarrassing enough.  I was mistaken.", "author": "", "sentence": 3208}}, {"model": "api.Comment", "fields": {"content": "I work in the software industry, and I have a saying, \"If you're stupid, you can be a bad software engineer, but if you want to be a really, really bad software engineer, you have to be really, really smart.\" That's the only way you can do some real damage.So I have to give the George W. Bush administration credit. With truly brilliant minds like Dick Cheney and Karl Rove, they managed to get us into the Iraq War, the greatest foreign-policy disaster in American history and the gift that keeps on giving with ISIS, the Syrian civil war, the refugee crisis, and the destabilization of Europe. Add to that record of accomplishment an exploding federal debt and what was by far the worst financial crisis since the Great Depression.It's becoming clear that the one thing holding the Trump presidency back from competing with the Bush II presidency as one of the worst in American history is that the Trump administration simply lacks the competence.", "author": "", "sentence": 3208}}, {"model": "api.Comment", "fields": {"content": "I do believe that Trump personally has no policy or ideal that informs him beyond  the \"I am the Greatest\". Thus he has been the perfect useful tool.As he started to propel himself into the political arena, it was never about staunch Democratic or Republican values that he wanted to work toward but hey the cameras are on me and they interview me all the time now. Thus as he moved up the political food chain, it was easy for those more skilled to latch on and mold the Donald.Thus he eventually ended up being manipulated by the Mercers and Steve Bannon. This worked because they spoke to his racism and mean nature. And since Trump likes to mix things up he also took on more moderates like Priebus.All these competing influences do not make for a coherent focus for the White House and Trump does not care.Say what you will about past Presidents, Reagan or Obama for example. Each in his own way had a PERSONAL and intimate vision about governance and American democracy which they were able to base their actions upon and convince others of. Trump does not. It is said that he acts based upon the last person he spoke to so no wonder there is no coherent vision. Trump does not believe that all press is good press. This is when he gets mean and dangerous.And we are left hoping that it was Jared he spoke to last.", "author": "", "sentence": 3219}}, {"model": "api.Comment", "fields": {"content": "As Mr. Kristof says, Neil Gorsuch may be a \"first-rate lawyer,\" but he is also an originalist, corporate, inhumane ideologue whom I do not want to see filling Scalia's slippers on the high court. The Republicans talk a good superficial game of caring and patriotism, but they mainly seem to be good at destruction unless you're already a member of the 1%, in which case they deem you worthy of protection and power.", "author": "", "sentence": 3211}}, {"model": "api.Comment", "fields": {"content": "Am I crazy to think that perhaps Trump's incompetence is a silver lining to the dark cloud of this administration? The least harmful outcome may be that the Trump administration achieves very little - all bombast, while their wheels spin in the mud?", "author": "", "sentence": 3208}}, {"model": "api.Comment", "fields": {"content": "Incompetence, indeed. And a large part of that is lack of sense of responsibility to anyone other than himself, family, and \"friends.\" Let's say that, ok, the GOP had the right to propose and put in place an improved healthcare plan, since everyone knows that the ACA needs work. So, they tried, and failed in every way -- their plan was not better and couldn't be sustained even within their own ranks. Now the duty of all upright public servants (if there are any in the new regime) is to say, ok, we have to take what we have and make it as good as it can possibly be. Will any one of them do this? Especially the so-called president who is so quick to bark out orders and demands. Let's watch and see -- each and every one of them. This will go a long way towards showing us how to vote in 2018 and 2020, if we don't already know.", "author": "", "sentence": 3206}}, {"model": "api.Comment", "fields": {"content": "You can't negotiate effectively if you haven't mastered the issues being negotiated. And with as short an attention span and as incurious as President Trump apparently is, and given the complexity of the issues to be legislated, it's hard to be optimistic that Washington will deal effectively with any of the challenges our nation faces.", "author": "", "sentence": 3206}}, {"model": "api.Comment", "fields": {"content": "It is at least a little heartwarming to realize that republican effectiveness pales in comparison to their malevolence.", "author": "", "sentence": 3208}}, {"model": "api.Comment", "fields": {"content": "* First Muslim Ban executive order--struck down by the courts* 2d Muslim Ban executive order--struck down by the courts* General Flynn--forced to resign for lying about Russian ties* Sessions forced to recuse himself for lying about Russian communications* Trump bill repealing the Affordable Care Act--defeated by GOP.Are we \"winning\" yet? There is a Charlie Sheen quality to this fascinating and horrific train wreck of an administration.  A man simultaneously self absorbed but unable to actually look at himself in a mirror and see any semblance of reality.  Continuing his manic and compulsive deceptions he actually blamed democrats for his bill's failure--a bill he knew very little about and just pronounced that it was \"great!\"  The new plan is to make certain that the Affordable Care Act dies a public and horrible death and then try and blame democrats. His tactical stratagems are predictable and getting pathetic.  One wonders if the GOP will ever actually attempt to govern--rather than focus solely on destroying President Obama's legacy.  The latter has been their raison d'etre and they do not seem to know how to come up with a productive and moral one. ", "author": "", "sentence": 3219}}, {"model": "api.Comment", "fields": {"content": "Yep, Trump failed and has egg on his face. But part of the failure wasn't due to the Republican's Health bill being bad (give-aways to the rich, cut coverage for the poor, elderly, etc.), it was that some Republicans didn't feel it was bad enough. If he had embraced the Freedom Caucus's \"repeal and rejoice\" approach, it might have passed - and may yet.", "author": "", "sentence": 3219}}, {"model": "api.Comment", "fields": {"content": "This kidney stone of a bill was never going to pass without inflicting great pain on somebody, and I'm glad it was the so-called president, along with Republican frauds like Paul Ryan.  It couldn't happen to a nicer bunch of millionaire sociopaths.  That's especially true of the Freedom Caucus, who thought the bill was flawed because it didn't hurt the poor and the sick enough.The president is getting a much needed dose of reality.  His entire administration has been marked by deception, gross incompetence, unjustified claims and international embarrassments, so it's nice to see the chickens finally coming home to roost.  And boy, are they ever.  It looks like a scene from Alfred Hitchcock's \"The Birds.\"  It only took a few weeks of being in the hot seat for the president to realize why it was so named.  His boxers were ablaze in short order.  All the while he tried to distract us from his incompetence with claims of wiretaps, unprecedentedly high crime rates, voter fraud and massive inaugural crowds.  But those things only confirmed the old saying, liar, liar, pants on fire.None of his experience prepared him for the realities of being president.  Surprisingly, the skills one acquires by groping starlets, founding a bogus university, ripping off workers and selling cheap ties do not transfer well to the job of running the most powerful nation on earth.So hold on to your seats, America.  We've got 3.9 years to go, and it's going to be a bumpy ride.", "author": "", "sentence": 3120}}, {"model": "api.Comment", "fields": {"content": "It's of course wonderful to see the House GOP form a circular firing squad, to see Phony Ryan's ineptness exposed (why does the press cut him so much slack?), and Trump's excuse-making getting more threadbare by the day: the Democrats are at fault? Really??But I'm afraid Trump has no learning curve. This deal has gone south, so he will just brush it aside, blaming others, and keep going. One thing became clear in this story, and that was that he had absolutely no interest in any of the specifics of the deal. He made this clear when he made not the faintest gesture toward speaking up for his core constituents, who would be hammered (to use David Brooks's term) by the GOP proposal. He said he had learned a lot about loyalty in this fiasco. It would be nice to think that the unemployed and underemployed white working class also learned something about his commitment to them.  ", "author": "", "sentence": 3102}}, {"model": "api.Comment", "fields": {"content": "If it wasn't the American people that are going to take the brunt of this president's incompetence and incompetent staff, this loss would be a wonderful thing. But it IS \"we, the people\" who will be hurt in the end, no matter what happens as a result of this debacle. Mr. Trump sits in his gilded, golden Oval Office while his Wall Street-focused staff of Department Destroyers remain completely and utterly incapable of ginning up any kind of legislation, as shown by the absolutely mind-bendingly incomprehensible health care replacement they just tried to jam through. To me, this validates the belief that one cannot run government like a business and that \"businessmen\" have little business being in the business of governing.But when they finally do get something passed, it will be \"we, the people\" who will, once again, take it on the chin.", "author": "", "sentence": 3120}}, {"model": "api.Comment", "fields": {"content": "Ms. Dowd, the politically naive Trump and supposedly savvy Ryan, like John Boehner before them, are heirs to an impossible situation.The AHCA debacle evidences the inherent instability of the Republican Party.The GOP establishment's conservative ideologues themselves oppose Trump's (empty?) campaign promises concerning healthcare, Medicare, Social Security, and the repair and updating of the nation's infrastructure. Moreover, the conservative GOP establishment can never satisfy the demands of the ever more regressive \"Freedom\" Caucus and its Tea-Party supporters.Both extreme wings of the GOP base--the new voters attracted by Trump's populist gestures and the Tea-Party regressives--cannot be simultaneously satisfied. Compromise will be viewed as betrayal.Speaker Ryan and President Trump may believe themselves to be skilled Doctors GOPensteins, but their Monster of a Party suffers from an untreatable autoimmune disorder. It aches at every sinew and joint. It scratches at every roughly stitched suture site. It's \"brain\" and its muscles work at cross purposes.The GOP is a patchwork of diverse cadaverous body parts--ever on the verge of collapsing into warring members and organs. The Party's divisive rhetoric of fear and its billionaire donors, in combination with gerrymandering and voter suppression, keep this Monster slouching in place or shambling in circles.How long before voters realize that, once empowered, the Party of \"No!\" becomes the Party of \"No-Can-Do\"?", "author": "", "sentence": 3101}}, {"model": "api.Comment", "fields": {"content": "TrumpCare failed because there was not one person who wanted to trade their Obamacare for TrumpCare.  It is truly telling that the republican congress cares so little for the American people that they went ahead anyway after the CBO rating and actually made it worse.   It is clear that the 150 steeple R's that planned to vote yes do not work for their constituents but report the Club for Growth.  As for President Trump, where was he?  What about promises made and promises kept?  TrumpCare had none of the better, cheaper, more options, cover everyone rhetoric of the campaign...that Trump supported it without any of the features he promised should make everyone's sit up and notice...he is not even trying. We are only 8 weeks in!Trump is a maitre'd that somehow ended up responsible for the kitchen when he really just wants to work the front of the house.", "author": "", "sentence": 3120}}, {"model": "api.Comment", "fields": {"content": "It's really incredible when you think about it. The republican party started demanding the immediate end of Obamacare over 7 years ago. They held majorities in the house and senate and challenged the law in court at least 60 times, accomplishing nothing. They won the presidency and failed even worse. Despite so many tries and so many defeats they clung fanatically to the belief that yet one more round of promising repeal and replace would win the day. The President and his party will have to work hard and long to attain this level of incompetence again!", "author": "", "sentence": 3105}}, {"model": "api.Comment", "fields": {"content": "She's Baaaack!  Thank you for this superb op-ed column.  President Trump's and Paul Ryan's attempts to repeal Obamacare was a failure because their motive was revenge and not improved healthcare replacement.  Americans and even the Republican Americans could see through this. Ultimately, this legislation was going to save money for the ultra-rich.President Trump is now going to attempt tax cuts. Again, his plan clearly favors the ultra-rich.  I hope the Republicans can see through this as well. Hopefully, they will put aside their own personal interests and defeat a bill that will not help the middle class.I worry these two failures will require Mr. Trump to devise another deflection attempt from inevitable criticism.  He is about to be \"played\" again. I hope this will inspire Ms. Dowd to write a follow-up column that is titled: \"Donald, I told you so.\"President Trump", "author": "", "sentence": 3120}}, {"model": "api.Comment", "fields": {"content": "Nothing in Mr. Trump's past shows he has the ability to be a competent president.He is not, despite his boasts, a great negotiator.  He is a con artist who has scammed, duped, and defaulted on creditors, customers, contractors, and foolish people who believed in him.  As Mr. Trump is discovering, members of congress are not so easily pushed around.He has never been a good nor competent businessman as his multiple bankruptcies and business failures attest to.  His inability to properly staff his administration attests to his incompetence.He has no ability to comprehend complex policy issues.  Authors who have written books about him note his short attention span.  Reporting in recent days has documented numerous people within the White House and congress who were surprised that Mr. Trump had little comprehension of what was in the AHCA (why were they surprised).Finally, nothing coming out of Trump's mouth can be believed.  While that may have worked on the campaign trail with many voters, members of congress are not so easily fooled.The result of Mr. Trump's failures is the train wreck known as the Trump Administration.", "author": "", "sentence": 3101}}, {"model": "api.Comment", "fields": {"content": "I certainly am not sold on the idea that Trump ever cared about the \"forgotten people,\" except as useful dupes for his rise to power. And the idea that he had to be flimflammed into agreeing to a massive tax cut for the rich belies the fact that this has been on his agenda all along. Of course, Trump is an idiot and it is quite possible that he believed he could square this circle with his \"Trumped-up trickle-down economics.\" Trickle-down has always been great for delusional right-wingers who want to have their cake and eat it too. But, as Obama said during the campaign, the idea that a man who has done absolutely nothing for the working class during his 70 years of life - except cheat them - is suddenly going to become a working-class hero doesn't make any sense. Trump wanted a \"win\" here but the fact he was willing to give away practically everything that makes healthcare healthcare says pretty much all you need to know.", "author": "", "sentence": 3120}}, {"model": "api.Comment", "fields": {"content": "Art of the Deal in Washington: (1) If someone builds his whole case on negatives - for example, the premise that Obamacare is a \"disaster\" -- he'd better have some sort of realistic constructive solution in his hand, when the time comes to put up or shut up.  If you haven't got the goods, people immediately see that you're all talk - and it's an impression that will never go away.  Also this approach leaves you no backup plan or wiggle room when things don't go to plan. You just end up looking like an unintelligent blowhard. (2) To make deals you need allies and teamwork. It can't be just about you.  If you call everyone names, you can't expect them to come through.  It's about exchanging favors, not schoolyard taunts. These are basics of dealmaking that even junior high school students already know. In this regard, this White House has already failed, completely. (3) The American people are tired of watching ego-wars in DC.  People in government have been hired by voters to do some actual work in a professional, dignified way befitting the seriousness of the job. Voters are paying the salaries and also providing those officials with a fine health care plan. What voters routinely get are a lot of elected officials who cannot or will not do their jobs, who haven't actually read their job descriptions, who have poor attendance, who can't execute tasks they have had years to prepare for, who shut down government, who won't meet with nominees, who quite simply will not listen.  ", "author": "", "sentence": 3128}}, {"model": "api.Comment", "fields": {"content": "Listening to Trump during the campaign spouting his \"I'm gonna do's\" I often thought of the famous line of physicist Niels Bohr, \"We are all agreed that your theory is crazy. The question which divides us is whether it is crazy enough to have a chance of being correct. My own feeling is that it is not crazy enough.\"Now that speculation has turned to demonstration, it's clear that none of Trump's theories are anything enough.  Trump might as well be a Kardashian.  He's someone whose fame has to do with fame and not with being able to really do anything.", "author": "", "sentence": 3121}}, {"model": "api.Comment", "fields": {"content": "Imagine how Donald Trump would have responded if a President Hillary Clinton or President Obama had a Democratic majority in Congress, and their legislation never got off the ground.  Trump would have some choice words, like \"loser,\" \"sad,\" \"weak\" and \"how stupid.\"  The mockery would be ceaseless.Frankly, Trump deserves no more of a dignified assessment.  He was supposed to be the leader, not just of his party, but of our country, and he failed, \"big league.\"  He supported a bill which would have jeopardized health coverage for up to 24 million people.  He supported a bill which would have allowed insurers to offer inadequate policies.  He supported a bill which was hastily assembled and impetuously sent for votes.  He supported a bill on which he did not even want his own name.And Trump only cares about the face he and his party lose from the bill's thwarting, not about what the rest of us stood to lose from its passage.", "author": "", "sentence": 3101}}, {"model": "api.Comment", "fields": {"content": "Yes, but.  Had the bill passed which, let's face it, was a possibility to many Cable talking heads as recently as Thursday, the spin from columnists would be all about Trump the deal-maker.  The press, present columnist included, don't lead with the truth but follow the buzz.  Had Trump won we would all be reading about how unprecedented he can be -- a maverick among DC retreads who do everything the hard way.  Had he prevailed he would still be the same character who tweets lies by the truckload and disparages and/or bullies any poor sod that gets in his way, behavior not forgotten but somehow rendered of less importance by his 'win.'   Trump is now a loser, not for his dishonesty, egotism, and inhumanity, but for failing to make a deal. Had he gotten his bill passed much would be forgotten or at least glossed over.  America in the Trump era, whichever side of the aisle you favor, does seem to bring out the 'angels of our mediocre natures.'", "author": "", "sentence": 3102}}, {"model": "api.Comment", "fields": {"content": "When Ms. Dowd muses about how Mr. Trump got pulled from his own agenda into that of his fellow republicans, I have to wonder what she has in mind. His wonderful mirage of a healthcare plan that never existed? (You know, the one that reduced the cost of healthcare, covered everybody, cut pharmaceutical prices and gave everyone a personal physician.) His plan to defeat Isis that never existed? His plan for more jobs that is another figment of his imagination?We are stuck with an imaginary president who can't even seem to play one on TV.", "author": "", "sentence": 3102}}, {"model": "api.Comment", "fields": {"content": "The man who claimed he knew how to build things has yet to create or build anything other than legitimate fear, uncertainty, and doubt. In many respects, he couldn't have it any easier starting off - a working economy, perhaps most of the country backing his (stated) claim of helping folks who need it most. He'd have democrats in line if he had displayed any real intent on addressing his (stated) constituents' needs. Instead, he's a lying, vain, vindictive deconstructionist.I thought perhaps Mr Trump was an outstanding instinctual animal. Instead, I think he appears to be played by EVERYONE around him; Bannon and the Mercers, the G.O.P, Putin and his minions, Xi, etc. One couldn't conceive a more tragically sad character occupying the Oval Office.Americans do not deserve this. Trump is squandering everything the previous generations sacrificed (including their lives) to attain for future generations. Not even the ones who voted for him in the hopes he might help bring back jobs to a neglected party of the country, deserve this.", "author": "", "sentence": 3121}}, {"model": "api.Comment", "fields": {"content": "Maureen, this is devastating and right on. I'm just aghast that this incompetent, ignorant con man is presiding in the Oval Office. Getting his info from Fox News, and nut job advisors, since he doesn't know a darned thing about the policy issues. And, as you say, doesn't have the wherewithal and curiosity to find out.Trump sold his supporters down the river with his desperate ACHA bartering faster than a slick grope under the skirt. His brand of negotiating,  which ended up being a nonsensical, brutish compromise, that had nothing to do with the people whose lives would be affected, failed miserably. He totally botched it. Here's the thing: maybe threats, bullying, hammering through deals, work in real estate, but it sure didn't work with health care. We're talking about real live human beings here, humans who get sick and need care. So Trump has his little tantrum, vindictively guarantees Obamacare will explode and then the Dems will be blamed, and smiles smugly, caring not a whit about millions of lives caught in the middle. Let them suffer! is his essential message. Then we can blame the Dems! Wahoo! What a win!Trump's staggering lack of policy substance has and will continue to have dangerous consequences for our country. He can't govern, because he doesn't have the knowledge base and isn't interested in getting it. Every decision he will make will be shoddy and botched. His obvious distractions look more pathetic by the day. This fake president needs to go.", "author": "", "sentence": 3121}}, {"model": "api.Comment", "fields": {"content": "let's face it, Trump was a disaster as a businessman and has already demonstrated that he'll be a disaster as president.  Why, because he values loyalty over competence.  Rather than surrounding himself with experts, regardless of their political party he has chosen wealthy businessmen like himself and as a result gets burned.He was too arrogant to read the Republican version of the healthcare law and ask himself if it was worth the political cost and he got burned.  Rather than admitting his error and moving forward he publicly played the blame game.  Well guess what, you're no longer campaigning, your president now and you own whatever happens good or bad.  So far your first 100 days have been the biggest spectacle of incompetence yet seen in politics.", "author": "", "sentence": 3121}}, {"model": "api.Comment", "fields": {"content": "The big problem with this takedown, no matter how on target it is, is that it means nothing because Donald isn't listening. Like so much writing about him since he started his run for the presidency, it falls on deaf ears. The only way out -- and it probably isn't going to happen -- is impeachment. Impeach him for what, though -- being the personification of crony capitalism come home to roost? Or being the empty shell that certain nefarious billionaires \"turned\" under the direction of Steve Bannon? That's not enough. And Russian influence on the election is like Polanski's movie Chinatown. No one will figure it out. Long ago any smoking gun was tossed into the void. So unless Trump makes some mistake that really could not be called anything but borderline insanity, we're stuck with him for four more years, no matter what Maureen or anyone else has to say. ", "author": "", "sentence": 3120}}, {"model": "api.Comment", "fields": {"content": "It's somewhat disturbing to read Ms. Dowd writing \"to\" Donald Trump, and even more disturbing to realize that she and many more still believe that this man is anything other than a vengeful arsonist, bent on destroying everything his enemies ever built.  To think that he needed to be \"hooked into\" an agenda meant to transfer wealth from the working class to the already fabulously wealthy, is simply poppycock.  He was presented with a bill that would take health insurance away from 24 million Americans (meaning the early demise of heaven only knows how many); that would increase premiums for older Americans but which would cut taxes for the rich.  It was a plan that nobody could support (other than perhaps al Qaeda, simply because of the number of Americans it would kill).  But, Trump glommed onto that stinker quicker than then a dealer at one of his casinos can take away grandma's social security check.  I wonder what it will take for people to eventually realize just how malevolent and spiteful this man truly is.  ", "author": "", "sentence": 3120}}, {"model": "api.Comment", "fields": {"content": "Nice criticism, but still relies on the fallacy that Trump really wanted to help the little guy. Given his constant stream of big lies, don't you realize that his campaign was a big lie from the start?", "author": "", "sentence": 3123}}, {"model": "api.Comment", "fields": {"content": "Maybe I missed something - what was/is Trump's 'own' agenda?He never had a defined policy agenda other than 'I am the greatest (business) man on earth'.After you have insulted absolutely everybody including you own supporters - 'I love the poorly educated' - it is hard to get people to work with you.It is also hard to get people to work with you when you are selfish, greedy and mean.So his ego is bruised for the moment. Don't worry Ivanka has come back to comfort him. President Bannon will whisper false nothings into his ear, give him a new script and they will ready for the next episode come Monday morning.The GOP just caught a ray of sunshine. They may not need Trump as much as they thought, they can do bad all by themselves. And Trump is getting messier by the day.", "author": "", "sentence": 3128}}, {"model": "api.Comment", "fields": {"content": "Such a clear and incisive portrayal of what Trump is and is not. Thank you. Another difference from Reagan: RR had also spent 8 years as governor of a divided California, too; he had learned a few things about political diplomacy...and much as many on the left disliked him, I don't think he took himself nearly as seriously as the current POTUS.The White House will deny responsibility and blame others in the days ahead, of course - Presidential infallibility seems to be the working premise of the moment. But it's hard to see how tax reform moves forward, now that the 'savings' from the AHCA will not be forthcoming and the tax fix is promised to be 'deficit neutral.' (How does tax reform work when 24 million people go off health insurance? There's a question for another day, I guess).Yes, Donald \"got played.\" The 'deal process' in DC seems to work a little differently, doesn't it? How long before the GOP starts pointing fingers at DJT? ", "author": "", "sentence": 3121}}, {"model": "api.Comment", "fields": {"content": "No, Trump doesn't \"own it now.\"Trump Care didn't have the votes, so, for the forseeable future, we will continue with Obama Care. It was named for Obama, who passed it without any Republican votes. It is unsustainable. Most exchanges have only one or two insurers still providing coverage. Insurers are losing their shirts and abandoning the program. Premiums have skyrocketed, and will continue to rise.No, Trump does not own it, nor does Ryan. Its title is registered to Obama, but the Freedom Caucus just aquired a lien interest in it.  ", "author": "", "sentence": 3120}}, {"model": "api.Comment", "fields": {"content": "Donald Trump doesn't realize that he is /was nothing more than a manipulated,  solipsistic, bloated host, for a parasitic Republican Party. In 2016 the Republicans had nothing more than a bunch of ennui inducing  retreads, and zero charisma candidates, who would have been nothing more than sacrificial fodder, against Hillary's seeming demographic inevitability. The Trump phenomenon altered that reality. The Republican  \"establishment duopoly\" was an intellectually vapid invertebrate, Paul Ryan, who passed for a wonk in the parched intellectual desert that is the Republican Party, and Mitch McConnell a cynical,  pinched hollow man, whose partisanship bordered on criminality,and whose lack of integrity is mirrored in his chinless, weak jowled visage. Combine them with Trump's lack of cerebral substance, self awareness, and political acumen, and you have the egregious failed attempt to repeal Obama care.", "author": "", "sentence": 3101}}, {"model": "api.Comment", "fields": {"content": "The columnist here makes a few incorect assumptions, namely:1) That Trump knew the Republicans couldn't govern.2) That Trump knew Ryan was a fake.3) That Trump has \"forgotten\" the common man he once said he would champion.All of those are false. First, Trump doesn't anything about the Republicans in Congress or Ryan, because he never bothered to learn -- much the same way he never bothered to learn about the ACA, or immigration, or environmental issues, or anything else. He's incurious, so no, he doesn't know anything at all.Second, to assume Trump \"forgot\" the common man would require a base assumption that he cared about them in the first place. I've seen no evidence of that. Trump's only goal seems to be to make himself look important and to make the Trump brand more profitable. A person who cared about the Average Joe would've bothered to read the bullet points on the AHCA, which would have been enough to tell him the bill was going to hurt a ton of people.Please, let's not give Trump credit for knowledge, and humanity, he is obviously sorely lacking.", "author": "", "sentence": 3102}}, {"model": "api.Comment", "fields": {"content": "Folks like Sting, Mayer, Norah Jones, Elvis Costello and Diana Krall are fascinating to me, because they have enough real musical training and knowledge to know the difference between the star-making machine and music for music's sake, and they constantly wrestle with it, surrounding themselves with great musicians, but also so hungry for the perks and adoration the pop world provides.  Ultimately, it seems they rarely find a satisfactory resolution between those two mainly inimical worlds of art and commerce.", "author": "", "sentence": 5312}}, {"model": "api.Comment", "fields": {"content": "I was one of John's die-hard African-American female fans. There were a ton of us who bought his music, enjoyed his concerts and yes, lusted after him. And then the infamous interviews where he essentially castigated all of us. I'm a fairly grounded person but man, that stung. In the \"reformed John\" interviews and subsequent apologies, I still see a man far too focused on navel-gazing than looking outward. I still think he's an amazing guitarist and songwriter. My hope for him now is that the Universe brings him that wife and baby ... and that the child is a girl.", "author": "", "sentence": 5318}}, {"model": "api.Comment", "fields": {"content": "If he were a woman, someone would have told him already if he wants to stay popular, just shut up, sing and look pretty.  That interviewers keep going to John Mayer for deep thoughts is perfect example of white male privilege. We don't expect deep thoughts from Britney Spears, Katy Perry, Usher, Selena Gomez.  We expect to entertained. Interviewers need to stop trying to make John Mayer seem like a philosopher. Describe what he's wearing, what he ate for dinner, how he gets his hair to look so great. Would make for a better read.", "author": "", "sentence": 5320}}, {"model": "api.Comment", "fields": {"content": "John Mayer is an unbelievably great guitarist. I've admired his talent for years. He's a musician, not a pop star... I'm looking forward to this album. Perhaps honesty and humility that comes with age will lend itself to some truly meaningful lyric. I try judge an artist by how they are portrayed in media.", "author": "", "sentence": 5333}}, {"model": "api.Comment", "fields": {"content": "Why is there only a passing mention of Mr. Mayer's participation in the latest iteration of one of modern music's most enduring musical phenomena, The Grateful Dead (as The Dead & Company)? Those of us who have been on-board the \"bus\" for decades are in awe of the life and excitement John Mayer, as well as Bassist, Oteil Brubridge and Keyboardist, Jeff Chemnti, have brought to the band. John Mayer had the unenviable task of stepping in for Jerry Garcia, one of the most loved band leaders ever. The fans of the Dead embraced him with zeal. I personally went to my first Dead & Company show(s) on New Year's 2015-16 and then to Boulder for two nights in July. They were amazing and Dead Heads absolutely blown away.I don't see how such a significant move in Mr. Mayer's life can be glossed over as a passing comment about a side project…He is now, most definitely, a member of the Grateful Dead Family. I can't wait to see Dead & Company in Las Vegas and Phoenix on the upcoming tour. We welcome John and his guitar genius. ", "author": "", "sentence": 5325}}, {"model": "api.Comment", "fields": {"content": "If I could say this to his face, I'd say \"Stop apologizing. Stop caring what others think. Nobody can criticize or analyze you.\"  He's the one and only him. I personally think his past comments are funny and purely honest. The pretty faces he's dated in Hollywood are empty shells and bad decisions on the part of someone with his depth of talent. The envious men and easily offended women who continue to bash him are... who? He owes no one anything. Are we all not imperfect? Why is he expected to be otherwise?  With that being said, in my opinion, his talent surpasses anyone out there. I'm from a family of many artists, and artists are just different. We don't see things the way others do. Not that we're better, just different. An artist can't do what other \"talents\" can do; everyone has their own calling. But JM is genius in his own rite, and I'd love to sit down and chat with him more than any other person.  Not to pick him apart, but to soak him in. Please don't put me in the category of the idolistic women either. I'm old enough to be his \"aunt,\" 13 years his senior. Not that I wouldn't marry him and have his babies if I was younger! (jk).   At any rate, I find him fascinating and I completely love every facet of his career so far. Aunt Shelley is anxiously looking forward to seeing him in Charlotte NC in August!", "author": "", "sentence": 5329}}, {"model": "api.Comment", "fields": {"content": "I have always been a fan of John Mayer's catalog from his earliest days including his pre-debut music from the 40 Watt and Eddie's attic. He is a gifted musician, performer and storyteller. In his earliest days he was shy on stage while his music spoke of the insecurities of growing up. As he became more popular and his musical talents shone even brighter, his tabloid antics coupled with his naval gazing (really- you're the top artist making millions and dating starlets and telling me about your pains and anxieties?) became annoying. But he'd find a way to return to his core every now and then and craft timeless messages that kept me listening. His masterful musicianship takes from pop to soul to blues to jazz to country, all without skipping a beat.And then he began playing with The Dead. As a Dead fan, I had great trepidations about the checkout aisle showman fitting it. I saw them at MSG and was blown away. John took a back seat and filled in beautifully without trying to steal the show. And when he did step out front, he did so with great respect to the late Jerry Garcia while still being true to himself. You could feel the love of the crowd wash over him as the second set began, and from that point forward there was no turning back. John, you were meant to play with The Dead - it's what everything else you have done has been for.His new music sounds fantastic. His arrangements and production are better than ever. Like an old sweater that fits perfectly.", "author": "", "sentence": 5305}}, {"model": "api.Comment", "fields": {"content": "My venue, The Handlebar, in Greenville, S.C., took a risk to promote John Mayer in 2000-2001, when he was an unknown artist, though perhaps the first to understand the value of Napster in building a fanbase.At end of his first show, he sat on my stage for two hours talking to a line of kids who were among the 180 there that night.That was before his songs exploded into hits. At the time, I said, \"That kid has no idea what's about to hit him.\" Small wonder he self-incinerated in the white-hot lights of too-young, too-fast fame.This is a redemption story. And it's not just well-told, it's deserved.", "author": "", "sentence": 5317}}, {"model": "api.Comment", "fields": {"content": "Boo-hoo. During the Obama years, the Republicans held 60 cheap votes to repeal the ACA, knowing they would not become law. They found expression for an ideology totally divorced from the public good as a scorched-earth opposition party free of all responsibility.Now that it comes to heavy lifting, they are completely unprepared and unfit to govern. Their good-for-nothing ideology won't buy you a coffee at McDonald's unless you pitch in an extra dollar.", "author": "", "sentence": 2931}}, {"model": "api.Comment", "fields": {"content": "There is nothing more dangerous than a narcissistic bully scorned.  The legitimate media is going to have to hound his every move, and that of Ryan, to protect the implosion of the Affordable Care Act.  Trump has proven that winning isn't everything, it is his only barometer for success.  He'll use have evil device in his toolbox to harm the ACA, without one thought to the millions of people who will suffer and those who will die because of his arrogance.As for Ryan? Don't think for a second he's not mixing up his next Medicaid serpent to slither through the House.Just because they were embarrassed by their own party doesn't mean they won't find other ways to harm innocent Americans.", "author": "", "sentence": 2927}}, {"model": "api.Comment", "fields": {"content": "I think the biggest problem is, at their core, the Republicans do not believe that healthcare is a basic right of Americans.  ", "author": "", "sentence": 2908}}, {"model": "api.Comment", "fields": {"content": "\"I'm President. You're not.\"I won. She lost. I'm big. You're small. My children are beautiful. I'm not concerned about your children. I'm rich. You're poor.On a government application last week one of the first questions was:\"Do you have a condition that will end in death?\" Yes or No.I answered no. I lied.We all have a condition that will end in death. Human frailty.", "author": "", "sentence": 2929}}, {"model": "api.Comment", "fields": {"content": "Trump talked about health care like he was a mediocre waiter at a restaurant. With no curiosity, let alone understanding, of the preparations involved or knowledge of the ingredients, he was content to say, \" \"You're gonna love our special tonight. Trust me, it's gonna be great.\" The good news is nobody's buying, nobody's taking Trump's word for it anymore, nobody thinks he has anything of value to add because for him it's just words. As some journalist on MSNBC asked recently, \"what does he mean when he says words?\".", "author": "", "sentence": 2931}}, {"model": "api.Comment", "fields": {"content": "This is sad, very sad.  The lies, ineffective signing of a Muslim ban, the oligarchs in the administration, the Russian cloud hanging over our heads and finally, the total disaster of healthcare reform by the Republicans leaves me little hope that our country is almost leaderless.  This is not something to celebrate.  It is something to mourn.", "author": "", "sentence": 2905}}, {"model": "api.Comment", "fields": {"content": "Why is there so little discussion of actual costs of our crazy health care system? The total spending of government (U.S., state and local) and individual  amounts to 13.4 trillion dollars (2015). The increase each year far exceeds the inflation rate (although the ACA had helped some). The average cost of other developed countries for health care is roughly half of what the U.S. spends. Think what could be done with the YEARLY savings of over a  trillion dollars if we had a similar system. Contrast this also with the few hundred billion saved by the Federal Government over a TEN year period by destruction of coverage with TrumpRyan care.", "author": "", "sentence": 2929}}, {"model": "api.Comment", "fields": {"content": "1968: The whole world's watching.2017: The whole world's laughing. ", "author": "", "sentence": 2908}}, {"model": "api.Comment", "fields": {"content": "So, now Trump says that when Obamacare \"collapses\" he will work with Democrats -- who will come crawling to him -- to come up with a \"great\" health care plan.  If Democratic input will create a better plan, then why didn't he and Ryan seek it out in the first place?Now, Lindsey Graham agrees that Congressional bipartisanship will be the best for the American people.  Amen to that (and by the way, where was that spirit when the Republicans refused to work with Obama in an effort to scuttle his presidency at the expense of the American people?).Omigod, I just realized that Trump has driven me into the arms of Lindsey Graham!  The man CAN do miracles!", "author": "", "sentence": 2931}}, {"model": "api.Comment", "fields": {"content": "There is another America out there today, where half the voters believe that the Republicans failed to pass this wonderful improvement to Obamacare, because of the intransigence of Democrats. I don't know the percentage of New York Times commenters who live in Red States (as I did for over forty years, until last fall), but those of you who do know exactly what I'm talking about. This Republican created health care bill, according to Trump supporters, is sure to provide them more insurance coverage at much lower premiums, but because of the evil Democrats in Congress, they will now all be facing death panels. Understand that there are no number of facts that will convince these voters that they're wrong. Sadly, Democrats do continue to \"own\" this issue because Trump and this Republican Congress have honed lying to the public to a fine art, and continue to blame Democrats for their own failures. The notion that these Red State voters will, at some point, come to their senses is laughable. Unless one has lived in any of these areas, one has no idea of the extent of hatred and delusion of these people. As long as this Administration continues to signal that it's just fine to commit hate crimes against ethnic and religious minorities and the LGBTQ community, Red State voters' prayers are answered.  They want nothing more.", "author": "", "sentence": 2929}}, {"model": "api.Comment", "fields": {"content": "Now Trump and the rest of the Republican miscreants will sabotage and/or mismanage Obamacare, imagining they can claim it was a failure all along and blame the Democrats.  Their cynicism knows no bounds.Nothing like a party that wants to prove government doesn't work by making it not work.", "author": "", "sentence": 2917}}, {"model": "api.Comment", "fields": {"content": "A small victory for Americans. The war is won when we 1) have his tax returns, 2) name an independent prosecutor to investigate his sordid relationship w/ Russia.", "author": "", "sentence": 2926}}, {"model": "api.Comment", "fields": {"content": "Trump's reaction to his healthcare debacle was typical: he will get revenge by watching how millions will pay higher premiums or lose their health insurance, which is what he predicts will happen with Obamacare.This kind of behavior is not acceptable from a temperamental child  but here we are , watching our president responding to a defeat with a temper tantrum.One shudders at the thought of how will react to other potential losses.", "author": "", "sentence": 2929}}, {"model": "api.Comment", "fields": {"content": "He always turns tail and runs when he loses. Declares bankruptcy and pulls up stakes, leaving others holding the bag. Well, he's holding this one.", "author": "", "sentence": 2929}}, {"model": "api.Comment", "fields": {"content": "Insanity is doing the same thing over and over and expecting a different result.  Regulate healthcare suppliers and providers to control cost inputs rather than the consumers to ration their access.  The fundamental flaw in Obamacare does not lie in Obamacare itself.  Instead, it lies in the outrageous fees and prices charged by the providers, device manufacturers, pharmaceutical companies and large healthcare corporations that bolster their bottom line by overcharging American users of their products and services.  This is not an accident.  Congress has enacted legislation that gives these companies a monopoly position in their so called marketplaces and implicit freedom from competition in setting their prices.  Thus Biogen can simply choose to raise the price on its 15 year old Avonex drug any time it needs to improve its PE ratio for Wall Street investors.  The same is true for knee replacement implants and virtually for every other product and service provided to the American healthcare system.  Congress has even written a law preventing Medicare and Medicaid from negotiating to get the best price for these goods and services.  Don't fix Obamacare.  Instead regulate the profit taking allowed to the healthcare industry.  Market forces won't accomplish this end, because of the inherent power and information advantage of the providers over the consumers.  Only regulation can fix what's wrong with American Healthcare.", "author": "", "sentence": 2931}}, {"model": "api.Comment", "fields": {"content": "And not for one second did Trump reflect on exactly why Nixon was on so many Time magazine covers.", "author": "", "sentence": 2930}}, {"model": "api.Comment", "fields": {"content": "Trump was not speaking as a President today following the collapse of his health care bill, he was speaking as a real estate developer, deal maker.  If the deal goes bust, just walk away from it, on to the next deal, no biggie, life is full of deals.  Let everyone else clean it up, let everyone else pay for the fiasco, move on to the next item (tax reform)  and next bunch of suckers (non rich Americans).  A real President would be concerned about health coverage for the American people going forward given that he and his party are in charge of governing and they basically blew it this week. Not Trump who, having had enough, seemed to revel in the idea of an implosion followed by an explosion resulting in a complete collapse of the ACA at which time Democrats, the real villains here, would come begging for a deal. And the cow jumped over the moon. ", "author": "", "sentence": 2925}}, {"model": "api.Comment", "fields": {"content": "As mentioned in the article, I was awake for part of my deep brain stimulation surgery. I found it to be more noisy in the operating room than I would have expected. In this case I wasn't able to see much since my head was fixed to the table with a metal frame. The consent to be awake is a necessity for this surgery so there is no choice involved.In the future I might might make the choice to be awake.", "author": "", "sentence": 1225}}, {"model": "api.Comment", "fields": {"content": "Just what the surgeon needs, to be distracted by questions in the middle of your operation.", "author": "", "sentence": 1225}}, {"model": "api.Comment", "fields": {"content": "My grandfather, who died decades ago, had a large hernia repaired with local anesthesia.  He was in his eighties, frail, and a poor candidate for general anesthesia.  The result was excellent and he recovered quickly, which left us all wondering why simple surgeries weren't done this way more often.As an aside, there was never any danger of Grandad seeing anything disturbing or trying to chat up the surgeon.  His hearing aid and glasses were in my mother's purse. ", "author": "", "sentence": 1225}}, {"model": "api.Comment", "fields": {"content": "I recently had what a surgeon described as \"significant surgery in a small place.\"  The surgery involved removing a bone that was located between my thumb and my wrist and packing the space with living tendon.  Surgeons opted for \"regional\" anesthesia which was a nerve block painlessly administered immediately prior to being taken into the OR.  Surgery lasted for approximately 90 minutes and was completely painless.  During surgery I was administered a sedative to help me relax but I was wide awake during the entire procedure and spent the time chatting with the anesthesiologist. No conversation with the surgeons but I did manage to eavesdrop on their chat during surgery as they discussed malpractice insurance! ", "author": "", "sentence": 1225}}, {"model": "api.Comment", "fields": {"content": "Interesting but dangerous article. We never want to discourage anesthesia (your a baby!) or the expertise that comes along with having an anesthesiologist present. While the advantage of no anesthesia is supposedly for medical reasons, in reality those of us working in the field know it is for financial reasons. Its quicker with no anesthesia which means more cases and more revenue. With the awake method, now you have patients who have not fasted, have not had medical clearance (due to no anesthesia involvement), often with no IV access, where someone inevitably is bound to move, vomit, have a reaction to the local anesthetic, become agitated, and/or need sudden intervention during the surgery. Who do you think is the one that intervenes?  The anesthesiologist who has been removed from the equation only to be relied on to put out the fires that come along with this awake method. Some surgeries, like eyes, and some simple finger and hand surgeries genuinely do not require anesthesia. But leaving this decision up tot he surgeon and book-keepers at surgical facilities will always end up in financial advantage and patient disadvantage/danger. Don't let them sell you on being awake, go to sleep, get the expert anesthesiologist for your care and don't risk something scary happening. ", "author": "", "sentence": 1225}}, {"model": "api.Comment", "fields": {"content": "I'm glad you all are catching up. I had four eye surgeries in the nineteen eighties and elected -- insisted on -- local anesthesia for each.Why?Why sleep through an interesting experience?", "author": "", "sentence": 1225}}, {"model": "api.Comment", "fields": {"content": "People need to learn to just give up control.If the surgeon wants you awake, great. Otherwise, use GA or stay quiet.Why inject yourself into the procedure?I assure people having been in the OR many times that it doesn't help to have the surgical team worrying about other stuff than the surgery itself.You're not helping your own care by doing this.", "author": "", "sentence": 1240}}, {"model": "api.Comment", "fields": {"content": "When I was 8.9999 months pregnant, I had a suspicious lump growing larger and larger in my armpit. Long story short, it was best to get it dealt with and examined by pathology before I gave birth. I was leery of the sedation that the surgeon wanted to do, and he agreed to forgo the sedation in this case. I told him he didn't have to try to talk with me and he cracked up (in relief, I think, since verbal interactions were not his strong suit). The only part I wasn't prepared for was the smell of laser cautery (especially since the smell of cooking meat was a huge nausea trigger in my entire pregnancy). I plan to have any other appropriate procedures awake as well.", "author": "", "sentence": 1201}}, {"model": "api.Comment", "fields": {"content": "i once watched as two surgeons operated on a young woman for appendicitis. she was under general anesthesia. her appendix was normal, so they had the anesthetist give her some succinylcholine, inserted a retractor into the incision and literally pulled the hole to the left side of her body, where they found a problem with her left ovary. i don't think that would be possible with local anesthesia, mostly due to the patient's breathing stopping. makes me wonder if there are contraindications for some operations for the use of awake anesthesia. ", "author": "", "sentence": 1225}}, {"model": "api.Comment", "fields": {"content": "If I require surgery again, I will inquire about the possibility of being awake throughout. I am a nurse, and also intensely curious...the opportunity to learn something with a couple of questions would be hard to turn down. I have observed surgeries before (the OR was one of my clinical rounds) and did just fine, though I would request an IV be placed so that I could be given medication for nausea or anxiety if required...I don't know if I'd react the same way if it was my own body being operated on.", "author": "", "sentence": 1240}}, {"model": "api.Comment", "fields": {"content": "As someone who has had 7 surgeries in as many years, I'd rather not be an active participant in my surgical procedures.  My involvement takes place prior to surgery, asking the doctor relevant questions, and seeking a second opinion if needed.  At the point of surgery, I turn over control to the doctor.  If I am unwilling to do that, than perhaps I have selected the wrong doctor.", "author": "", "sentence": 1225}}, {"model": "api.Comment", "fields": {"content": "I had a minor procedure a few years ago (at HSS) and they tried to sell me on staying awake. The anesthesiologist described 'regular' anesthesia as 'being on the bottom of the ocean' but he was just going to keep me 'just under the surface'. I told him that if I wake up, it won't be pretty.I didn't wake up until well after it was over and I was comfortably resting in the recovery room. There is not enough Xanax, Valium, Klonopin, or Ativan on this earth to keep me calm enough to stay awake whilst being sliced open. No way, no how, uh-uh, never. Knock me out and tell me when it's over. Besides, who couldn't use a really nice nap?", "author": "", "sentence": 1205}}, {"model": "api.Comment", "fields": {"content": "I recently opted for a spinal-- i.e., regional anesthesia-- during surgery. My surgeon mentioned it as a possible but unpopular option and was surprised by my choice. But I was so afraid of general anesthesia after two \"near death experiences\" with inhalants that I probably wouldn't have had the (necessary) procedure at all if there weren't another choice. It went extremely well, partly because I was well prepared for exactly what would happen. I didn't watch, I listened to music. I would definitely recommend it. You can ask for a tranquilizer or some level of conscious sedation if it seems too stressful.", "author": "", "sentence": 1206}}, {"model": "api.Comment", "fields": {"content": "Podiatrists have been doing foot and ankle surgery for over 40 years under monitored anesthesia care or local anesthesia.  In the early days, some of our Orthopedic colleagues thought we were crazy!  There is evidence that a local nerve block, will block the afferent pain signal to the brain, as the surgery begins.  This does not happen if a patient has general anesthesia. We believe this helps control, the post operative pain problems, literally before it starts.  It is also much safer for the liver to have local anesthesia then general anesthesia, particularly in older patients. Once a surgeon gets used to operating in a field that is a little more 'bloated' than it would be without the local, it's a great alternative for surgery.", "author": "", "sentence": 1225}}, {"model": "api.Comment", "fields": {"content": "Once a year or every two years, I fly to Lima, Peru, to see my Peruvian dentist. Yes, my flight ticket from Houston sets me back U$S 1,000, but at U$S 140 a crown and U$S 36 each endodontics, I recuperate my expenses very fast. Besides, my experience with American dentists is pretty bad. My ex-wife had a woman dentist that every time she would see her, found something very wrong and charge her a small fortune to fix it. I went to see her for the sake of it, and in few minutes found U$S 5,000 worth of work, that, twenty years ago. In 2013 one old bridge broke off in my mouth. I went to see a dentist in Houston and he told me that I had to have two roots extracted and since it would give me a gap too big for a bridge, I would have to have a movable prosthesis or an implant. I went to Argentina and to Peru and both dentist told me the same, one root was cracked, but the other one could be saved and a bridge installed. I had a first class job done in Peru for almost peanuts in comparison with Houston. I had similar experiences with medical doctors. It's really bad when we cannot trust the ones supposed to take care of our ailments. The worst part: Nobody talks about it...", "author": "", "sentence": 7513}}, {"model": "api.Comment", "fields": {"content": "The lack of, or insufficient, dental care coverage by Medicaid and the overall private health insurance industry (noted by poster Marina) makes clear that our institutions are just about as keenly focused on teeth as the private citizen is.  In other words...hardly at all.  By their actions it seems more a nuisance issue.  So it should not surprise that if you live long enough you're going to run....mouth first...into this problem....especially if you do not focus, as you should, on proper hygiene and such.. But disclosure...I'm well along in age and learned proper dental maintenance from a teenaged encounter with braces.  (Heh)  However, even so aware this did not stop certain rear molars from crumbling from wear and tear.  This forced some individual implants (a shout out to Columbia Dental College in NYC for their excellent work)....which I fortunately could afford.  Even so the old adage works for me.  If you do not take care of your teeth not to worry, they will leave you.John~American Net'Zen", "author": "", "sentence": 7530}}, {"model": "api.Comment", "fields": {"content": "Dentistry has made remarkable  progress in the past 60 years.  Advances in oral surgery, implant materials and techniques, prosthodontics,  and x-ray technology have enabled dentists to repair and restore the teeth of patients like Mr. Maddalena.Yet the unwillingness of health insurers to provide affordable dental insurance shows that as a society, we don't value dental public health very much.  Compounding this is our willingness to allow the soft drink industry to sell their products without labeling them as hazardous to dental health and  heart health.Capitalism has virtues but it also exacerbates inequality.", "author": "", "sentence": 7515}}, {"model": "api.Comment", "fields": {"content": "I know that this article is about older people, but the issue extends much farther. Come to a rural area where kids, living in poverty, drinking well water without fluoride, have never been to a dentist because the nearest one who accepts Medicaid is a two-hour drive. Look in these tiny people's mouths, and see the rot. It's incredibly sad to see preschoolers in constant pain, unable to eat properly, because their rotten teeth hurt all the time. Perhaps their families have not established good brushing habits, or perhaps toothpaste and toothbrushes are outside the budget. It doesn't matter--it's not the kids' fault. We wouldn't let a child (or an older person) walk around with a broken arm, so why is this allowed by society?", "author": "", "sentence": 7530}}, {"model": "api.Comment", "fields": {"content": "If anything, Ms Span understates the problem. Dental problems and the attendant inflammation are linked to numerous sorts of systemic diseases: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC88948/ . This has been recognized for close to two decades, and as a reciprocal issue dentists also have had to increase their knowledge of oral manifestations of systemic disease. Associations are diverse and include cardiovascular disease, bacterial pneumonia, diabetes mellitus, and low birth weight.Dental insurance plans are not as robust as general medical plans (which may get better since congress can now work on repairing ACA defects). This has all sorts of societal implications: http://www.usatoday.com/story/news/2016/07/16/kaiser-addressing-overwhel... . ", "author": "", "sentence": 7525}}, {"model": "api.Comment", "fields": {"content": "As a caregiver for a person with dementia and behavioral problems, it impossible to take this person to a dentist. The person would have to be sedated for an exam and treatment. I pray everyday that nothig serious develops. It is a struggle everyday just to brush the teeth. The few times the person was in the hospital I asked the doctors if a inhospital dentist could exam the teeth, they were dumbfounded.", "author": "", "sentence": 7504}}, {"model": "api.Comment", "fields": {"content": "As the article suggests, \"Para\" dentists like hygienists and therapists need to be allowed to fill cavities and do other simpler procedures that will help prevent problems later on. This would provide more non-robotic hands-on jobs in the health professions and at the same time make basic dentistry more affordable. In spite of what some commenters say here about \"you can find dental care if you look\" or \"all you need to do is floss\" that's simply not true for many, including children, due to all the unknowable, unpredictable details and specifics involved in 1) being poor and 2) the personal characteristics and case history of Someone Else's (not your) dentition (!)", "author": "", "sentence": 7517}}, {"model": "api.Comment", "fields": {"content": "My mother was always proud of her teeth and took great care of them, but her dementia is ruining them. Finances are not the issue. She refuses to let the dentist or anyone touch them. I have tried everything, but dental care requires some degree of compliance on the part of the patient. I'm glad the University of Minnesota study says otherwise, but it's not true with all. If dementia manifests itself in the form of \"no\" toward anyone seeking to assist them (dentist, hairdresser, etc.), the service is unavailable, even though it is affordable. Dementia robs the elderly of so much more than their memories. ", "author": "", "sentence": 7517}}, {"model": "api.Comment", "fields": {"content": "One of my most memorable vacations was South Dakota-the Badlands and the Black Hills - and then the stunning drive to Yellowstone and the magnificence of that landscape. If the beauty of places like the Black Hills doesn't make you love the US, nothing will but that beauty is not Mount Rushmore, which to me is a defacement of the hills.  I think I understand the writer's reaction and I don't see it as coming from a sense of superiority. I found the need to carve up the landscape alienating.", "author": "", "sentence": 9018}}, {"model": "api.Comment", "fields": {"content": "Mt Rushmore is another man-made sky scraper, like NYC's skyscrapers, every bit a monument to American enterprise. Sadly, it is native Lakota Sioux sacred land snatched by the feds. The sculptures are bizarre, unnatural, a \"SuperSized order\" of anglo culture dropkicked on Native land. For me, the true beauty of the Black Hills is in its wildness.How fitting that Mt Rushmore was creatively applied in North By Northwest and Mars Attacks. It is, after all is said and done, an American icon.", "author": "", "sentence": 9018}}, {"model": "api.Comment", "fields": {"content": "Mount Rushmore was chosen for this sculpture because the quality of the granite, height of the mountain and because Borglum wanted a location that would be illuminated with morning light which he explained would thrill the tourists.  Making Mount Rushmore into this Mount Rushmore,  was absolutely conceived to inspire tourists to come to South Dakota. This state in the 1920s was an even more sparsely populated, mostly wide-open prairie state with mountains where roads were few and rough. People who have worked there have regaled friends with questions asked by tourists from \"How did they know it was down there when they started digging?\" to \"Did they have trouble fitting this monument through the tunnel?\" . Most native South Dakotans hope those are facetious comments.  Notably according to most natives it wasn't intended to be interpreted as a complex statement on the ego or bigness of the USA.It was a tourist draw,  built during the Depression, WWI and completed about one month prior to Pearl Harbor.  Seeing it is powerful. Learning about all the people, all those immigrants who labored 14 years, under harsh weather conditions, in jobs this project created for 400 plus workmen during the depression makes many proud. Beautifully cared for this National Park, framed by the Midwest's big sky has flags flying and is dramatically lit in evening showings. A spectacular state, rich in environmental treasures: land, clean air, clean water, so far.    ", "author": "", "sentence": 9018}}, {"model": "api.Comment", "fields": {"content": "I'm a New Zealander, I visited Mt Rushmore in 2011, and loved it.  The USA builds  wonderful celebratory memorials to itself, more than any other country most of them huge - it's   a part of your charm/self-confidence. My visit inspired an obsession with US Presidents and I'm reading my way through  as many Presidential biographies as I can find. In  2015  I was lucky enough to tour the White House. I love DC, the Presidential Memorials, Arlington and the War memorials, It's great to look backwards,  to revere and celebrate your past, and you do it so well,  but looking forward can be useful too and I wish you'd do it more. The Mt Rushmore Presidents looked forward, their lives were dedicated to building a better country for the people who followed them. ", "author": "", "sentence": 9018}}, {"model": "api.Comment", "fields": {"content": "Family goes to iconic American monument. A writer among them writes a beautiful piece about the experience--never pretending to give the local perspective, but only his own as a tourist--a piece which turns into a marvelous essay about scale and the writer's troubled and troubling but deep love of his country. Piece is published in NYT. Comments get nasty, wedges are inserted, people are divided.\tForeign reader appreciates locals must get annoyed by tourists writing about them. And sees the point about big cities etc etc. But has learned a lot about scale. And deep, troubled and troubling love of country (his own is Australia). Thinks, what an extraordinary thing America is, even in its time of trial. What a monument to trying to do good in the world. Reader sighs. (Thanks NYT under his breath.)", "author": "", "sentence": 9018}}, {"model": "api.Comment", "fields": {"content": "What a disgustingly insulting column. Mr. Douthat seems to think that the non-coastal United States needs some kind of boost by relocating Washington to Nebraska. And the largest commercial operations in the country are ignored. To achieve his democratization plan, it is going to be the non-profits, educational institutions and government offices that would have to move from the Acela corridor to Arkansas. This seems to be Mr. Douthat's idea of a domestic \"peace corps\" where the enlightened of the East and West pour their sophisticated wisdom on the unwashed of the Midwest. Has Douthat ever visited the urban areas of the Midwest, West or South? He might be surprised that life outside of the clogged Bos-Wash, Bay area and SoCal corridors is diverse, culturally rich and sophisticated with excellent health and an enviable quality of life. Some of the finest universities in the nation are also there. The idea that the world can only be improved if we have satellites of MIT in Flint is utterly absurd with the University of Michigan and Michigan State just down the road. I live in Minneapolis. The Greater Twin Cities constitutes the second most diverse urban region in the United States outside of New York. Minority communities thrive here with active representation in civic government, business and the cultural community. Cultural life is extraordinary here, and the Twin Cities area is on every top-ten list. Come and see how little we need missionaries from the East. ", "author": "", "sentence": 3007}}, {"model": "api.Comment", "fields": {"content": "mr. douthat, i beg to differ.  i live in the heart of milwaukee near a catholic church and public park that has served as an anchor for the neighborhood.  the few blocks surrounding me are incredibly diverse.  the catholic church is conservative, so there are republicans in our neighborhood, whereas the professional employees are more liberal.  there is also economic diversity, as we have both homeowners and renters.  you are correct that the ultrarich have taken over NYC and SFO.  but there is still a lot of cultural, economic, social and political diversity in my very urban neighborhood. please don't paint all urban residents with the same brush.", "author": "", "sentence": 3007}}, {"model": "api.Comment", "fields": {"content": "Oh come on my fellow liberal commentators, give Ross a break.   Stop expecting him to become a liberal all of the sudden.   At least he is trying to think outside of the box and some of these ideas might work.  I agree with him that the quality of living that comes with elite education, skills training, culture and choice jobs are too concentrated in big cities.   Also, it's possible that some of these states could become more liberalized with some of his ideas.   And as long as we are stuck with the electoral college, that wouldn't be such a bad thing, now would it?  ", "author": "", "sentence": 3009}}, {"model": "api.Comment", "fields": {"content": "While I would take issue with some of this column's premises, there is food for thought in the idea of diffusing the concentrations of intellect, achievement, and compensation that we see today.  Although it's not mentioned here, such intense urban concentrations create all kinds of everyday problems that are inherent to crowding, from stratospheric housing costs to transportation nightmares.Given profound resistance on the right to serious investment in modern transportation infrastructure, including subsidies to encourage the use of alternatives to private vehicle, it is only in places like New York City, with its century of subway development, that one can essentially walk to any destination, by walking to the nearest transit node and walking from the nearest node to one's destination.  The virtues of this arrangement are many, from reduced greenhouse gases to less traffic congestion to healthier, slimmer people who might actually acknowledge each other's presence now and then.Where there is not so much concentration, public option become problematic.Housing costs are also skewed by concentration, as much from simple competition for space as anything else.  Yes, salaries are higher, often by a lot, but much of it goes right out the other side to the landlord or mortgage lender.  This naturally leads to sprawl and torturous commutes.So breaking up the big centers a bit, by relocating some corporate and governmental functions is an idea worth chewing on for a while.", "author": "", "sentence": 3001}}, {"model": "api.Comment", "fields": {"content": "I think this shows a misunderstand of why successful cities are successful. Taking a city like New York, Boston or Washington DC and smashing it to pieces won't cause GDP to rise where the pieces fall.  For all the technology that's out there we still need places where people can come together and share ideas.  It makes no sense to tax MIT because they don't have a Flint campus.  We (acting through the gov't) should be increasing the amount of money we spend on UM Flint so that community can attract more innovative people.  And at the same time, we (acting through the gov't) should be loosening restrictive zoning laws and increasing transportation opportunities so more people can afford to live in and near established successful cities.The Republican strategy, as espoused by Bannon, is \"break it all up.\"   If we wanted to, we could take what's already working in these successful cities, expand on it and spread it to other cities.   But that would cost money, require consensus, and provide opportunity to others.  So smashy smashy!", "author": "", "sentence": 3005}}, {"model": "api.Comment", "fields": {"content": "You could break up the big cities tomorrow and scatter the elite in Toledo, Yazoo City and Fort Smith, and within a year, the best and the brightest would be concentrated in the hubs of commerce and innovation all over again. And who would blame them? Have you ever been to Fort Smith?Why are elite universities clustered around thriving cities? It's cause and effect. Those universities are producing networks of supersmart, talented people who then go to work for or create businesses with other smart, talented people whom they made contact with during their university and B-school years. It's no fluke that Palo Alto is in the heart of Silicon Valley. GE just moved its headquarters to Boston. One, to escape Connecticut's taxes (I thought Mass was Taxachusetts) but also to be able to take advantage of the talent pool at MIT and Harvard (guess Yale didn't pan out for them). And \"heavily taxing\" the endowments of these schools is ridiculous. Better to tax the politicized and socially-regressive Catholic Church if we're looking to go after non-profits.  ", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "Look, we liberals claim we like to be challenged with ideas we may not agree with, because we all have open minds...don't we?  So, Ross has challenged us.  Having all government agencies headquartered in one city made sense until recently when the Internet and Skype, etc. made communication over long distances a snap.  But it still may be important, I don't know.However, I fled my hometown in Indiana because of the religious-encouraged ignorance and intolerance of too many of its residents.   I HAVE NO DESIRE TO EVER RETURN.Maybe distributing government agencies and satellite campuses to smaller cities would serve as local magnets for jobs and spur a thirst for knowledge.  The so-called flyover country needs both, and, really, I'm willing to keep an open mind about it because what I desire most is a country that works and makes intelligent choices.However, I also recall going to a state university in a small midwestern town and I recall the deep dislike and resentment the locals had for the students, which had been going on for decades or more.  It definitely wasn't mellowing over time - and that was before the rise of Fox News!I believe that before we break up the government and our cities (which are working just fine) we should just consider breaking up Fox News.  ", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "It's reassuring to see no NYT readers buying into these hokey theories.  Government has been spreading millions of jobs across the country for decades in the form of military bases, national laboratories, and NASA installations.  This has resulted in creation of pockets of culture and innovation in unlikely places such as Huntsville, Alabama, but it's hard to see how spreading another few hindred thousand government jobs across the country would change the overall urban-rural dynamic.  People flock to places like New York and San Francisco in search of stimulation and diversity that cannot be federally mandated or fostered by planting a few more bureaucratic jobs here and there.  Major universities depend on the in-person interaction of students and faculty and would be undermined by substituting nationwide telecommuting for the on-campus experience.  A much better solution is to invest in a national high-speed transportation infrastructure that allows people to work and play in dense cities while letting  them return to homes in quieter communities perhaps as far away as 300 miles from the cities to which they commute.", "author": "", "sentence": 3005}}, {"model": "api.Comment", "fields": {"content": "Wow.  Now that is some real Douthat frustration expressed in these pages.  His anger at liberals generating economic success is palpable and penetrating, and he now must take it out on, of all places .   .   . Portland.  How much time have you spent in Portland, or it suburbs which include places in Southwest Washington (very conservative politically, well Republican at least) and places like Troutdale and Gresham.I don't think you have a clue about life in these cities or their suburbs, or about how the policies a place like Portland promotes actually embraces a very forward thinking and inclusive society.  If you want to make comments about living in a place like Portland, Ross, you should try it for a year or 2. When I moved to the Portland area in 1984, I wasn't sure I'd stay for more than a year, but here it is 33 years later, I'm still here, making this the place I have lived in the longest.  I lived in Southern Indiana growing up, too, and I will tell you now without hesitation, there is nothing that Portland could do or could share that Southern Indiana would benefit from unless and until the populous there was willing to embrace it.  And that my friend is the problem. Those places are hidebound by narrow inward-looking policies and governments (good example Mike Pence of Indiana) and they are doomed because of it.", "author": "", "sentence": 3001}}, {"model": "api.Comment", "fields": {"content": "My first reaction was to insist that the city I love (and no longer live in), i.e., NYC, was not as described.  But, even during the many decades I lived there, I was well aware that it was a cocoon for my liberal views.  It was also clearly segregated and housing was very expensive.  Still I found much that was modestly priced, and unparalleled opportunities for culture, diversity of thought, race, religion, ethnicity, and simple day to day existence.  It is the latter half of that sentence that I think is too often missing in many other cities; not all by any means.  Former Mayor Dinkins described NYC as a \"mosaic\" which always seemed very apt to me.I doubt that many of the suggestions in this article could be carried out, or would be effective if done.  Cities have been built for centuries because many people want to gather, to mix, to create, to learn from one another, and sometimes to prove they are the best -- or what they perceive as the best.One suggestion that I think has great merit and hope that somehow, someone will attempt is the \"new Corporation for Local News.\"  It is a public good, and sorely missing in much of this country. (Social media is not a substitute.)   All of us ought to be responsible citizens and neighbors, and serious thoughtful local news is critical to that end.  I also think that the habit of expecting rational and honest local reporting encourages an awareness of journalism as an avenue for information beyond the immediate.   ", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "Ross,Having lived in Atlanta now for 22 years I have seen nothing but growth for all those years with the exception of 2 years in 2009 and 2010 (great recession).Today we have 8,000 apartment units under construction and it goes on like that year after year. I don't see the necessity of redistribution of Atlanta wealth to the fly over states or any place else for that matter.. Those folks are arriving here in droves. We have the jobs too, with great in-town living and reasonably priced living expenses.Thanks anyway though for your offer, but we'll take a pass.", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "We could do with less DC.  On the other hand, our system has always been characterized by a centralization of power and decentralization of decision making and there are still FAR MORE federal facilities and employees outside of DC than in it.And yes, the \"liberal cosmopolises\" exhibit the same disease as \"the hinterlands:\" an increasingly unequal and brittle social hierarchy, too little opportunity for too many people, etc.This column does not provide any solutions. It does not even address the root causes.  Assuming that flesh and blood matter, the root causes must lie in what most affects the life history of most individuals -- the way we fund and deliver education and healthcare, the fix must lie in making big and long overdue changes to both, and anything else  -- e.g. \"the media,\" location of federal office buildings, and \"tax credits\" -- is unimportant in the scheme of things.Unfortunately, we have a political \"culture\" which cares about everything except what actually matters.  It will change -- the only question is how bad things have to get.", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "As someone who lives one county away from Akron - please stay in New York. Or wherever you perch. The logical inconsistency of distributing the largess of two eastern cities to our fly-over region's cities notwithstanding, Mr. Douthat demonstrates a poor grasp on the rise and retreat of the industrial heartland. Cleveland was great because of its location on a river on one of the great lakes - perfect for the industrializing United States. But that location is not as valuable as transport became cheaper (and less tied to waterways), as we shifted to a service-based economy, and as the industrial diaspora distributed manufacturing more generally throughout the nation.Do our Midwestern cities have problems? Sure. Will sending more from New York and Washington help? What do you think?", "author": "", "sentence": 3001}}, {"model": "api.Comment", "fields": {"content": "Is this satire? If not, you need to go back to the drawing table.Yes, like most New York liberals, I've read Hillbilly Elegy, and what struck me is that the lives of Vance's grandmother and mother were utterly stunted by pregnancy - his grandmother at age 13, and his salutatorian mother at 18. Maybe Republicans should start funding birth control and stop fighting abortion so that young, poor American women and their partners don't find themselves saddled with children before they can finish high school, go to college, and embark on a career. What good will Stanford-Buffalo do if people aren't graduating from high school? Early, unplanned pregnancy guarantees the cycle of poverty will continue.Improved public schools, affordable colleges and trade schools, job programs, and excellent healthcare including family planning, psychological and addiction services: these are the changes that rural America so desperately needs. These people don't need our urban imports, and they don't need government satellite offices. Republicans seem hell bent on keeping people uneducated and unhealthy. Hillary may not have been the country's savior, but at least she had plans to make community colleges free and improve Obamacare. And she put women's healthcare high on her agenda. As has become increasingly obvious, rural, white Trump supporters voted against their own interests, and I am growing tired of being expected to empathize with them.", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "We are becoming more urban because we are a service economy. Services do best when placed where there are a whole lot of people and companies to serve.  Lots of people chasing limited resources drive up prices. That is micro-economics, so Douthat should not have a quibble with it. High prices segregate wealth - another not particularly unique idea. As for Douthat's solution, I wonder if New Haven realized all it needed was a Liberal institution to make it thrive.... oh.We killed flyover country when we corporatized agriculture, and shed manufacturing leaving great swaths of small towns without an economic engine. It wasn't largely a Liberal pursuit that bought up the farmland in the 80s or broke up factories and sold them for parts, shipped jobs overseas, and closed the Twinkie bakery in order to sell the brand name for gobs of dough, so Douthat's contention that Liberal smugness ought to turn inward to fix the problem lacks sting.  Big business sold those towns - busted them up and sold them for parts as efficiently as Bain management broke up companies.Both Liberals and Conservatives have an interest in re-vitalzing the county. Pretending that half the country are uninterested smug \"elites\" or that there is an inherent problem with people aggregating in large urban areas doesn't solve the problem of flyover America. And so far, neither does the pro-business political class.  ", "author": "", "sentence": 3008}}, {"model": "api.Comment", "fields": {"content": "Funny, this exposes the shocking limits of the conservative imagination. Douthat is right, of course, that the wealth-generating qualities of America's most successful cities - SF, LA, NYC, Seattle, etc. - need to be dispersed across the country. Trump is right that the elite has left the heartland behind, but his policy solution - doubling down on the moribund manufacturing industries that have brought so much pain to the heartland - has it exactly wrong. What we need to be doing is exporting what is succeeding in SF and Seattle to Detroit and Buffalo and Traverse City. Douthat gets that much, but his thinking is so bound by conservative cant that all he can imagine are little half-measures involving tax incentives. It's so piddly it's laughable. What we need is major public investment in education and infrastructure outside the major metropolitan corridors. Think of it as a contemporary riff on President Lincoln's Pacific Railroad Acts and the Morrill Act, which made way for the transcontinental railroad and the land-grant university system. Those were large, risky public investments that paid off exponential returns. THAT would be ambitious.", "author": "", "sentence": 3009}}, {"model": "api.Comment", "fields": {"content": "Mr. Douthat,You clearly misunderstood liberal agenda. You believe we want to break mega-corporations, simply because they're too large. So you extrapolated... that if mega-corporations are bad, so are mega-cities. You assumed that because liberals say corporations lack a \"heart\", cities also lack one.Mr. Douthat, your core thesis is flawed.Liberals do not want to break-up mega-corporations. We want to constrain them, so they don't wield overwhelming power over workers, communities, and nations. We want to regulate them, to ensure they don't sneakily break safety laws or use high-tech means to leapfrog regulators.You clearly misunderstood what makes mega-corporations good -- and similarly what makes large cities good. It's not their overwhelming power -- that's the bad. The good parts are their efficiencies, large economies of scale, abundant resources (of workers, culture, art, knowledge), and their diversity. These must not be lessened -- lest we destroy what makes them good.So your wish to \"diversify\" the gov't and universities, by breaking them into \"satellite\" branches in remote parts of America is not a solution. Doing so will remove their economies-of-scale that made them efficient. And it will force them to rely on a rigid homogeneous workforce lacking diversity or vibrancy.The solution, Mr. Douthat, is to change middle America, so they also embrace broad thought and varied cultures. And tell them to cluster their lives and homes... into new cities!  ", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "There is a lot to like in this idea of the devolution of power. Unfortunately in the case of Washington DC, it could result in the right hand not knowing what the left hand is doing, like the EPA) not knowing what the Department of Energy is up to, because their head offices are far apart. But I would also ask Douthat to extend his wonderful idea: \"If you want your full tax exemption, show that you're employing people in lower-income states and cities. Meanwhile new business tax credits would encourage regional diversification, while the state and local tax deduction would be capped, making it more expensive for the upper class to live in and around high-cost, high-tax metropolitan areas.\" So, lets also apply this to those corporations who have outsourced to foreign countries to avoid high labor, environmental and public health costs.And lets break up the outrageous and undemocratic political imbalance in which the residents of a tiny state like Wyoming (pop .6M) have the same number of senators as California (pop 38M).  In fact, the combined populations of the 21 least populous states is about the same as California, and most of these are bastions of conservativism. So, lets break up the unfair, outsized political power of the small states, and pro-rate the voting power of their 2 senators according to their population. Voting power should be apportioned according to the number of citizens, not the number of acres of empty range land, forest, or farms.", "author": "", "sentence": 3007}}, {"model": "api.Comment", "fields": {"content": "As a middle-aged college professor, in a medium-sized post-industrial town, the idea of breaking up the network effects of the elite universities appeals to me. Mr. Douthat identifies a critical issue: it's pretty much impossible to enter into a middle-class life, and have a family, in any of the big vibrant metropolises, unless you have i) rich parents, or ii) a network of rich relatives, or iii) an extraordinary job (usually obtained by i) or ii)). We read about the experience of young people in China's big cities and feel sorry for them; it's only somewhat better here.As other commenters point out, some of the same aims, but not all, could be achieved by a tax code like that of the Eisenhower administration. Perhaps  both are good ideas.", "author": "", "sentence": 3001}}, {"model": "api.Comment", "fields": {"content": "Cities should indeed be more diverse in terms of making them accessible to working class and lower class Americans. More efforts should be made to locate affordable housing in urban areas.If you want to build a high-rise with $4,000 rents, then you also have to allocate a certain percentage of units that rent for less than $1,000, or you don't get all the infrastructure and zoning perks you desire.If you want our city to subsidize your corporation with tax incentives, then you have to scatter jobs to all corners of the city, not just in the high-dollar areas.Those types of policies I get behind.", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "If this systemic overhaul, designed to spread concentrated urban resources across rural areas, would be welcome in conservative circles, conservatives would finally need to reckon with the fact that their ideology is not a small government one. Conservatives only claim loyalty to small government to get out of helping groups they don't like. They decide entitlements need to shrink because a majority of red state constituents get uncomfortable with government money going to people with brown skin. Affirmative action is billed as reverse racism, yet the electoral college, designed to give more weight to the votes of middle America, is a perfectly acceptable form of systemic fixes to an imbalance of power. And apparently cities need to pump more wealth into rural America, beyond the disproportionate taxes they already pay, by siphoning influence into less populous states, affordable housing initiatives be damned. This article would be a less frustrating read if conservatives actually cared about every American citizen getting a fair deal, and not just ones that look a certain way.", "author": "", "sentence": 3001}}, {"model": "api.Comment", "fields": {"content": "I like the idea of sending some federal agencies out of DC, and it has much precedent. The Centers for Disease Control is in Atlanta. I suddenly wondered, well okay, it's a federal agency so WHY did it end up in Atlanta? (The answer surprised me: malaria was endemic in the South back in 1946.) The Mint was founded in Philadelphia in the 1790s when that city was the US capital, and stayed there, later branching out to New Orleans, Denver, San Francisco and other cities. The federal spinoff part of the plan seems easy enough to do, and there would be obvious benefits.Private universities lately seem awfully eager to set up remote campuses in some extremely dubious locations - NYU Dubai, really? - so a \"Stanford-Buffalo\" doesn't seem so odd to me either.I suspect some readers object to all this just because it's Mr. Douthat writing it (actually he credits Matt Yglesias - hardly a conservative - with the federal spinoff idea). ", "author": "", "sentence": 3009}}, {"model": "api.Comment", "fields": {"content": "The motives of this column are honorable, but the research is terrible.  For every rigorously zoned NIMBY place like New York or San Francisco, there's another city like Chicago that enthusiastically embraces changing its basic form.  Barely a mention of schools, by far the single most disruptive thing for middle-income families in US cities, thanks mostly to their bovine bureaucracies and third-rate leadership.  Barely a mention of the arbitrary boundaries that break up (or don't break up) metro areas, city school districts that are too big, suburban municipalities that are too small, and all kinds of units that maintain territory and don't work with each other.  And once again going almost solely on instinct that we can fix these problems with financial incentives and tax-code tweaks that won't survive even two presidential administrations without being repealed.", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "Ross needs to get out more. His description of cites, in particular the no kids-families can't afford to live in cities, is true of NYC, San Francisco, maybe Washington DC, and a few other places. There are 285 cities in the USA with population above 100,000 -- I'd bet that a fair few of them are not entirely populated by UMC liberals and hipsters. What's truly ironic (sorry for using the word but if fits) here is that Ross view of cities is the one that he himself would lampoon as the myopic world view of coastal elites. Try a visit to Milwaukee, Ross, or maybe Birmingham, Omaha, or any of those other \"mid-American\" cities where real Americans you pontificate about actually live.", "author": "", "sentence": 3008}}, {"model": "api.Comment", "fields": {"content": "I have to disagree with the majority of the commentators here.I think Ross is onto something--policies that would encourage the \"creative class\" and allied institutions to be at least a bit more evenly distributed around the country would be a good thing. Imagine how much healthier our polity would be if struggling interior towns and cities had more vibrant, creative economies, and a more competitive mix of voters.Why not a Mississippi Valley campus for a Harvard, a Yale, an NYU? Would do us a lot better than a satellite in Dubai!And from the perspective of naked political calculus, let's face it, if some proportion of the Democratic supermajorities in states CA and NY had moved into interior swing states before the 2016 elections, we might be in a very different place politically right now!", "author": "", "sentence": 3011}}, {"model": "api.Comment", "fields": {"content": "It is futile to try beating Trump at his own game.  This is the same man who penned his proud use of \"truthful hyperbole,\" his art of piling lies atop a kernel of truth and saying, with a straight face, that he tells it like it is.  This is the same man whose mouthpiece, Kellyanne Conway, shamelessly offered \"alternative facts\" from the White House.  This is the same man who cries \"fake news\" at anyone not spreading his propaganda.Trying to best Trump by lying is as doomed as trying to best Trump by teasing him.  The limits which apply to decent people do not apply to Trump.  The only limits which apply to Trump are political - both in terms of his power and his time in office.  And we need the full integrity of the press and of other political leadership intact when and where Trump's own abused authority ends.", "author": "", "sentence": 3410}}, {"model": "api.Comment", "fields": {"content": "I find Ms. Gessen's thesis not only correct but inspiring. The challenge of living in the world as it exists, with an adequate sense of how things actually work and what processes give us the best odds for effective action, is unrelenting. We all subvert ourselves, with disconcerting thoroughness and frequency, by the mental/emotional convolutions that Kahneman and Tversky helped to delineate. In addition, childhood coping strategies, the best we could manage as toddlers, too often harden into dysfunctional belief systems and ideologies; that I knew as well. But I'd never considered the pressure to escalate our own (inner and outer) rhetoric in an effort to convey our horror and dismay as the unthinkable becomes the commonplace.If, as Stalin is said to have declared, a single death is a tragedy while a million deaths is a statistic, then we further his intention of numbing our sensibilities by the very strategy we employ to try to stay aware. So I'm inspired to embrace a firmer discipline of open and critical awareness of what is in truth happening around, and within, myself, and the further discipline, even in casual conversation, of saying what I've seen as simply and clearly as possible. It's remarkably hard to tell the truth. It's fatal, to our individual and national integrity, not to do the best we can.        ", "author": "", "sentence": 3402}}, {"model": "api.Comment", "fields": {"content": "I agree with the basic premise of this article.  There are more than enough fair, and serious criticism to be made of Trump, and, thus, the exaggerated and unfair attacks against him by the Democrats and mainstream media -- whose goal is a Watergate-style show-trial to impeach him -- actually weaken the attention given to those fair and serious criticisms and give many people in the political middle more reason to view Trump's dishonesty as not that much worse than the dishonesty of those who unfairly attack him.", "author": "", "sentence": 3404}}, {"model": "api.Comment", "fields": {"content": "I hope that after this fiasco, Trump will realize that he won't be able to sign any important legislation unless he starts working with Democrats. Forget about trying to work with members of the freedom caucus in the House. They are ideologs and fanatics coming form very conservative and safe districts who are not interested in governing but to impose their extreme right wing ideas on the rest of the country no matter the consequences.It is about time for the leaders of the Republican Party to find a solution of a problem that has been plainly evident for a long time.", "author": "", "sentence": 134}}, {"model": "api.Comment", "fields": {"content": "\"President Trump faces a wrenching choice: Does he cede power to the anti-establishment wing or seek other pathways to successful governing?\"Yes, what a wonderful opportunity for Mr. Trump to pivot, dismiss the ultra-conservative, ideological, and naive hate-government Republicans, and take on both the Republican and Democratic Parties to actually try to do something constructive for middle- and working-class people--as he promised throughout his campaign.But since the best predictor of future behavior is past behavior, my bet is Trump continues to pursue his habit of: Given a choice, he typically makes the wrong one.  So likely Trump will double-down, act petulant and miserable, blame and harangue everyone and everything but himself, exercise terrible judgment, and pursue his standard course of destruction rather than being constructive.Face it: that man sows chaos and destabilization wherever he goes--the GOP, the country, our allies, the world, and his own White House aides and staff.Trump sets fires, he doesn't put them out.", "author": "", "sentence": 109}}, {"model": "api.Comment", "fields": {"content": "Feeling satisfaction as a result of Trump's debacle is not healthy.  And realizing that the hole that became deeper yesterday resulted largely from the Freedom Caucus's perverted sense of what it means to be free gives one pause for thought.  Still, there is joy in Mudville as I think about all of those millions of people who are able to edge away from the abyss by having the ACA's protection.", "author": "", "sentence": 127}}, {"model": "api.Comment", "fields": {"content": "The Freedom Caucus is the Koch Caucus and the Koch Caucus sent a very clear message to Ryan and Trump. Koch controls the GOP and Bannon controls Trump who doesn't control the GOP.", "author": "", "sentence": 115}}, {"model": "api.Comment", "fields": {"content": "Democrats should offer to cooperate with Trump on Healthcare, BUT on the condition precedent that the gerrymandered house districts be redrawn by an independent commission.Trump shouldn't have an issue with that as it's the \"safe seats\" that come in the way of a compromise.Republicans were congratulating themselves on how smart they were to gerrymander the house districts. But, it's come back to bite them instead. It's not just the citizens being held hostage by this partisanship, it's the future of the Republican Party itself - now reduced to being the Party of No. They just can't govern anymore...", "author": "", "sentence": 132}}, {"model": "api.Comment", "fields": {"content": "The RNC members in the House cobbled together a \"bill\" that was a hodge-podge of traditional ideas about how to manage medical care that never took into account what the citizens of the nation actually disliked about the ACA (a.k.a., Obamacare). Unfortunately, despite all the seven years of propaganda against the ACA the main thing that a lot of conservatives hated about Obamacare was the word \"Obama.\"  Poll-after-poll showed that when looked at in detail, the provisions of the ACA were acceptable to most conservatives (no surprise the original blueprint was from The Heritage Foundation).Unfortunately Ryan and his divergent mix of House Republicans, mistook the hatred of Obama for a desire for fiscally conservative measures that basically returned medical insurance back to \"everyone for himself\" with more tax breaks that primarily wealthy would benefit from (it's impossible to setup a health saving account when you cannot save any money in the first place).The problem that the RNC makes pronouncements, get cheers and assumes that everyone wants the full-on RNC agenda to deregulate everything and hand over the cash to those with the most money and make everyone else fend for themselves. That isn't exactly what We-the-People want - only a small but noisy (and wealthy) minority want the RNC pre-packaged agenda.", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "I'm not sure this is a Republican civil war--I think it's an American civil war, and there are two competing visions: that you should let people fend for themselves, including as regards paying for medical care, or that the community--the society, the government--cooperatively figures out how care gets distributed so that the most vulnerable get the most help, and that everybody gets adequate coverage.  The saga of the GOP \"health care plan\" illustrates how you can only pretend to be on both sides of this question for but so long.  Eventually legislation has to be written.  The devil, as they say, really IS in the details.", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "The Republican civil war both made Trump's presidency possible, and will destroy him, politically. Any presidency that is built on bluster, bullying, aggressive ignorance and almost total lack of a moral compass will eventually fail; However, even a good republican steward would have fallen short, if they would have relied on the \"freedom caucus\" - who live and breathe dogmatic hatred of government institutions - to participate in a rational governing process.", "author": "", "sentence": 119}}, {"model": "api.Comment", "fields": {"content": "Trump wants to blame the Democrats, the Freedom Caucus and other Republicans for this loss.  But he forgot a very important force - all the people in this country who voiced their opinions, who called their representatives, who marched in the streets, who demanded audiences in town hall meetings; all telling the White House and Congress to keep the ACA.  We need to continue being this force until Trump and all our representatives listen to what we feel is best for us.", "author": "", "sentence": 113}}, {"model": "api.Comment", "fields": {"content": "This article is written as if Trump was a savvy politician and clever negotiator. First of all he knows nothing about how government works nor does he care to learn. Some of his Cabinet know a little more, but not much more. His advisors and staff know less than he does. And for sure, he knows nothing about being a political leader or what it means to compromise to get things done. For him everything is about loyalty. Do what I want and back me up if someone gives me trouble, which right now is just about everybody. In addition, he does not want to take the time to get into the weeds, which is what Presidents have to do every now and then. As for health care, he doesn't have a clue what his bill was all about. To him the only thing that counts is to repeal and replace. That was his campaign promise and that is what he intended to do. If the law is a disaster, it would not be his fault. If it succeeds, it was because of him. Beware my friends, everything Trump does will be the same scenario.", "author": "", "sentence": 109}}, {"model": "api.Comment", "fields": {"content": "When all is said and done about this most recent foray into the ACA, this program was always just a stepping stone towards an eventual single payer program run by the government like Sweden has as Bernie always likes to say.  Well let me point you to the VA as a shining example of single payer.  That aside, the main complaint I hear about Obamacare are the meteoric premiums and lack of choice in providers.  Well there was nothing in the new Republican plan that addressed these issues seriously but chipped around at the edges.  What on earth can be wrong with a bifurcated system whereby we introduce good old American competition to drive down costs and let the insurance companies compete among themselves to win our business like every other major corporation.  Those of us less fortunate financially or with pre-existing conditions should be covered 100% by existing government programs.  With all the trillions spent on Obamacare so far to force a system on us we could afford to insure every man, women and child that cannot afford and really needs the coverage.  Why has the US Government become the arbiter of all things big and small for Americans and the largest vessel for the transfer of wealth from womb to tomb?  And why has the word \"Freedom\" become the object ire when our great nation is the last place on earth to preserve this high ideal? ", "author": "", "sentence": 104}}, {"model": "api.Comment", "fields": {"content": "The Freedom Caucus should be called the Safe Seat Caucus. All their gerrymandering is coming back to bedevil a party that now has no leverage over this faction, a party that says it stands for competition and free markets above all. Ha. I guess competition is good for everyone except Republican legislators, especially those who scream the loudest about the virtues of competition. ", "author": "", "sentence": 113}}, {"model": "api.Comment", "fields": {"content": "> ... Stephen K. Bannon ... described what happened as a flat-out failure that could inflict serious damage on this presidency - even if Mr. Bannon believes Congress, not Mr. Trump, deserves much of the blame.The administration are carpetbaggers, more so than any administration in decades. Out of towners. And they expect to ride into Washington and tell everyone how it's going to be?Trump and Pence are merely two out of 537 elected people. In two or four or eight years they'll be gone, and most of Congress will still be there. He's not a king, he's just a guy with a job and a contractual time limit.", "author": "", "sentence": 116}}, {"model": "api.Comment", "fields": {"content": "Do the American people realize that in any other democratic country in the world when a Parliament/Congress show such an utter incapability of showing a stable majority to govern they go home and new elections are called? You call yourself a democracy, but America is clearly and definitely an oligarchy and worst of all you do not have a clue on how to change", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "Washington's problems are largely structural requiring three solutions.  First, outlaw gerrymandering to remove the political cover of the obstructionist Freedom Caucus and others who no longer have to compromise.  Second, enact legislation no longer permitting Big Money influence now allowed by the SCOTUS decision called Citizens United.  Finally, build coalitions of moderates in Congress such as the Problem Solvers Caucus and efforts to protect them such as the salutary work of organizations like No Labels.  It is time to restore normal governance practices in our democracy if we are to return the word \"compromise\" to the legislative process and start moving America forward again.", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "The party that said no to Obama is also saying no to itself and Trump. Unless the Republicans can find a way to compromise (both amongst themselves and with Democrats), they are doomed to legislative gridlock even though they have majority in both houses and the White House.  We need government, so that capitalism won't run rampant over the poor, the sick, the elderly.  We need sensible regulation and a strong infrastructure that is designed for the future.  As we watch our ratings (compared to other countries) drop in health, in education, in happiness, we need to ask ourselves why this is so.  Trump campaigned on making America great (as in going back to the 1950s). Well, we paid more taxes back then, and millions were benefitting from the GI bill.  ", "author": "", "sentence": 109}}, {"model": "api.Comment", "fields": {"content": "Mr. Bannon should have worked harder to make sure a real and rational repeal and replacement of ObamaCare was presented for a vote, and less on compiling an enemies list.  We need real conservative leadership here - not childish squabbling.  Thank God for the Freedom Caucus stopping this monstrosity of a bill, which would have only substituted \"ObamaCare Lite\" for the current situation.  Repeal and erase entirely ObamaCare to get back to pre-2009 conditions, and enact cross-state insurance sales, tort reform, and Medic Aid reform.  Then we might stand a chance in actually reducing costs for the average American", "author": "", "sentence": 127}}, {"model": "api.Comment", "fields": {"content": "This could be a good opportunity for the Democrats to push for medicare-for-all: appeal to Trump's vindictiveness by aligning him against the R faction that wouldn't support him; appeal to his vanity by cementing his legacy with a policy that would elevate him to one of the best presidents in the last 70 years - healthcare for all would increase small business ownership, avoid the 3 million job losses repealing the ACA would cause, reduce health-care induced bankruptcies, and most importantly for him, cast him in a benevolent-dictator light.  We know Trump's weaknesses - if the Dems are smart they'll start using them to our collective advantage instead of impotently celebrating them!", "author": "", "sentence": 104}}, {"model": "api.Comment", "fields": {"content": "The past week revealed all of the weakness of the Bannon/Trump approach to (non)governance.  Neither could be bothered with the details of any version of the republican health care policy or what the impact would be on the Americans depending on coverage. Neither became engaged until the last few days when their approach was clearly to bully and threaten.  I doubt either of them learned a thing from the experience other than to say they regret not having that enemies list if the vote had gone to the floor. While I disagree with the extreme conservatives in the House, it was informative to watch Bannon defeated by a structure he cannot take down.  In that sense the score is Bannon/Trump 0 and Constitution 1.", "author": "", "sentence": 105}}, {"model": "api.Comment", "fields": {"content": "And how did Trump react to the bill's inevitable failure in the House?  Did he want to go back to the drawing board and work on the law itself?  No, Trump wanted a vote, so that he could name and shame dissenters.  Paul Ryan was equally indifferent to crafting better legislation, but he was worried about stopping the vote so as to stop showing the GOP schisms.These are the priorities of two of America's most powerful people.", "author": "", "sentence": 113}}, {"model": "api.Comment", "fields": {"content": "It is amateur hour in the White House, and this article clearly shows why. President Trump has no idea about the political landscape of his own party. The Gingrich coalition of right and crazy-alt-right that has been growing since 1994 has now erupted like a festering boil. The GOP should be two separate parties. It best resembles a European or Israeli-style accord between center-right and far-right in order to solidify a majority voting block. But beyond expediency, there is no philosophical accord. Enter Trump, a former Democrat who never really understood Washington political dynamics, and whom the GOP establishment leaders viewed as a convenient tool to get legislation through that would dismantle everything back to the New Deal.  They forgot that the President actually has to lead, and Trump doesn't know how to do this with the unruly factions in the GOP.So we are in for four years of infighting in the majority party. If the dysfunction of the Obama years was frustrating with obstructionist Republicans always trying to block legislation, how much worse is it going to be with three factions all trying to stymie the other two, and with a President who has no idea how to proceed with any of them. Priebus is no leader. Wonkish Ryan is utterly incapable of inspiring anyone.  McConnell is utterly sidelined. Trump--not in control and Pence is running around like a demented cheerleader trying to sell dysfunction as progress as if he were still on the campaign trail.Sad!", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "If Mr. Trump were capable of learning from this debacle, he would recognize that business deals and legislative deals are not the same.  Instead, he falls back on his usual approach, bullying and threatening.  The Republican Party is not able to govern in large part because it does not listen to the people it purports to represents.  In its arrogance, it professes to know better than citizens what those citizens need.  Democrats, having been stonewalled for eight years, are not going to jump on the Republican bandwagon any time soon, especially as Republicans try to make life harder for ordinary people while attempting to give windfalls to the very wealthy. If Mr. Trump really wants to cut the deficit, he will tax the wealthy. We are far below historic high taxes on the very rich.  They can and should pay more than they do.I fear instead we will see much more of what we've seen in the first two months of Trump's presidency: lies, bullying, threats, and spending public money on the Trump family's private pleasures.", "author": "", "sentence": 116}}, {"model": "api.Comment", "fields": {"content": "Certainly, Trump stumbled into the Republican \"civil war,\" but his predilections did not help matters. Trump's biggest debacles, such as the failure of the travel ban and this effort to repeal and replace the ACA, have several things in common. 1. Campaign slogans are no substitute for actual policy. 2. Creating or changing policies requires proper attention to the details -- something he is loath to do 3. Consult, consult, consult. Trump needs to reach beyond the circle of political neophytes, enablers and lackeys on whom he currently relies. Unfortunately, so many of the Republicans who could provide him with valuable perspective are on his enemies list dating back to the campaign. Admittedly, this 70 year-old man is unlikely to change the habits of a lifetime, and so the culture of this White House is also unlikely to change much. After this week, Trump may finally realize that he's not as powerful as he thought he was. His mandate is paper thin, and thus he can't strong arm politicians into doing his bidding. However, for Trump the deal is everything, and he desperately wants to be seen as a winner. If all the concessions Trump was willing to make to Freedom Caucus this week are an example, we can anticipate that he will support some truly appalling legislation in the future. It's going to be a very long four years.", "author": "", "sentence": 109}}, {"model": "api.Comment", "fields": {"content": "This was a painful lesson for Donald Trump, which hopefully he will learn from in dealing with foreign leaders as well.  Just as he cannot impose his will on his political opponents through threats and self-aggrandizement, neither will he be able to renegotiate trade deals or defense pacts by touting his own greatness.  It doesn't help that Trump has established himself as a compulsive liar: what potential negotiating partner, let alone adversary, will take him at his word?  If Trump wants to accomplish anything significant in his presidency, he will have to change his entire approach.  That will be no easy task for a 70-year-old man who has never admitted a mistake in his life.", "author": "", "sentence": 115}}, {"model": "api.Comment", "fields": {"content": "The AHCA debacle evidences the inherent instability of the Republican Party.The GOP establishment's conservative ideologues themselves oppose Trump's (empty?) campaign promises concerning healthcare, Medicare, Social Security, and the repair and updating of the nation's infrastructure. Moreover, the conservative GOP establishment can never satisfy the demands of the ever more regressive \"Freedom\" Caucus and its Tea-Party supporters.Both extreme wings of the GOP base--the new voters attracted by Trump's populist gestures and the Tea-Party regressives--cannot be simultaneously satisfied. Compromise will be viewed as betrayal.Speaker Ryan and President Trump may believe themselves to be skilled Doctors GOPensteins, but their Monster of a Party suffers from an untreatable autoimmune disorder. It aches at every sinew and joint. It scratches at every roughly stitched suture site. It's \"brain\" and its muscles work at cross purposes.The GOP is a patchwork of diverse cadaverous body parts--ever on the verge of collapsing into warring members and organs. The Party's divisive rhetoric of fear and its billionaire donors, in combination with gerrymandering and voter suppression, keep this Monster slouching in place or shambling in circles.How long before voters realize that, once empowered, the Party of \"No!\" becomes the Party of \"No-Can-Do\"?", "author": "", "sentence": 115}}]