[
  {
    "model": "api.Comment",
    "fields": {
      "content": "I hope that after this fiasco, Trump will realize that he won't be able to sign any important legislation unless he starts working with Democrats. Forget about trying to work with members of the freedom caucus in the House. They are ideologs and fanatics coming form very conservative and safe districts who are not interested in governing but to impose their extreme right wing ideas on the rest of the country no matter the consequences.It is about time for the leaders of the Republican Party to find a solution of a problem that has been plainly evident for a long time.",
      "author": "",
      "sentence": 126
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "\"President Trump faces a wrenching choice: Does he cede power to the anti-establishment wing or seek other pathways to successful governing?\"Yes, what a wonderful opportunity for Mr. Trump to pivot, dismiss the ultra-conservative, ideological, and naive hate-government Republicans, and take on both the Republican and Democratic Parties to actually try to do something constructive for middle- and working-class people--as he promised throughout his campaign.But since the best predictor of future behavior is past behavior, my bet is Trump continues to pursue his habit of: Given a choice, he typically makes the wrong one.  So likely Trump will double-down, act petulant and miserable, blame and harangue everyone and everything but himself, exercise terrible judgment, and pursue his standard course of destruction rather than being constructive.Face it: that man sows chaos and destabilization wherever he goes--the GOP, the country, our allies, the world, and his own White House aides and staff.Trump sets fires, he doesn't put them out.",
      "author": "",
      "sentence": 108
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "Feeling satisfaction as a result of Trump's debacle is not healthy.  And realizing that the hole that became deeper yesterday resulted largely from the Freedom Caucus's perverted sense of what it means to be free gives one pause for thought.  Still, there is joy in Mudville as I think about all of those millions of people who are able to edge away from the abyss by having the ACA's protection.",
      "author": "",
      "sentence": 126
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "The Freedom Caucus is the Koch Caucus and the Koch Caucus sent a very clear message to Ryan and Trump. Koch controls the GOP and Bannon controls Trump who doesn't control the GOP.",
      "author": "",
      "sentence": 121
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "Democrats should offer to cooperate with Trump on Healthcare, BUT on the condition precedent that the gerrymandered house districts be redrawn by an independent commission.Trump shouldn't have an issue with that as it's the \"safe seats\" that come in the way of a compromise.Republicans were congratulating themselves on how smart they were to gerrymander the house districts. But, it's come back to bite them instead. It's not just the citizens being held hostage by this partisanship, it's the future of the Republican Party itself - now reduced to being the Party of No. They just can't govern anymore...",
      "author": "",
      "sentence": 126
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "The RNC members in the House cobbled together a \"bill\" that was a hodge-podge of traditional ideas about how to manage medical care that never took into account what the citizens of the nation actually disliked about the ACA (a.k.a., Obamacare). Unfortunately, despite all the seven years of propaganda against the ACA the main thing that a lot of conservatives hated about Obamacare was the word \"Obama.\"  Poll-after-poll showed that when looked at in detail, the provisions of the ACA were acceptable to most conservatives (no surprise the original blueprint was from The Heritage Foundation).Unfortunately Ryan and his divergent mix of House Republicans, mistook the hatred of Obama for a desire for fiscally conservative measures that basically returned medical insurance back to \"everyone for himself\" with more tax breaks that primarily wealthy would benefit from (it's impossible to setup a health saving account when you cannot save any money in the first place).The problem that the RNC makes pronouncements, get cheers and assumes that everyone wants the full-on RNC agenda to deregulate everything and hand over the cash to those with the most money and make everyone else fend for themselves. That isn't exactly what We-the-People want - only a small but noisy (and wealthy) minority want the RNC pre-packaged agenda.",
      "author": "",
      "sentence": 107
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "I'm not sure this is a Republican civil war--I think it's an American civil war, and there are two competing visions: that you should let people fend for themselves, including as regards paying for medical care, or that the community--the society, the government--cooperatively figures out how care gets distributed so that the most vulnerable get the most help, and that everybody gets adequate coverage.  The saga of the GOP \"health care plan\" illustrates how you can only pretend to be on both sides of this question for but so long.  Eventually legislation has to be written.  The devil, as they say, really IS in the details.",
      "author": "",
      "sentence": 126
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "The Republican civil war both made Trump's presidency possible, and will destroy him, politically. Any presidency that is built on bluster, bullying, aggressive ignorance and almost total lack of a moral compass will eventually fail; However, even a good republican steward would have fallen short, if they would have relied on the \"freedom caucus\" - who live and breathe dogmatic hatred of government institutions - to participate in a rational governing process.",
      "author": "",
      "sentence": 120
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "Trump wants to blame the Democrats, the Freedom Caucus and other Republicans for this loss.  But he forgot a very important force - all the people in this country who voiced their opinions, who called their representatives, who marched in the streets, who demanded audiences in town hall meetings; all telling the White House and Congress to keep the ACA.  We need to continue being this force until Trump and all our representatives listen to what we feel is best for us.",
      "author": "",
      "sentence": 107
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "This article is written as if Trump was a savvy politician and clever negotiator. First of all he knows nothing about how government works nor does he care to learn. Some of his Cabinet know a little more, but not much more. His advisors and staff know less than he does. And for sure, he knows nothing about being a political leader or what it means to compromise to get things done. For him everything is about loyalty. Do what I want and back me up if someone gives me trouble, which right now is just about everybody. In addition, he does not want to take the time to get into the weeds, which is what Presidents have to do every now and then. As for health care, he doesn't have a clue what his bill was all about. To him the only thing that counts is to repeal and replace. That was his campaign promise and that is what he intended to do. If the law is a disaster, it would not be his fault. If it succeeds, it was because of him. Beware my friends, everything Trump does will be the same scenario.",
      "author": "",
      "sentence": 107
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "When all is said and done about this most recent foray into the ACA, this program was always just a stepping stone towards an eventual single payer program run by the government like Sweden has as Bernie always likes to say.  Well let me point you to the VA as a shining example of single payer.  That aside, the main complaint I hear about Obamacare are the meteoric premiums and lack of choice in providers.  Well there was nothing in the new Republican plan that addressed these issues seriously but chipped around at the edges.  What on earth can be wrong with a bifurcated system whereby we introduce good old American competition to drive down costs and let the insurance companies compete among themselves to win our business like every other major corporation.  Those of us less fortunate financially or with pre-existing conditions should be covered 100% by existing government programs.  With all the trillions spent on Obamacare so far to force a system on us we could afford to insure every man, women and child that cannot afford and really needs the coverage.  Why has the US Government become the arbiter of all things big and small for Americans and the largest vessel for the transfer of wealth from womb to tomb?  And why has the word \"Freedom\" become the object ire when our great nation is the last place on earth to preserve this high ideal? ",
      "author": "",
      "sentence": 107
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "The Freedom Caucus should be called the Safe Seat Caucus. All their gerrymandering is coming back to bedevil a party that now has no leverage over this faction, a party that says it stands for competition and free markets above all. Ha. I guess competition is good for everyone except Republican legislators, especially those who scream the loudest about the virtues of competition. ",
      "author": "",
      "sentence": 126
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "> ... Stephen K. Bannon ... described what happened as a flat-out failure that could inflict serious damage on this presidency - even if Mr. Bannon believes Congress, not Mr. Trump, deserves much of the blame.The administration are carpetbaggers, more so than any administration in decades. Out of towners. And they expect to ride into Washington and tell everyone how it's going to be?Trump and Pence are merely two out of 537 elected people. In two or four or eight years they'll be gone, and most of Congress will still be there. He's not a king, he's just a guy with a job and a contractual time limit.",
      "author": "",
      "sentence": 131
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "The past week revealed all of the weakness of the Bannon/Trump approach to (non)governance.  Neither could be bothered with the details of any version of the republican health care policy or what the impact would be on the Americans depending on coverage. Neither became engaged until the last few days when their approach was clearly to bully and threaten.  I doubt either of them learned a thing from the experience other than to say they regret not having that enemies list if the vote had gone to the floor. While I disagree with the extreme conservatives in the House, it was informative to watch Bannon defeated by a structure he cannot take down.  In that sense the score is Bannon/Trump 0 and Constitution 1.",
      "author": "",
      "sentence": 120
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "And how did Trump react to the bill's inevitable failure in the House?  Did he want to go back to the drawing board and work on the law itself?  No, Trump wanted a vote, so that he could name and shame dissenters.  Paul Ryan was equally indifferent to crafting better legislation, but he was worried about stopping the vote so as to stop showing the GOP schisms.These are the priorities of two of America's most powerful people.",
      "author": "",
      "sentence": 101
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "It is amateur hour in the White House, and this article clearly shows why. President Trump has no idea about the political landscape of his own party. The Gingrich coalition of right and crazy-alt-right that has been growing since 1994 has now erupted like a festering boil. The GOP should be two separate parties. It best resembles a European or Israeli-style accord between center-right and far-right in order to solidify a majority voting block. But beyond expediency, there is no philosophical accord. Enter Trump, a former Democrat who never really understood Washington political dynamics, and whom the GOP establishment leaders viewed as a convenient tool to get legislation through that would dismantle everything back to the New Deal.  They forgot that the President actually has to lead, and Trump doesn't know how to do this with the unruly factions in the GOP.So we are in for four years of infighting in the majority party. If the dysfunction of the Obama years was frustrating with obstructionist Republicans always trying to block legislation, how much worse is it going to be with three factions all trying to stymie the other two, and with a President who has no idea how to proceed with any of them. Priebus is no leader. Wonkish Ryan is utterly incapable of inspiring anyone.  McConnell is utterly sidelined. Trump--not in control and Pence is running around like a demented cheerleader trying to sell dysfunction as progress as if he were still on the campaign trail.Sad!",
      "author": "",
      "sentence": 108
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "If Mr. Trump were capable of learning from this debacle, he would recognize that business deals and legislative deals are not the same.  Instead, he falls back on his usual approach, bullying and threatening.  The Republican Party is not able to govern in large part because it does not listen to the people it purports to represents.  In its arrogance, it professes to know better than citizens what those citizens need.  Democrats, having been stonewalled for eight years, are not going to jump on the Republican bandwagon any time soon, especially as Republicans try to make life harder for ordinary people while attempting to give windfalls to the very wealthy. If Mr. Trump really wants to cut the deficit, he will tax the wealthy. We are far below historic high taxes on the very rich.  They can and should pay more than they do.I fear instead we will see much more of what we've seen in the first two months of Trump's presidency: lies, bullying, threats, and spending public money on the Trump family's private pleasures.",
      "author": "",
      "sentence": 107
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "Certainly, Trump stumbled into the Republican \"civil war,\" but his predilections did not help matters. Trump's biggest debacles, such as the failure of the travel ban and this effort to repeal and replace the ACA, have several things in common. 1. Campaign slogans are no substitute for actual policy. 2. Creating or changing policies requires proper attention to the details -- something he is loath to do 3. Consult, consult, consult. Trump needs to reach beyond the circle of political neophytes, enablers and lackeys on whom he currently relies. Unfortunately, so many of the Republicans who could provide him with valuable perspective are on his enemies list dating back to the campaign. Admittedly, this 70 year-old man is unlikely to change the habits of a lifetime, and so the culture of this White House is also unlikely to change much. After this week, Trump may finally realize that he's not as powerful as he thought he was. His mandate is paper thin, and thus he can't strong arm politicians into doing his bidding. However, for Trump the deal is everything, and he desperately wants to be seen as a winner. If all the concessions Trump was willing to make to Freedom Caucus this week are an example, we can anticipate that he will support some truly appalling legislation in the future. It's going to be a very long four years.",
      "author": "",
      "sentence": 107
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "This was a painful lesson for Donald Trump, which hopefully he will learn from in dealing with foreign leaders as well.  Just as he cannot impose his will on his political opponents through threats and self-aggrandizement, neither will he be able to renegotiate trade deals or defense pacts by touting his own greatness.  It doesn't help that Trump has established himself as a compulsive liar: what potential negotiating partner, let alone adversary, will take him at his word?  If Trump wants to accomplish anything significant in his presidency, he will have to change his entire approach.  That will be no easy task for a 70-year-old man who has never admitted a mistake in his life.",
      "author": "",
      "sentence": 107
    }
  },
  {
    "model": "api.Comment",
    "fields": {
      "content": "The AHCA debacle evidences the inherent instability of the Republican Party.The GOP establishment's conservative ideologues themselves oppose Trump's (empty?) campaign promises concerning healthcare, Medicare, Social Security, and the repair and updating of the nation's infrastructure. Moreover, the conservative GOP establishment can never satisfy the demands of the ever more regressive \"Freedom\" Caucus and its Tea-Party supporters.Both extreme wings of the GOP base--the new voters attracted by Trump's populist gestures and the Tea-Party regressives--cannot be simultaneously satisfied. Compromise will be viewed as betrayal.Speaker Ryan and President Trump may believe themselves to be skilled Doctors GOPensteins, but their Monster of a Party suffers from an untreatable autoimmune disorder. It aches at every sinew and joint. It scratches at every roughly stitched suture site. It's \"brain\" and its muscles work at cross purposes.The GOP is a patchwork of diverse cadaverous body parts--ever on the verge of collapsing into warring members and organs. The Party's divisive rhetoric of fear and its billionaire donors, in combination with gerrymandering and voter suppression, keep this Monster slouching in place or shambling in circles.How long before voters realize that, once empowered, the Party of \"No!\" becomes the Party of \"No-Can-Do\"?",
      "author": "",
      "sentence": 126
    }
  }
]
