[{"model": "api.Comment", "fields": {"content": "This is so crazy. The gleeful cruelty, the lack of compassion and empathy for anyone other than themselves and their immediate families (and even that is questionable as they remove basic care for women across the board) is beyond anything I have ever seen. If I were ever to operate in my job with such blatant disregard for and ignorance of policy, such a lack of empathy towards the citizens they were appointed to serve, not to mention the callous thoughtlessness of behavior, comment and action (\"I don't need a mammogram\"), I would immediately be fired. How utterly galling that the only actions we can take to remove these throwbacks to the Victorian age is far ahead in 2018.  That's far too long and too much damage to endure from this barbarian Congress. I've never been so angry. ", "author": "", "sentence": 316}}, {"model": "api.Comment", "fields": {"content": "I should be clear to everyone now what leadership looks like. Pres. Obama went around the country for about a year campaigning for Affordable Care Act (ACA), he bent over backward to bring Republicans on board, for the most part the Democrats let Republicans offer amendments, he called open White House meeting on live television and more. After all that the Republican said no and the Democrats moved ahead. Just look at how the GOP current piece of Healthcare legislation has progressed. That is what you get when you vote incompetent people into office. The media is not helping mattes either because they have constantly used false equivalence to muddy the water. America populace lose if this current bill passes. I hope not.", "author": "", "sentence": 303}}, {"model": "api.Comment", "fields": {"content": "The headline should read \"Paul Ryan Rushes to White House to Plead For Permission to Abandon Vote to Repeal Obamacare.\" Not only is this a defeat for Trump, but even more so for Ryan, who comes across as Trump's ineffectual lapdog. All that this has accomplished is the further disintegration of the Republican party.", "author": "", "sentence": 332}}, {"model": "api.Comment", "fields": {"content": "The United States should establish a single-payer system similar to what works in Europe.  The only system that really makes sense is government-sponsored insurance, where the pool of the insured is the entire U.S. population and risks are spread accordingly.We should scrap the entire U.S. health insurance industry, which emphasizes premium payments designed to enrich company executives and shareholders and pays as little as possible for actual health care services for the insured.  Ironically, Trumpcare will come to be viewed as such a flaming disaster that the country will have little choice but to turn to a national health services regime.", "author": "", "sentence": 331}}, {"model": "api.Comment", "fields": {"content": "Ironic, isn't it, that Planned Parenthood and other sources of less expensive care for women's reproductive systems is being cut in the same bill that is removing mandated insurance coverage for pregnancy care, pediatrics, emergency room etc.  In other words, it is important to deregulate everything, but regulate women's reproductive health to protect the fetus/baby-to-be.  A business has the right to follow its religious preferences in cases of insurance coverage in order to protect the unborn over the employee potential mother's right to decide when or if to have a child.  At the same time, it is argued that there is no need for mandatory insurance coverage of medical care for the fetus/baby in the womb or when born and growing up, nor for any emergency room care that the pregnant mother or her child might need. This is a statement that every potential life should take priority.  However, the welfare and care of said life and its carrier, the mother, should be privately financed. In other words, woe to those who cannot afford the medical care no longer paid for by insurance. Sad.", "author": "", "sentence": 323}}, {"model": "api.Comment", "fields": {"content": "I am so angry. How dare these vile men make me, my children, and my fellow citizens live with an uncertainty that our health care -- of all things! -- could be stripped away? The damage being done to our personal psyches and to the country overall is cruel and mendacious. I am also angry at how I have had to allocate the gifts this country has given me. Why, as a person who does well, have I not been able to pump money back into the economy as would be expected? Because my husband and I spent the last dozen years feeding the educational industrial vulture complex to educate our four children. Yes, they had wonderful educational opportunities, but it was crushing to make happen. Now to be faced with spending this phase of my life over a barrel endlessly feeding the medical/insurance vultures is NOT OK with me. I'm sick of being a good citizen, working hard and getting in the neck. Where is the relief for us? Where is some breathing room? In a country with the resources (financial and medical) we have from coast to coast, it is criminal to deny the full bounty to us as citizens who pay our fair share. And to my brothers and sisters who are ill and poor, my heart weeps for you. ", "author": "", "sentence": 316}}, {"model": "api.Comment", "fields": {"content": "If Trump and Ryan were real leaders they would show some courage and pull back this mess of a bill before it ever comes to a vote. But Trump would rather shame the Republicans into voting on it and then shame them again by rubbing all of their noses in the mess. Ryan is both gutless and shameless. He literally sees this plan as an act of mercy. But make no mistake, Ryan is no hero. He may yet have some second thoughts before deciding to go down into the deeps with this unworthy vessel.", "author": "", "sentence": 326}}, {"model": "api.Comment", "fields": {"content": "We need a universal health care system. Anything that is profit motivated is barbaric. The countries that have a government sponsored health care program all have better outcomes and at a lower cost than our current system. We can do it if people like you wake up and demand it. Take the profit out of our health care and we can have great care without the nightmares of dealing with the insurance companies.", "author": "", "sentence": 307}}, {"model": "api.Comment", "fields": {"content": "I'm having trouble understanding the angle here.  Ryan is a lot of things but he's not totally stupid - why back a bill that's clearly broadly unpopular and impossible to get through his own party?  Is this a way for him to blame Trump for pushing the bill and buy himself and the House some distance?  Does he want out of the speaker seat that he didn't really want when it was forced on him?  Are Ryan and Trump trying to look like they tried but then allow Obamacare to continue and \"fail on its own\" so they can push crazier changes later?The Republicans totally control this process, a public defeat here is a self-inflicted wound.  I find it hard to believe there's not a reason the Republican political leadership is allowing this to happen.", "author": "", "sentence": 326}}, {"model": "api.Comment", "fields": {"content": "The only thing better than Paul Ryan waiving the white flag is his commander in chief taking away his flag, and sending him back to the front line with a toy gun.", "author": "", "sentence": 312}}, {"model": "api.Comment", "fields": {"content": "Trump blames the Democrats – Now that is rich even from Trump. The Democrats (including Obama in his final days in office) made it very clear that they were willing to work with the Republicans to improve the ACA for the benefit of all the American people. The AHCA is a gallimaufry of a bill with tax cuts for the rich and evisceration of benefits for the less well off as its centerpiece. Trump, Ryan and the rest of their contemptable colleagues have only themselves to blame.", "author": "", "sentence": 305}}, {"model": "api.Comment", "fields": {"content": "In order to understand how screwed up this GOP bill is, listen to Tom Coburn of Oklahoma or Tom Price, neither one of them will accept any facts unless they agree with their idea of this bill.  I have lost a lot of respect for Doctor's after listening to Tom Price and having listed a multitude of inane statements by Ben Carson, sad and it makes me wonder if they were such great Doctor's why aren't they still practicing.....Tom Price strikes me as a cold hearted SOB.", "author": "", "sentence": 313}}, {"model": "api.Comment", "fields": {"content": "Republicans want to remove ACA for many reasons, one of them being to spread chaos and increase the divide in the society.  They are pushing for a dysfunctional system where regular people can't cope with the problems of everyday life, are overburdened and tired, and where the elites can gain more and more control of the government.", "author": "", "sentence": 316}}, {"model": "api.Comment", "fields": {"content": "As a class prefect/ monitor many decades ago, I had already realized one thing - It is far more difficult to govern when you are in the driver's seat, than it is to talk about governing sitting on the sidelines. There is honest reason why the bill had to be pulled and did not have enough votes - because it is NOT AN HONEST BILL meant for healthcare! It is a bill of vested interests, and no  conscienscious person representing an actively engaged constituency, could have accepted it. It is a senseless, brutal piece of legislation that was made with only one major intent - to bring down a legacy... That's not how you BUILD things! None of the wonders of the world ever got CREATED with the sole purpose of DESTROYING what was in existence...As for the President's childish behavior of 'blaming the democrats' ... well, what else can u expect of a man who never really grew up since his teens...", "author": "", "sentence": 332}}, {"model": "api.Comment", "fields": {"content": "This is NOT a major defeat for Trump. Donald Trump did not create the health care problems that currently beset our nation. Truth be told if Barack Obama had used his political capital and Democratic majority in 2009 to do just 2 things single payer health care and a major infrastructure work bill Donald Trump would not be President today.This will go down in history as a major defeat for work a day Americans who are being crushed economically as a casualty of the spiraling premium costs of the  wrong headed Affordable Care Act. Donald Trump is not the creator of these problems as he has only been an elected official for the past 2 months.The ACA will now die a long and painful death and take what is left of our health care system and many American workers bank accounts with it. Donald Trump will be remembered as the President who courageously tried to save our country from that fate and was blocked. Ultimately Obamacare should simply be repealed and the free market must be allowed to create the replacement.", "author": "", "sentence": 304}}, {"model": "api.Comment", "fields": {"content": "The defeat is mixed. We who support keeping the ACA and want some improvements to it (or single payer) are glad that we at least have health care for another few years. I am breathing a sigh of relief. The ACA has been a life saver to me, personally. However, consider what the loss means and the way it went down. 45 and the GOP can now say, \"hey man, we tried to bring you a bill that worked but it was the Democrats who shot it down\". Those of us in the resistance need more than ever to reach out to people who VOTE in midterm elections in order to make sure we get extremists out of government. The resistance worked today, but it was only one battle in many more to come. This ain't over. ", "author": "", "sentence": 307}}, {"model": "api.Comment", "fields": {"content": "This is by no means a victory for the Dems, just the end of the first round. Trump has yet to swing the budget ax.  There is more to come.", "author": "", "sentence": 304}}, {"model": "api.Comment", "fields": {"content": "Will the insurance companies-who want less regulation and more of the health care dollar-be complicit by exiting the market, driving up premiums, etc?  In doing so, they help in the demise of Obamacare; it becomes more unsustainable. If so, let's see if 45 uses his bully pulpit to force insurance companies to remain in the market….like he did with Carrier.  I would be okay if he did so and even claimed he was the one who \"fixed\" Obamacare.    Let's keep and improve upon what we have in place. ", "author": "", "sentence": 307}}, {"model": "api.Comment", "fields": {"content": "Had Ryan and the GOP held hearings, like they promised, the facts would have emerged and they could have crafted an appropriate bill that would have passed.  Instead, their contempt for the American electorate (they're correct--anyone who would vote them in is contemptible) caused them to rush through an incoherent proposal that no one could understand.  ", "author": "", "sentence": 313}}, {"model": "api.Comment", "fields": {"content": "I do not like this bill at all. I'd prefer Medicare for All. However, even moderate Republicans are not voting for that. More importantly, this debacle is just the latest example of the House and the Republican Party being held hostage by the fanatics of the Freedom Caucus. These 40 or so Members, about 10% of the entire House and about 20% of the Republicans, are out of the mainstream, uncompromising, and want to tear down every federal program. Tom Price and Mick Mulvaney are like minded and Trump probably had no idea just how right wing they are when he hired them.The Freedom Caucus gave Boehner fits too, and that's why he quit. Boehner needed Democratic votes to pass necessary legislation like the debt ceiling and budget bills. It's time Ryan learned that lesson, sidelined the Freedom Caucus, and ran the House in a more bi-partisan fashion. That would lead to much better government, but these 2 immediate effects. The ACA could be fixed and the Freedom Caucus members would find that they're not popular back home because they overplayed their hand. ", "author": "", "sentence": 309}}, {"model": "api.Comment", "fields": {"content": "The chaos created by the White House and the Republicans in Congress surrounding health care should prove to any Trump supporter that their basic human needs are of no interest to their representatives.If they can't recognize it now, one has to wonder -- with amazement and dismay -- if they ever will.", "author": "", "sentence": 316}}, {"model": "api.Comment", "fields": {"content": "While inherently complex and undoubtedly challenging, effective healthcare reform requires a consensus on a rather simple question: Do you consider healthcare coverage a basic human right?  The affirmative demands that a majority of Americans, regardless of age, health, or socioeconomic status to be prepared to buy in to a system that they may not see direct benefit for years to come (similar to Social Security).  The identity and number of \"payers\" for this system would be debated but a central foundation would be established.The negative champions personal responsibility on perhaps life-or-death matters and an understanding that every individual needs to take stock on their own financial and physical well-being to decide the appropriate amount of coverage.  Those below the poverty line (or whatever economic line is drawn in the sand) would need support, but everyone else would be \"on the hook\" for their care to some degree.You can't blame the insurance companies for trying to limit their coverage and increase their costs, it is the basis for profit.  The issue is the politicians, blue and red alike, that take their own conflicts of interest into Congress and ultimately their vote.  We can critique other global healthcare systems all we want, but the truth is that until we take a long, hard look in the mirror and decide what type of healthcare system we actually want, nothing substantive will pass, and if it does, the other side will seek repeal shortly thereafter.", "author": "", "sentence": 334}}, {"model": "api.Comment", "fields": {"content": "It's like seeing Hamilton for the third time, but in real life and without ticket scalping...\"you don't have the votes, you don't have the votes...you're gonna need congressional approval and you don't have the votes.\"", "author": "", "sentence": 324}}, {"model": "api.Comment", "fields": {"content": "Republicans have pushed for \"market\" solutions. Of course, as we can all recognize, \"health care delivery\" is not a \"market.\" To make matters worse, any attempts to appease all the factions for the many constituencies ( also ACA), are doomed to fail because neither are we \"one country.\" The delivery of health care can be achieved however, as all other OECD countries, with better outcomes and at lower cost if we would be reminded that we are \"ONE PEOPLE.\" As such, we will all visit the ER one day. It takes real courage to depend on each other. If we can no longer do that as AMERICANS, we are resigned to an even worse fate than we see now. ", "author": "", "sentence": 307}}, {"model": "api.Comment", "fields": {"content": "Here's a novel idea: instead of trying to satisfy the ultra conservative and the moderate wings of the Republican party, why not try working across the aisle and getting votes from the Democrats? The combined bouts of moderate Democrats and moderate Republicans is more than enough to get legislation passed without having to bend to unrealistic demands from the more radical wings of both parties.", "author": "", "sentence": 332}}, {"model": "api.Comment", "fields": {"content": "I thought being an American during the George W. Bush years was embarrassing enough.  I was mistaken.", "author": "", "sentence": 513}}, {"model": "api.Comment", "fields": {"content": "I do believe that Trump personally has no policy or ideal that informs him beyond  the \"I am the Greatest\". Thus he has been the perfect useful tool.As he started to propel himself into the political arena, it was never about staunch Democratic or Republican values that he wanted to work toward but hey the cameras are on me and they interview me all the time now. Thus as he moved up the political food chain, it was easy for those more skilled to latch on and mold the Donald.Thus he eventually ended up being manipulated by the Mercers and Steve Bannon. This worked because they spoke to his racism and mean nature. And since Trump likes to mix things up he also took on more moderates like Priebus.All these competing influences do not make for a coherent focus for the White House and Trump does not care.Say what you will about past Presidents, Reagan or Obama for example. Each in his own way had a PERSONAL and intimate vision about governance and American democracy which they were able to base their actions upon and convince others of. Trump does not. It is said that he acts based upon the last person he spoke to so no wonder there is no coherent vision. Trump does not believe that all press is good press. This is when he gets mean and dangerous.And we are left hoping that it was Jared he spoke to last.", "author": "", "sentence": 512}}, {"model": "api.Comment", "fields": {"content": "As Mr. Kristof says, Neil Gorsuch may be a \"first-rate lawyer,\" but he is also an originalist, corporate, inhumane ideologue whom I do not want to see filling Scalia's slippers on the high court. The Republicans talk a good superficial game of caring and patriotism, but they mainly seem to be good at destruction unless you're already a member of the 1%, in which case they deem you worthy of protection and power.", "author": "", "sentence": 510}}, {"model": "api.Comment", "fields": {"content": "Am I crazy to think that perhaps Trump's incompetence is a silver lining to the dark cloud of this administration? The least harmful outcome may be that the Trump administration achieves very little - all bombast, while their wheels spin in the mud?", "author": "", "sentence": 503}}, {"model": "api.Comment", "fields": {"content": "Incompetence, indeed. And a large part of that is lack of sense of responsibility to anyone other than himself, family, and \"friends.\" Let's say that, ok, the GOP had the right to propose and put in place an improved healthcare plan, since everyone knows that the ACA needs work. So, they tried, and failed in every way -- their plan was not better and couldn't be sustained even within their own ranks. Now the duty of all upright public servants (if there are any in the new regime) is to say, ok, we have to take what we have and make it as good as it can possibly be. Will any one of them do this? Especially the so-called president who is so quick to bark out orders and demands. Let's watch and see -- each and every one of them. This will go a long way towards showing us how to vote in 2018 and 2020, if we don't already know.", "author": "", "sentence": 507}}, {"model": "api.Comment", "fields": {"content": "You can't negotiate effectively if you haven't mastered the issues being negotiated. And with as short an attention span and as incurious as President Trump apparently is, and given the complexity of the issues to be legislated, it's hard to be optimistic that Washington will deal effectively with any of the challenges our nation faces.", "author": "", "sentence": 507}}, {"model": "api.Comment", "fields": {"content": "It is at least a little heartwarming to realize that republican effectiveness pales in comparison to their malevolence.", "author": "", "sentence": 505}}, {"model": "api.Comment", "fields": {"content": "If this is to be a test of Trumpy's credibility we're in trouble. And it's going to take a lot more than a few harangues by the Tweeter-in-Chief to scare the DPRK.", "author": "", "sentence": 241}}, {"model": "api.Comment", "fields": {"content": "Many Americans no doubt share the mindset of one reader as reflected in his rhetorical question: \"How can we be so incredibly stupid to allow this regime to become such a threat to its neighbors and the world.\" Implicit in this question is the belief that it is America's right, if not duty, to act unilaterally to prevent other nations to become threats to their neighbors and the world. I for one am very uncomfortable with such a belief and those who hold it, especially if they are in the White House. For if anything our post WWII experience taught us, it is unilateral interventionism is to be avoided whenever possible, unless of course a real and immediate danger to our defense is threatened.I daresay America is disliked (hated even) and distrusted in most of the world despite what our politicians tell us to the contrary.  Some of this animus is envy driven, but most is surely due to the perception that we use our tremendous power and wealth to bully and exploit other nations. Whenever we have acted militarily or covertly on a unilateral or phony multilateral basis, this perception is magnified in the eyes of other nations. Any action against N. Korea should be undertaken through the UN. If that is not possible, then with Japan and S. Korea and other neighbors more threatened by N. Korea than the U.S. is. If those neighbors don't feel threatened enough to genuinely join us in taking military action against N. Korea, we would be fools again to do so unilaterally.", "author": "", "sentence": 232}}, {"model": "api.Comment", "fields": {"content": "NK has threatened to nuke us on multiple occasions, and they have nukes to do it with.  It doesn't take a genius to come to the conclusion that they are our biggest threat, unless of course you are listening to our elected officials who whine about Iran day and night to appease their money lords. Their whine isn't harmless, the guy in Kansas who shot 2 Indian engineers thought they were Iranians as per his own words. This is why I can't take the fake threat from Russia seriously. It's mostly fabrications to distract the public to advance the neocon agenda. We are supposed to get all bent out of shape over people from Trump team meeting with, or talking to  Russians. Oh, the outrage from elected officials who go on their pilgrimage several times a year to get their marching orders from a foreign state. We are not supposed to cooperate with Russia in Syria against ISIS because that would mean Assad stays in power, which means Iranian influence in Syria continues, and apparently that's not acceptable to our bosses in Tel Aviv. ", "author": "", "sentence": 241}}, {"model": "api.Comment", "fields": {"content": "Disconcerting article, however, the tone almost implies that North Korea has an arsenal of nuclear weapons that could hit the United States.  This is a dubious assumption considering the decrepit economy of North Korea.  Therefore, what is the success rate of our missile defense system when n=1?  I bet it's a lot higher than 56%.  Diplomacy obviously hasn't worked to slow the advance of this nuclear program, therefore the only endgame I see is regime change through military intervention.  (Or we perpetually maintain the status quo until one of my vital organs gives out.)  But what happens to North Korea when the world topples it's regime?  Does South Korea take care of the millions of brainwashed and impoverished citizens?  What a mess that is.", "author": "", "sentence": 246}}, {"model": "api.Comment", "fields": {"content": "This was a great article, but it leaves me wondering if we should be broadcasting  this kind of information to the world.I have read multiple comments suggesting that Mr. Trump lacks the sophistication to react and appropriately respond to threats such as this. I think some people are making this more complex than it needs to be. The cold war policies that kept both Russian and American citizens alive during the most dangerous time in human history were, at the core, very simple. It really came down to the threat that if you use nuclear weapons against us, we will respond. Not proportionally, but we will destroy your country and your citizens. It was bleak and dangerous, but it worked. Some issues are not really that complex at all. North Korea needs to be sure, beyond any shadow of a doubt that any use of weapons of mass destruction against the United States or it's allies will result it its total destruction. This approach worked against a very powerful USSR, and it is the only real deterrent for a regime like North Korea. We can't slow them down, but we cannot stop them from developing nuclear weapons. The Iran debacle has hopefully shoed us the futility of dealing with bad international actors. Any attempt at diplomacy is simply seen as weakness and an open invitation to more bad behavior.", "author": "", "sentence": 241}}, {"model": "api.Comment", "fields": {"content": "Dealing with N.Korea requires a steady hand  and an ability to absorb complex relationships. Rash decisions will not work but well thought out ones might.Trump is basically a \"show President\" and I am not convinced in any way that he has the intelligence to deal with this situation. Complexity seems to allude him and his constant simplistic approach via Twitter is disturbing. When we have one of the contestant from Dancing with the Stars as the head of the Energy Department one must give great pause as to whether we have the right individuals in place to combat N. Korea. ", "author": "", "sentence": 209}}, {"model": "api.Comment", "fields": {"content": "North Korea's rapidly escalating nuclear capability is perhaps the most alarming issue the entire world is facing. In this era of deep division within our country, which borders on ideological civil war, it is most important that we not let fears of \"normalizing\" this president prevent us from supporting him in efforts to thwart this horrible threat. In this context, the ominous directive \"divide and conquer\" speaks volumes.  ", "author": "", "sentence": 213}}, {"model": "api.Comment", "fields": {"content": "This is a problem that requires an immense understanding of technology, geopolitics, culture, the individual psychology of North Korean leaders, military strategy, and diplomacy.And we have a game-show host as president.", "author": "", "sentence": 233}}, {"model": "api.Comment", "fields": {"content": "Because North Korea can fairly easily annihilate South Korea's capital, Seoul, with more than 10 million residents, even with conventional weapons, there is no solution to this problem without Chinese participation. Because nuclear weapons and military power have become central to the North Korean regime's frail legitimacy, the only solution to the crisis would be a carefully executed coup that removes the regime from power without triggering a nuclear launch.  Only China has the connections and clout within North Korea to pull that off.  The Chinese have no interest, however, in removing an effective buffer between their territory and the heavy U.S. troop presence in South Korea. The only way to remove this threat to regional and global security, therefore, is to negotiate a Chinese intervention in the North, a mutual guarantee of the security of a neutral and independent South Korea, possibly to be reunited with the North over time coupled with a Chinese withdrawal, and a U.S. withdrawal from the South. Nothing short of this can remove the North's nuclear threat.", "author": "", "sentence": 241}}, {"model": "api.Comment", "fields": {"content": "Has anyone considered diplomacy and engagement as the best of all possible options to minimize the chance for nuclear annihilation of the planet?  Does our government expect it can keep nations from advancing their understanding and learning of advanced scientific and engineering technology?  ", "author": "", "sentence": 241}}, {"model": "api.Comment", "fields": {"content": "If the US seriously wants China to help meaningfully (i.e., to help us impose reunification of the Koreas under the South's political system) we need a deal where we assure China that we will (1) assist in dealing with the refugee crisis that will ensue in the aftermath of what is likely to be a chaotic reunification process, and (2) terminate our defense treaty with the South and withdraw our troops post-reunification, allowing the South to become non-aligned. China craves border security above all else, and they don't trust that our military presence in South Korea is not a pretext to launch an offensive on China via the Korean peninsula. On the other hand, China and South Korea enjoy a friendly relationship, and without a threat from North Korea, the South would probably be very happy to stay non-aligned between the US and China. China would in turn gain an economically (if not politically) stable neighbor that was still not allied with the US.In short, if you remove North Korea as a basis for needing a large US military presence in the South, our troops can come home, China gets a peaceful neighbor, and you remove a major nuclear threat from the world.  Trump is The Great Dealmaker, and he is also looking for ways to reduce expenditures on alliances while increasing US security.  So let's start thinking outside of the box we have been trapped in for the past 60+ years and make a deal, already. ", "author": "", "sentence": 223}}, {"model": "api.Comment", "fields": {"content": "Kim Jong-un wants two things. The ability to stay in power and prestige and respect from the United States. We threaten him on both those desires. He fears us more than anything.And, more than anything, he wants to deter any hostile US intentions and actions against him and his power. So, naturally, when the most powerful nation is against you, a nuclear weapon that can hit the US is his insurance against aggression. He gets even more justification for his quest for nuclear every time we attempt to sabotage his efforts. It's a circular thing.As we try to crush his efforts he gains pretext for the efforts. What to do?I don't know. But I'd give him this back channel assurance and warning:\"We recognize your rule as leader of N. Korea to be legitimate even though we abhor your regime. We seek a stable peace but also stand ready and able to destroy your nation - the same as we do with other nuclear states - if we ever so much as detect a first use on your part. We include in the term \"first use\" any attempt at nuclear blackmail in words or actions. These will end badly for you. If you join the nuclear club, you live by the rules of the club. The most severe rule is you put yourself in a position to be annihilated. Your choice to join or not join the club.We will honor a peace with you until you force our hand.\"Then, sign a non-aggression treaty with Kim Jong-un.Make it showy. He'll be content with his accomplishments:Survival and respect.", "author": "", "sentence": 246}}, {"model": "api.Comment", "fields": {"content": "Great reporting by Sanger and Broad, and I like their discussion of the history behind North Korea's nuclear program.My two questions for our national security analysts to answer:1) Russian rocket scientists spearheaded the North Korean program; they're doing it for a paycheck, but what is their relationship to North Korea?  It can't be a pleasant place to live, although maybe they are compensated well.  Another aspect is that these scientists get to work on rockets, which is what they do for a living.  Another is that maybe they're just used to working an a totalitarian regime; maybe North Korea is not that much different for them.2) The use of nuclear weapons by a nation (well, okay, the old Soviet Union) was accompanied by the threat of their total annihilation by the U.S., and vice versa.  Kim Jong-un must have a clear idea of what he is getting into.  He may get one off, but he should understand that his nation would be vaporized.  Is it world understanding that North Korea would undergo a blistering nuclear counterattack if North Korea used nuclear weapons?Having a no-holds barred nuclear response to North Korean nuclear aggression should be an absolutely transparent policy to the world.  It doesn't seem to me that our government is emphasizing that possibility, but there can be no obstructive guilt feelings about a nuclear counterattack to North Korea.  It's what kept the world together in the cold war.", "author": "", "sentence": 242}}, {"model": "api.Comment", "fields": {"content": "I hope that after this fiasco, Trump will realize that he won't be able to sign any important legislation unless he starts working with Democrats. Forget about trying to work with members of the freedom caucus in the House. They are ideologs and fanatics coming form very conservative and safe districts who are not interested in governing but to impose their extreme right wing ideas on the rest of the country no matter the consequences.It is about time for the leaders of the Republican Party to find a solution of a problem that has been plainly evident for a long time.", "author": "", "sentence": 105}}, {"model": "api.Comment", "fields": {"content": "\"President Trump faces a wrenching choice: Does he cede power to the anti-establishment wing or seek other pathways to successful governing?\"Yes, what a wonderful opportunity for Mr. Trump to pivot, dismiss the ultra-conservative, ideological, and naive hate-government Republicans, and take on both the Republican and Democratic Parties to actually try to do something constructive for middle- and working-class people--as he promised throughout his campaign.But since the best predictor of future behavior is past behavior, my bet is Trump continues to pursue his habit of: Given a choice, he typically makes the wrong one.  So likely Trump will double-down, act petulant and miserable, blame and harangue everyone and everything but himself, exercise terrible judgment, and pursue his standard course of destruction rather than being constructive.Face it: that man sows chaos and destabilization wherever he goes--the GOP, the country, our allies, the world, and his own White House aides and staff.Trump sets fires, he doesn't put them out.", "author": "", "sentence": 105}}, {"model": "api.Comment", "fields": {"content": "Feeling satisfaction as a result of Trump's debacle is not healthy.  And realizing that the hole that became deeper yesterday resulted largely from the Freedom Caucus's perverted sense of what it means to be free gives one pause for thought.  Still, there is joy in Mudville as I think about all of those millions of people who are able to edge away from the abyss by having the ACA's protection.", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "The Freedom Caucus is the Koch Caucus and the Koch Caucus sent a very clear message to Ryan and Trump. Koch controls the GOP and Bannon controls Trump who doesn't control the GOP.", "author": "", "sentence": 134}}, {"model": "api.Comment", "fields": {"content": "Democrats should offer to cooperate with Trump on Healthcare, BUT on the condition precedent that the gerrymandered house districts be redrawn by an independent commission.Trump shouldn't have an issue with that as it's the \"safe seats\" that come in the way of a compromise.Republicans were congratulating themselves on how smart they were to gerrymander the house districts. But, it's come back to bite them instead. It's not just the citizens being held hostage by this partisanship, it's the future of the Republican Party itself - now reduced to being the Party of No. They just can't govern anymore...", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "The RNC members in the House cobbled together a \"bill\" that was a hodge-podge of traditional ideas about how to manage medical care that never took into account what the citizens of the nation actually disliked about the ACA (a.k.a., Obamacare). Unfortunately, despite all the seven years of propaganda against the ACA the main thing that a lot of conservatives hated about Obamacare was the word \"Obama.\"  Poll-after-poll showed that when looked at in detail, the provisions of the ACA were acceptable to most conservatives (no surprise the original blueprint was from The Heritage Foundation).Unfortunately Ryan and his divergent mix of House Republicans, mistook the hatred of Obama for a desire for fiscally conservative measures that basically returned medical insurance back to \"everyone for himself\" with more tax breaks that primarily wealthy would benefit from (it's impossible to setup a health saving account when you cannot save any money in the first place).The problem that the RNC makes pronouncements, get cheers and assumes that everyone wants the full-on RNC agenda to deregulate everything and hand over the cash to those with the most money and make everyone else fend for themselves. That isn't exactly what We-the-People want - only a small but noisy (and wealthy) minority want the RNC pre-packaged agenda.", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "I'm not sure this is a Republican civil war--I think it's an American civil war, and there are two competing visions: that you should let people fend for themselves, including as regards paying for medical care, or that the community--the society, the government--cooperatively figures out how care gets distributed so that the most vulnerable get the most help, and that everybody gets adequate coverage.  The saga of the GOP \"health care plan\" illustrates how you can only pretend to be on both sides of this question for but so long.  Eventually legislation has to be written.  The devil, as they say, really IS in the details.", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "The Republican civil war both made Trump's presidency possible, and will destroy him, politically. Any presidency that is built on bluster, bullying, aggressive ignorance and almost total lack of a moral compass will eventually fail; However, even a good republican steward would have fallen short, if they would have relied on the \"freedom caucus\" - who live and breathe dogmatic hatred of government institutions - to participate in a rational governing process.", "author": "", "sentence": 135}}, {"model": "api.Comment", "fields": {"content": "Trump wants to blame the Democrats, the Freedom Caucus and other Republicans for this loss.  But he forgot a very important force - all the people in this country who voiced their opinions, who called their representatives, who marched in the streets, who demanded audiences in town hall meetings; all telling the White House and Congress to keep the ACA.  We need to continue being this force until Trump and all our representatives listen to what we feel is best for us.", "author": "", "sentence": 105}}, {"model": "api.Comment", "fields": {"content": "This article is written as if Trump was a savvy politician and clever negotiator. First of all he knows nothing about how government works nor does he care to learn. Some of his Cabinet know a little more, but not much more. His advisors and staff know less than he does. And for sure, he knows nothing about being a political leader or what it means to compromise to get things done. For him everything is about loyalty. Do what I want and back me up if someone gives me trouble, which right now is just about everybody. In addition, he does not want to take the time to get into the weeds, which is what Presidents have to do every now and then. As for health care, he doesn't have a clue what his bill was all about. To him the only thing that counts is to repeal and replace. That was his campaign promise and that is what he intended to do. If the law is a disaster, it would not be his fault. If it succeeds, it was because of him. Beware my friends, everything Trump does will be the same scenario.", "author": "", "sentence": 105}}, {"model": "api.Comment", "fields": {"content": "When all is said and done about this most recent foray into the ACA, this program was always just a stepping stone towards an eventual single payer program run by the government like Sweden has as Bernie always likes to say.  Well let me point you to the VA as a shining example of single payer.  That aside, the main complaint I hear about Obamacare are the meteoric premiums and lack of choice in providers.  Well there was nothing in the new Republican plan that addressed these issues seriously but chipped around at the edges.  What on earth can be wrong with a bifurcated system whereby we introduce good old American competition to drive down costs and let the insurance companies compete among themselves to win our business like every other major corporation.  Those of us less fortunate financially or with pre-existing conditions should be covered 100% by existing government programs.  With all the trillions spent on Obamacare so far to force a system on us we could afford to insure every man, women and child that cannot afford and really needs the coverage.  Why has the US Government become the arbiter of all things big and small for Americans and the largest vessel for the transfer of wealth from womb to tomb?  And why has the word \"Freedom\" become the object ire when our great nation is the last place on earth to preserve this high ideal? ", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "The Freedom Caucus should be called the Safe Seat Caucus. All their gerrymandering is coming back to bedevil a party that now has no leverage over this faction, a party that says it stands for competition and free markets above all. Ha. I guess competition is good for everyone except Republican legislators, especially those who scream the loudest about the virtues of competition. ", "author": "", "sentence": 105}}, {"model": "api.Comment", "fields": {"content": "> ... Stephen K. Bannon ... described what happened as a flat-out failure that could inflict serious damage on this presidency - even if Mr. Bannon believes Congress, not Mr. Trump, deserves much of the blame.The administration are carpetbaggers, more so than any administration in decades. Out of towners. And they expect to ride into Washington and tell everyone how it's going to be?Trump and Pence are merely two out of 537 elected people. In two or four or eight years they'll be gone, and most of Congress will still be there. He's not a king, he's just a guy with a job and a contractual time limit.", "author": "", "sentence": 104}}, {"model": "api.Comment", "fields": {"content": "The past week revealed all of the weakness of the Bannon/Trump approach to (non)governance.  Neither could be bothered with the details of any version of the republican health care policy or what the impact would be on the Americans depending on coverage. Neither became engaged until the last few days when their approach was clearly to bully and threaten.  I doubt either of them learned a thing from the experience other than to say they regret not having that enemies list if the vote had gone to the floor. While I disagree with the extreme conservatives in the House, it was informative to watch Bannon defeated by a structure he cannot take down.  In that sense the score is Bannon/Trump 0 and Constitution 1.", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "And how did Trump react to the bill's inevitable failure in the House?  Did he want to go back to the drawing board and work on the law itself?  No, Trump wanted a vote, so that he could name and shame dissenters.  Paul Ryan was equally indifferent to crafting better legislation, but he was worried about stopping the vote so as to stop showing the GOP schisms.These are the priorities of two of America's most powerful people.", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "It is amateur hour in the White House, and this article clearly shows why. President Trump has no idea about the political landscape of his own party. The Gingrich coalition of right and crazy-alt-right that has been growing since 1994 has now erupted like a festering boil. The GOP should be two separate parties. It best resembles a European or Israeli-style accord between center-right and far-right in order to solidify a majority voting block. But beyond expediency, there is no philosophical accord. Enter Trump, a former Democrat who never really understood Washington political dynamics, and whom the GOP establishment leaders viewed as a convenient tool to get legislation through that would dismantle everything back to the New Deal.  They forgot that the President actually has to lead, and Trump doesn't know how to do this with the unruly factions in the GOP.So we are in for four years of infighting in the majority party. If the dysfunction of the Obama years was frustrating with obstructionist Republicans always trying to block legislation, how much worse is it going to be with three factions all trying to stymie the other two, and with a President who has no idea how to proceed with any of them. Priebus is no leader. Wonkish Ryan is utterly incapable of inspiring anyone.  McConnell is utterly sidelined. Trump--not in control and Pence is running around like a demented cheerleader trying to sell dysfunction as progress as if he were still on the campaign trail.Sad!", "author": "", "sentence": 134}}, {"model": "api.Comment", "fields": {"content": "If Mr. Trump were capable of learning from this debacle, he would recognize that business deals and legislative deals are not the same.  Instead, he falls back on his usual approach, bullying and threatening.  The Republican Party is not able to govern in large part because it does not listen to the people it purports to represents.  In its arrogance, it professes to know better than citizens what those citizens need.  Democrats, having been stonewalled for eight years, are not going to jump on the Republican bandwagon any time soon, especially as Republicans try to make life harder for ordinary people while attempting to give windfalls to the very wealthy. If Mr. Trump really wants to cut the deficit, he will tax the wealthy. We are far below historic high taxes on the very rich.  They can and should pay more than they do.I fear instead we will see much more of what we've seen in the first two months of Trump's presidency: lies, bullying, threats, and spending public money on the Trump family's private pleasures.", "author": "", "sentence": 126}}, {"model": "api.Comment", "fields": {"content": "Certainly, Trump stumbled into the Republican \"civil war,\" but his predilections did not help matters. Trump's biggest debacles, such as the failure of the travel ban and this effort to repeal and replace the ACA, have several things in common. 1. Campaign slogans are no substitute for actual policy. 2. Creating or changing policies requires proper attention to the details -- something he is loath to do 3. Consult, consult, consult. Trump needs to reach beyond the circle of political neophytes, enablers and lackeys on whom he currently relies. Unfortunately, so many of the Republicans who could provide him with valuable perspective are on his enemies list dating back to the campaign. Admittedly, this 70 year-old man is unlikely to change the habits of a lifetime, and so the culture of this White House is also unlikely to change much. After this week, Trump may finally realize that he's not as powerful as he thought he was. His mandate is paper thin, and thus he can't strong arm politicians into doing his bidding. However, for Trump the deal is everything, and he desperately wants to be seen as a winner. If all the concessions Trump was willing to make to Freedom Caucus this week are an example, we can anticipate that he will support some truly appalling legislation in the future. It's going to be a very long four years.", "author": "", "sentence": 113}}, {"model": "api.Comment", "fields": {"content": "This was a painful lesson for Donald Trump, which hopefully he will learn from in dealing with foreign leaders as well.  Just as he cannot impose his will on his political opponents through threats and self-aggrandizement, neither will he be able to renegotiate trade deals or defense pacts by touting his own greatness.  It doesn't help that Trump has established himself as a compulsive liar: what potential negotiating partner, let alone adversary, will take him at his word?  If Trump wants to accomplish anything significant in his presidency, he will have to change his entire approach.  That will be no easy task for a 70-year-old man who has never admitted a mistake in his life.", "author": "", "sentence": 135}}, {"model": "api.Comment", "fields": {"content": "The AHCA debacle evidences the inherent instability of the Republican Party.The GOP establishment's conservative ideologues themselves oppose Trump's (empty?) campaign promises concerning healthcare, Medicare, Social Security, and the repair and updating of the nation's infrastructure. Moreover, the conservative GOP establishment can never satisfy the demands of the ever more regressive \"Freedom\" Caucus and its Tea-Party supporters.Both extreme wings of the GOP base--the new voters attracted by Trump's populist gestures and the Tea-Party regressives--cannot be simultaneously satisfied. Compromise will be viewed as betrayal.Speaker Ryan and President Trump may believe themselves to be skilled Doctors GOPensteins, but their Monster of a Party suffers from an untreatable autoimmune disorder. It aches at every sinew and joint. It scratches at every roughly stitched suture site. It's \"brain\" and its muscles work at cross purposes.The GOP is a patchwork of diverse cadaverous body parts--ever on the verge of collapsing into warring members and organs. The Party's divisive rhetoric of fear and its billionaire donors, in combination with gerrymandering and voter suppression, keep this Monster slouching in place or shambling in circles.How long before voters realize that, once empowered, the Party of \"No!\" becomes the Party of \"No-Can-Do\"?", "author": "", "sentence": 133}}, {"model": "api.Comment", "fields": {"content": "As mentioned in the article, I was awake for part of my deep brain stimulation surgery. I found it to be more noisy in the operating room than I would have expected. In this case I wasn't able to see much since my head was fixed to the table with a metal frame. The consent to be awake is a necessity for this surgery so there is no choice involved.In the future I might might make the choice to be awake.", "author": "", "sentence": 407}}, {"model": "api.Comment", "fields": {"content": "Just what the surgeon needs, to be distracted by questions in the middle of your operation.", "author": "", "sentence": 403}}, {"model": "api.Comment", "fields": {"content": "People need to learn to just give up control.If the surgeon wants you awake, great. Otherwise, use GA or stay quiet.Why inject yourself into the procedure?I assure people having been in the OR many times that it doesn't help to have the surgical team worrying about other stuff than the surgery itself.You're not helping your own care by doing this.", "author": "", "sentence": 432}}, {"model": "api.Comment", "fields": {"content": "When I was 8.9999 months pregnant, I had a suspicious lump growing larger and larger in my armpit. Long story short, it was best to get it dealt with and examined by pathology before I gave birth. I was leery of the sedation that the surgeon wanted to do, and he agreed to forgo the sedation in this case. I told him he didn't have to try to talk with me and he cracked up (in relief, I think, since verbal interactions were not his strong suit). The only part I wasn't prepared for was the smell of laser cautery (especially since the smell of cooking meat was a huge nausea trigger in my entire pregnancy). I plan to have any other appropriate procedures awake as well.", "author": "", "sentence": 440}}, {"model": "api.Comment", "fields": {"content": "i once watched as two surgeons operated on a young woman for appendicitis. she was under general anesthesia. her appendix was normal, so they had the anesthetist give her some succinylcholine, inserted a retractor into the incision and literally pulled the hole to the left side of her body, where they found a problem with her left ovary. i don't think that would be possible with local anesthesia, mostly due to the patient's breathing stopping. makes me wonder if there are contraindications for some operations for the use of awake anesthesia. ", "author": "", "sentence": 415}}, {"model": "api.Comment", "fields": {"content": "If I require surgery again, I will inquire about the possibility of being awake throughout. I am a nurse, and also intensely curious...the opportunity to learn something with a couple of questions would be hard to turn down. I have observed surgeries before (the OR was one of my clinical rounds) and did just fine, though I would request an IV be placed so that I could be given medication for nausea or anxiety if required...I don't know if I'd react the same way if it was my own body being operated on.", "author": "", "sentence": 407}}, {"model": "api.Comment", "fields": {"content": "As someone who has had 7 surgeries in as many years, I'd rather not be an active participant in my surgical procedures.  My involvement takes place prior to surgery, asking the doctor relevant questions, and seeking a second opinion if needed.  At the point of surgery, I turn over control to the doctor.  If I am unwilling to do that, than perhaps I have selected the wrong doctor.", "author": "", "sentence": 411}}, {"model": "api.Comment", "fields": {"content": "I had a minor procedure a few years ago (at HSS) and they tried to sell me on staying awake. The anesthesiologist described 'regular' anesthesia as 'being on the bottom of the ocean' but he was just going to keep me 'just under the surface'. I told him that if I wake up, it won't be pretty.I didn't wake up until well after it was over and I was comfortably resting in the recovery room. There is not enough Xanax, Valium, Klonopin, or Ativan on this earth to keep me calm enough to stay awake whilst being sliced open. No way, no how, uh-uh, never. Knock me out and tell me when it's over. Besides, who couldn't use a really nice nap?", "author": "", "sentence": 439}}, {"model": "api.Comment", "fields": {"content": "I recently opted for a spinal-- i.e., regional anesthesia-- during surgery. My surgeon mentioned it as a possible but unpopular option and was surprised by my choice. But I was so afraid of general anesthesia after two \"near death experiences\" with inhalants that I probably wouldn't have had the (necessary) procedure at all if there weren't another choice. It went extremely well, partly because I was well prepared for exactly what would happen. I didn't watch, I listened to music. I would definitely recommend it. You can ask for a tranquilizer or some level of conscious sedation if it seems too stressful.", "author": "", "sentence": 439}}, {"model": "api.Comment", "fields": {"content": "Podiatrists have been doing foot and ankle surgery for over 40 years under monitored anesthesia care or local anesthesia.  In the early days, some of our Orthopedic colleagues thought we were crazy!  There is evidence that a local nerve block, will block the afferent pain signal to the brain, as the surgery begins.  This does not happen if a patient has general anesthesia. We believe this helps control, the post operative pain problems, literally before it starts.  It is also much safer for the liver to have local anesthesia then general anesthesia, particularly in older patients. Once a surgeon gets used to operating in a field that is a little more 'bloated' than it would be without the local, it's a great alternative for surgery.", "author": "", "sentence": 439}}]
