[{"fields": {"position": 23, "src": "https://static01.nyt.com/images/2017/03/24/nyregion/00HOMELESS1/00HOMELESS1-superJumbo.jpg", "caption": "Mayor Bill de Blasio, center, with the housing commissioner, Steven Banks, answering a question from Anna Corrado, a 25-year-old married mother of two who lives in a shelter nearby, at a town hall event in Brooklyn this month. “I don’t want to get stuck,” she said.", "article": 20}, "model": "api.Image"}, {"fields": {"position": 1, "src": "https://static01.nyt.com/images/2017/03/24/nyregion/00HOMELESS2/00HOMELESS2-master675.jpg", "caption": "A demonstration this month outside City Hall calling for affordable housing. While homelessness in New York City has been growing since 1980s, it now includes mostly families with children who could not afford high rents.", "article": 20}, "model": "api.Image"}, {"fields": {"position": 4, "src": "https://static01.nyt.com/images/2017/03/24/nyregion/00HOMELESS3/00HOMELESS3-superJumbo.jpg", "caption": "The Pan American Hotel, now known as Boulevard Family Residence, in Elmhurst, Queens, was rushed to turn into a shelter in 2014. Mayor de Blasio said he had no other choice.", "article": 20}, "model": "api.Image"}, {"fields": {"position": 36, "src": "https://static01.nyt.com/images/2017/03/24/nyregion/00HOMELESS4/00HOMELESS4-master675.jpg", "caption": "Steven Johnson, who became homeless after he served a 25-year sentence in prison, has lived in the Holiday Inn in Maspeth, Queens, for about nine months. With help from the city, he now has an $11-an-hour job as a maintenance worker, but his faith in the system is shaken.", "article": 20}, "model": "api.Image"}, {"fields": {"position": 38, "src": "https://static01.nyt.com/images/2017/03/24/nyregion/00HOMELESS5/00HOMELESS5-master675.jpg", "caption": "A shelter bed at Marsha’s House in the Bronx, a shelter designated for lesbian, gay, bisexual and transgender young adults that opened last month.", "article": 20}, "model": "api.Image"}]