[
  {
    "model": "api.Sentence",
    "pk": 101,
    "fields": {
      "content": "WASHINGTON - President Trump ignites a lot of fights, but his failure to repeal the Affordable Care Act, the biggest defeat in his short time in the White House, was the result of something else: a long-running Republican civil war that humbled a generation of party leaders before he ever came to Washington.",
      "position": 1,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 102,
    "fields": {
      "content": "A precedent-flouting president who believes that Washington's usual rules do not apply to him, Mr. Trump now finds himself shackled by them.",
      "position": 2,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 103,
    "fields": {
      "content": "In stopping the repeal of President Barack Obama's proudest legacy  - the Republican Party's professed priority for the last seven years - from even coming to a vote, the rebellious far right wing out-rebelled Mr. Trump, taking on and defeating the party establishment with which it has long been at war and which he now leads.",
      "position": 3,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 104,
    "fields": {
      "content": "Like every one else who has tried to rule a fissured and fractious party, Mr. Trump now faces a wrenching choice: retrenchment or realignment.",
      "position": 4,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 105,
    "fields": {
      "content": "Does he cede power to the anti-establishment wing of his party? Or does he seek other pathways to successful governing by throwing away the partisan playbook and courting a coalition with the Democrats, whom he has improbably blamed for his party's shortcomings?",
      "position": 5,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 106,
    "fields": {
      "content": "\"It's really a problem in our own party, and that's something he'll need to deal with moving forward,\" said Representative Tom Cole of Oklahoma, an ally of the center-right Tuesday Group, which stuck with Mr. Trump in the health care fight and earned the president's praise in the hours after the bill's defeat.",
      "position": 6,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 107,
    "fields": {
      "content": "\"I think he did a lot - he met with dozens and dozens of members and made a lot of accommodations - but in the end, there's a group of people in this party who just won't say yes,\" Mr. Cole said. \"At some point, I think that means looking beyond our conference. The president is a deal maker, and Ronald Reagan cut some of his most important deals with Democrats.\"",
      "position": 7,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 108,
    "fields": {
      "content": "Mr. Trump is not there yet. Before becoming a presidential candidate, he seemed to have little fixed ideology. But as president, he has operated from the standard-issue Republican playbook, embracing many of the positions of Speaker Paul D. Ryan and the party establishment. While he is angry and thirsty for revenge, he seems determined to swallow the loss in hopes of marshaling enough Republican support to pass spending bills, an as-yet unformed tax overhaul and a $1 trillion infrastructure package - legislation that could attract considerable Democratic support but has the potential to split the party.",
      "position": 8,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 109,
    "fields": {
      "content": "On Friday evening, a somewhat shellshocked president retreated to the White House residence to grieve and assign blame. In a search for scapegoats, he asked his advisers repeatedly: Whose fault was this?",
      "position": 9,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 110,
    "fields": {
      "content": "Increasingly, that blame has fallen on Reince Priebus, the White House chief of staff, who coordinated initial legislative strategy on the health care bill with Mr. Ryan, his close friend and a fellow Wisconsinite, according to three people briefed on the president's recent discussions.",
      "position": 10,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 111,
    "fields": {
      "content": "Despite the public displays of unity with the speaker, Mr. Trump and his team now regret outsourcing so much of the early drafting to Mr. Ryan. One aide compared doing that to a developer's staking everything on obtaining a property without conducting a thorough inspection. And they were stunned by his inability to master the politics of his own conference.",
      "position": 11,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 112,
    "fields": {
      "content": "Mr. Trump, an image-obsessed developer with a lifelong indifference toward the mechanics of governance, made a game effort to negotiate with members of the far-right Freedom Caucus, even if it seemed to some members of that group, who spoke on the condition of anonymity, that he did not have the greatest grasp of health care policy or legislative procedure.",
      "position": 12,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 113,
    "fields": {
      "content": "He told one adviser late Friday that his loss - a legislative debacle foreshadowed by the intraparty fight that led to the 2013 government shutdown - was a minor bump in the road and that the White House would recover.",
      "position": 13,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 114,
    "fields": {
      "content": "In an interview with The New York Times on Friday, Mr. Trump asserted that the administration was \"rocking.\" The problem, he suggested, was divisions among Republicans.",
      "position": 14,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 115,
    "fields": {
      "content": "There are \"a lot of players, a lot of players with a very different mind-set,\" Mr. Trump said. \"You have liberals, even within the Republican Party. You have the conservative players.\"",
      "position": 15,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 116,
    "fields": {
      "content": "But his advisers were more realistic. Mr. Trump's chief strategist, Stephen K. Bannon, according to people familiar with White House discussions, described the president's decision to withdraw the health care bill in the face of its almost-certain defeat as a flat-out failure that could inflict serious damage on this presidency - even if Mr. Bannon believes Congress, not Mr. Trump, deserves much of the blame.",
      "position": 16,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 117,
    "fields": {
      "content": "Mr. Bannon and the president's more soft-spoken legislative affairs director, Marc Short, pushed Mr. Trump hard to insist on a public vote, as a way to identify, shame and pressure \"no\" voters who were killing their best chance to unravel the health care law.",
      "position": 17,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 118,
    "fields": {
      "content": "One Republican congressional aide who was involved in the last-minute negotiations said Mr. Bannon and Mr. Short were seeking to compile an enemies list. Mr. Ryan repeatedly counseled the president to avoid seeking vengeance - at least until he has passed spending bills and a debt-ceiling increase needed to keep the government running. In the end, the president decided to back down.",
      "position": 18,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 119,
    "fields": {
      "content": "But Mr. Trump's advisers worry about the hard reality - the developer with the tough-guy veneer was steamrollered by factions in the Republican Congress.",
      "position": 19,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 120,
    "fields": {
      "content": "As the dust settled on the health care debacle, it was clear that Mr. Trump's lieutenants in the Republican civil war had been divided on how they thought the health care fight should have been handled, which does not augur well for the political battles to come.",
      "position": 20,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 121,
    "fields": {
      "content": "Mutual disgust with the Freedom Caucus seems to be pulling Mr. Ryan and, despite his misgivings, Mr. Trump, together, at least for now - just as it briefly united President Barack Obama and John A. Boehner, Mr. Ryan's long-suffering predecessor, during their doomed effort to reach a \"grand bargain\" on a tax overhaul in 2011.",
      "position": 21,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 122,
    "fields": {
      "content": "Until the very end, Mr. Trump's team was deeply divided over whether he should fully commit to a hard sell on a bill they viewed as fundamentally flawed, with Vice President Mike Pence pointedly advising the president to label the effort \"Ryancare,\" not \"Trumpcare,\" according to aides.",
      "position": 22,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 123,
    "fields": {
      "content": "Many on Mr. Trump's team disengaged from the process even as he dug in. Gary D. Cohn, Mr. Trump's top economic adviser, had originally been tasked with playing a large role in shepherding the legislation from the White House side. But Mr. Cohn had grown leery of the bill, and the White House recognized that Mr. Cohn, a former president of Goldman Sachs and a Democrat, was not a good messenger to deal with recalcitrant conservatives.",
      "position": 23,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 124,
    "fields": {
      "content": "Mr. Trump's son-in-law, Jared Kushner, a key adviser, had said for weeks that he thought supporting the bill was a mistake, according to two people who spoke with him. But he was on a family skiing trip in Aspen, Colo., last week, and did not return to Washington until Friday - much to the annoyance of Mr. Trump, who thought he should have been in Washington in the whole week, according to two Republicans close to the White House.",
      "position": 24,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 125,
    "fields": {
      "content": "But Mr. Trump brushed aside those concerns in the last few days and embraced the conventional role as leader of his party. He has one speed when he decides to shift to sales mode, aides said, and he had trouble modulating his tone, issuing cringe-inducing superlatives like \"wonderful\" to describe an ungainly bill his aides described as anything but.",
      "position": 25,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 126,
    "fields": {
      "content": "After it was all over, the president dutifully blamed the Democrats, a party out of power and largely leaderless, after turning his back on their offers to negotiate on a bipartisan package that would have addressed shortcomings in the Affordable Care Act while preserving its core protections for poor and working-class patients.",
      "position": 26,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 127,
    "fields": {
      "content": "Aides advised him the argument was nonsensical, according to a person with knowledge of the interaction.",
      "position": 27,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 128,
    "fields": {
      "content": "For Mr. Trump's Republican opponents, here was revenge served cold. As a candidate in 2016, he initially scoffed at signing a Republican loyalty pledge, at times behaving more like an independent invading the Republican host organism than like a typical presidential candidate.",
      "position": 28,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 129,
    "fields": {
      "content": "As president, Mr. Trump has left dozens of critical administration jobs unfilled, rejecting stalwart Republican applicants deemed insufficiently loyal to him - and now he is decrying the disloyalty of the 20 to 30 conservative members who outmaneuvered and overpowered him on health care.",
      "position": 29,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 130,
    "fields": {
      "content": "\"We all learned a lot - we learned a lot about loyalty,\" a solemn Mr. Trump told reporters late Friday.",
      "position": 30,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 131,
    "fields": {
      "content": "The dynamic that led to his defeat is bigger than Mr. Trump, despite his tendency to personalize every win or loss. Republicans who gained power by savaging Washington are in full control and cannot agree on a path forward.",
      "position": 31,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 132,
    "fields": {
      "content": "\"We were a 10-year opposition party,\" Mr. Ryan said in assessing the defeat late Friday. \"Being against things was easy to do.\"",
      "position": 32,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 133,
    "fields": {
      "content": "Former Speaker Newt Gingrich, a Trump supporter, said after the health bill was pulled that he was \"getting some déjà vu right now.\"",
      "position": 33,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 134,
    "fields": {
      "content": "\"Do you think Donald J. Trump goes home tonight, shrugs and says, ‘This is what winning looks like'?\" Mr. Gingrich added. \"No! But this is where the Republican Party is right now, and it's been this way for years.\"",
      "position": 34,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 135,
    "fields": {
      "content": "But Mr. Trump put on his best face on Saturday morning. \"ObamaCare will explode and we will all get together and piece together a great healthcare plan for THE PEOPLE,\" he said on Twitter. \"Do not worry!\"",
      "position": 35,
      "article": 1,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 201,
    "fields": {
      "content": "WASHINGTON - Three years ago, President Barack Obama ordered Pentagon officials to step up their cyber and electronic strikes against North Korea's missile program in hopes of sabotaging test launches in their opening seconds.",
      "position": 1,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 202,
    "fields": {
      "content": "Soon a large number of the North's military rockets began to explode, veer off course, disintegrate in midair and plunge into the sea. Advocates of such efforts say they believe that targeted attacks have given American antimissile defenses a new edge and delayed by several years the day when North Korea will be able to threaten American cities with nuclear weapons launched atop intercontinental ballistic missiles.",
      "position": 2,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 203,
    "fields": {
      "content": "But other experts have grown increasingly skeptical of the new approach, arguing that manufacturing errors, disgruntled insiders and sheer incompetence can also send missiles awry. Over the past eight months, they note, the North has managed to successfully launch three medium-range rockets. And Kim Jong-un, the North Korean leader, now claims his country is in \"the final stage in preparations\" for the inaugural test of his intercontinental missiles - perhaps a bluff, perhaps not.",
      "position": 3,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 204,
    "fields": {
      "content": "An examination of the Pentagon's disruption effort, based on interviews with officials of the Obama and Trump administrations as well as a review of extensive but obscure public records, found that the United States still does not have the ability to effectively counter the North Korean nuclear and missile programs. Those threats are far more resilient than many experts thought, The New York Times's reporting found, and pose such a danger that Mr. Obama, as he left office, warned President Trump they were likely to be the most urgent problem he would confront.",
      "position": 4,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 205,
    "fields": {
      "content": "Mr. Trump has signaled his preference to respond aggressively against the North Korean threat. In a Twitter post after Mr. Kim first issued his warning on New Year's Day, the president wrote, \"It won't happen!\" Yet like Mr. Obama before him, Mr. Trump is quickly discovering that he must choose from highly imperfect options.",
      "position": 5,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 206,
    "fields": {
      "content": "He could order the escalation of the Pentagon's cyber and electronic warfare effort, but that carries no guarantees. He could open negotiations with the North to freeze its nuclear and missile programs, but that would leave a looming threat in place. He could prepare for direct missile strikes on the launch sites, which Mr. Obama also considered, but there is little chance of hitting every target. He could press the Chinese to cut off trade and support, but Beijing has always stopped short of steps that could lead to the regime's collapse.",
      "position": 6,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 207,
    "fields": {
      "content": "In two meetings of Mr. Trump's national security deputies in the Situation Room, the most recent on Tuesday, all those options were discussed, along with the possibility of reintroducing nuclear weapons to South Korea as a dramatic warning. Administration officials say those issues will soon go to Mr. Trump and his top national security aides.",
      "position": 7,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 208,
    "fields": {
      "content": "The decision to intensify the cyber and electronic strikes, in early 2014, came after Mr. Obama concluded that the $300 billion spent since the Eisenhower era on traditional antimissile systems, often compared to hitting \"a bullet with a bullet,\" had failed the core purpose of protecting the continental United States. Flight tests of interceptors based in Alaska and California had an overall failure rate of 56 percent, under near-perfect conditions. Privately, many experts warned the system would fare worse in real combat.",
      "position": 8,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 209,
    "fields": {
      "content": "So the Obama administration searched for a better way to destroy missiles. It reached for techniques the Pentagon had long been experimenting with under the rubric of \"left of launch,\" because the attacks begin before the missiles ever reach the launchpad, or just as they lift off. For years, the Pentagon's most senior officers and officials have publicly advocated these kinds of sophisticated attacks in little-noticed testimony to Congress and at defense conferences.",
      "position": 9,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 210,
    "fields": {
      "content": "The Times inquiry began last spring as the number of the North's missile failures soared. The investigation uncovered the military documents praising the new antimissile approach and found some pointing with photos and diagrams to North Korea as one of the most urgent targets.",
      "position": 10,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 211,
    "fields": {
      "content": "After discussions with the office of the director of national intelligence last year and in recent days with Mr. Trump's national security team, The Times agreed to withhold details of those efforts to keep North Korea from learning how to defeat them. Last fall, Mr. Kim was widely reported to have ordered an investigation into whether the United States was sabotaging North Korea's launches, and over the past week he has executed senior security officials.",
      "position": 11,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 212,
    "fields": {
      "content": "The approach taken in targeting the North Korean missiles has distinct echoes of the American- and Israeli-led sabotage of Iran's nuclear program, the most sophisticated known use of a cyberweapon meant to cripple a nuclear threat. But even that use of the \"Stuxnet\" worm in Iran quickly ran into limits. It was effective for several years, until the Iranians figured it out and recovered. And Iran posed a relatively easy target: an underground nuclear enrichment plant that could be attacked repeatedly.",
      "position": 12,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 213,
    "fields": {
      "content": "In North Korea, the target is much more challenging. Missiles are fired from multiple launch sites around the country and moved about on mobile launchers in an elaborate shell game meant to deceive adversaries. To strike them, timing is critical.",
      "position": 13,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 214,
    "fields": {
      "content": "Advocates of the sophisticated effort to remotely manipulate data inside North Korea's missile systems argue the United States has no real alternative because the effort to stop the North from learning the secrets of making nuclear weapons has already failed. The only hope now is stopping the country from developing an intercontinental missile, and demonstrating that destructive threat to the world.",
      "position": 14,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 215,
    "fields": {
      "content": "\"Disrupting their tests,\" William J. Perry, secretary of defense in the Clinton administration, said at a recent presentation in Washington, would be \"a pretty effective way of stopping their ICBM program.\"",
      "position": 15,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 216,
    "fields": {
      "content": "Three generations of the Kim family have dreamed that their broken, otherwise failed nation could build its own nuclear weapons, and the missiles to deliver them, as the ultimate survival strategy. With nukes in hand, the Kims have calculated, they need not fear being overrun by South Korea, invaded by the United States or sold out by China.",
      "position": 16,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 217,
    "fields": {
      "content": "North Korea began seeking an intercontinental ballistic missile decades ago: It was the dream of Kim Il-sung, the country's founder, who bitterly remembered the American threats to use nuclear weapons against the North during the Korean War.",
      "position": 17,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 218,
    "fields": {
      "content": "His break came after the collapse of the Soviet Union, when out-of-work Russian rocket scientists began seeking employment in North Korea. Soon, a new generation of North Korean missiles began to appear, all knockoffs of Soviet designs. Though flight tests were sparse, American experts marveled at how the North seemed to avoid the kinds of failures that typically strike new rocket programs, including those of the United States in the late 1950s.",
      "position": 18,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 219,
    "fields": {
      "content": "The success was so marked that Timothy McCarthy of the Middlebury Institute of International Studies at Monterey wrote in a 2001 analysis that Pyongyang's record \"appears completely unique in the history of missile development and production.\"",
      "position": 19,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 220,
    "fields": {
      "content": "In response, President George W. Bush  in late 2002 announced the deployment of antimissile interceptors in Alaska and California. At the same time, Mr. Bush accelerated programs to get inside the long supply chain of parts for North Korean missiles, lacing them with defects and weaknesses, a technique also used for years against Iran.",
      "position": 20,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 221,
    "fields": {
      "content": "By the time Mr. Obama took office in January 2009, the North had deployed hundreds of short- and medium-range missiles that used Russian designs, and had made billions of dollars selling its Scud missiles to Egypt, Libya, Pakistan, Syria, the United Arab Emirates and Yemen. But it aspired to a new generation of missiles that could fire warheads over much longer distances.",
      "position": 21,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 222,
    "fields": {
      "content": "In secret cables written in the first year of the Obama administration, Secretary of State Hillary Clinton laid out the emerging threat. Among the most alarming released by WikiLeaks, the cables described a new path the North was taking to reach its long-range goal, based on a missile designed by the Soviets decades ago for their submarines that carried thermonuclear warheads.",
      "position": 22,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 223,
    "fields": {
      "content": "It was called the R-27. Unlike the North's lumbering, older rockets and missiles, these would be small enough to hide in caves and move into position by truck. The advantage was clear: This missile would be far harder for the United States to find and destroy.",
      "position": 23,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 224,
    "fields": {
      "content": "\"North Korea's next goal may be to develop a mobile ICBM that would be capable of threatening targets around the world,\" said an October 2009 cable marked \"Secret\" and signed by Mrs. Clinton.",
      "position": 24,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 225,
    "fields": {
      "content": "The next year, one of the new missiles showed up in a North Korean military parade, just as the intelligence reports had warned.",
      "position": 25,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 226,
    "fields": {
      "content": "By 2013, North Korean rockets thundered with new regularity. And that February, the North set off a nuclear test that woke up Washington: The monitoring data told of an explosion roughly the size of the bomb that had leveled Hiroshima.",
      "position": 26,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 227,
    "fields": {
      "content": "Days after the explosion, the Pentagon announced an expansion of its force of antimissile interceptors in California and Alaska. It also began to unveil its \"left of launch\" program to disable missiles before liftoff - hoping to bolster its chances of destroying them. Gen. Martin E. Dempsey, the chairman of the Joint Chiefs of Staff, announced the program, saying that \"cyberwarfare, directed energy and electronic attack,\" a reference to such things as malware, lasers and signal jamming, were all becoming important new adjuncts to the traditional ways of deflecting enemy strikes.",
      "position": 27,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 228,
    "fields": {
      "content": "He never mentioned North Korea. But a map accompanying General Dempsey's policy paper on the subject showed one of the North's missiles streaking toward the United States. Soon, in testimony before Congress and at public panels in Washington, current and former officials and a major contractor - Raytheon - began talking openly about \"left of launch\" technologies, in particular cyber and electronic strikes at the moment of launch.",
      "position": 28,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 229,
    "fields": {
      "content": "The North, meanwhile, was developing its own exotic arsenal. It tried repeatedly to disrupt American and South Korean military exercises by jamming electronic signals for guided weapons, including missiles. And it demonstrated its cyberpower in the oddest of places - Hollywood. In 2014, it attacked Sony Pictures Entertainment with a strike that destroyed about 70 percent of the company's computing systems, surprising experts with its technical savvy.",
      "position": 29,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 230,
    "fields": {
      "content": "Last month, a report on cybervulnerabilities by the Defense Science Board, commissioned by the Pentagon during the Obama administration, warned that North Korea might acquire the ability to cripple the American power grid, and cautioned that it could never be allowed to \"hold vital U.S. strike systems at risk.\"",
      "position": 30,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 231,
    "fields": {
      "content": "Not long after General Dempsey made his public announcement, Mr. Obama and his defense secretary, Ashton B. Carter, began calling meetings focused on one question: Could a crash program slow the North's march toward an intercontinental ballistic missile?",
      "position": 31,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 232,
    "fields": {
      "content": "There were many options, some drawn from General Dempsey's list. Mr. Obama ultimately pressed the Pentagon and intelligence agencies to pull out all the stops, which officials took as encouragement to reach for untested technologies.",
      "position": 32,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 233,
    "fields": {
      "content": "The North's missiles soon began to fail at a remarkable pace. Some were destroyed, no doubt, by accident as well as by design. The technology the North was pursuing, using new designs and new engines, involved multistage rockets, introducing all kinds of possibilities for catastrophic mistakes. But by most accounts, the United States program accentuated the failures.",
      "position": 33,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 234,
    "fields": {
      "content": "The evidence was in the numbers. Most flight tests of an intermediate-range missile called the Musudan, the weapon that the North Koreans showed off in public just after Mrs. Clinton's warning, ended in flames: Its overall failure rate is 88 percent.",
      "position": 34,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 235,
    "fields": {
      "content": "Nonetheless Kim Jong-un has pressed ahead on his main goal: an intercontinental ballistic missile. Last April, he was photographed standing next to a giant test-stand, celebrating after engineers successfully fired off a matched pair of the potent Russian-designed R-27 engines. The implication was clear: Strapping two of the engines together at the base of a missile was the secret to building an ICBM that could ultimately hurl warheads at the United States.",
      "position": 35,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 236,
    "fields": {
      "content": "In September, he celebrated the most successful test yet of a North Korean nuclear weapon - one that exploded with more than twice the destructive force of the Hiroshima bomb.",
      "position": 36,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 237,
    "fields": {
      "content": "His next goal, experts say, is to combine those two technologies, shrinking his nuclear warheads to a size that can fit on an intercontinental missile. Only then can he credibly claim that his isolated country has the know-how to hit an American city thousands of miles away.",
      "position": 37,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 238,
    "fields": {
      "content": "In the last year of his presidency, Mr. Obama often noted publicly that the North was learning from every nuclear and missile test - even the failures - and getting closer to its goal. In private, aides noticed he was increasingly disturbed by North Korea's progress.",
      "position": 38,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 239,
    "fields": {
      "content": "With only a few months left in office, he pushed aides for new approaches. At one meeting, he declared that he would have targeted the North Korean leadership and weapons sites if he thought it would work. But it was, as Mr. Obama and his assembled aides knew, an empty threat: Getting timely intelligence on the location of North Korea's leaders or their weapons at any moment would be almost impossible, and the risks of missing were tremendous, including renewed war on the Korean Peninsula.",
      "position": 39,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 240,
    "fields": {
      "content": "As a presidential candidate, Mr. Trump complained that \"we're so obsolete in cyber,\" a line that grated on officials at the United States Cyber Command and the National Security Agency, where billions of dollars have been spent to provide the president with new options for intelligence gathering and cyberattacks. Now, one of the immediate questions he faces is whether to accelerate or scale back those efforts.",
      "position": 40,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 241,
    "fields": {
      "content": "A decision to go after an adversary's launch ability can have unintended consequences, experts warn.",
      "position": 41,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 242,
    "fields": {
      "content": "Once the United States uses cyberweapons against nuclear launch systems - even in a threatening state like North Korea - Russia and China may feel free to do the same, targeting fields of American missiles. Some strategists argue that all nuclear systems should be off limits for cyberattack. Otherwise, if a nuclear power thought it could secretly disable an adversary's atomic controls, it might be more tempted to take the risk of launching a pre-emptive attack.",
      "position": 42,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 243,
    "fields": {
      "content": "\"I understand the urgent threat,\" said Amy Zegart, a Stanford University intelligence and cybersecurity expert, who said she had no independent knowledge of the American effort. \"But 30 years from now we may decide it was a very, very dangerous thing to do.\"",
      "position": 43,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 244,
    "fields": {
      "content": "Mr. Trump's aides say everything is on the table. China recently cut off coal imports from the North, but the United States is also looking at ways to freeze the Kim family's assets, some of which are believed held in Chinese-controlled banks. The Chinese have already opposed the deployment of a high-altitude missile defense system known as Thaad in South Korea; the Trump team may call for even more such systems.",
      "position": 44,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 245,
    "fields": {
      "content": "The White House is also looking at pre-emptive military strike options, a senior Trump administration official said, though the challenge is huge given the country's mountainous terrain and deep tunnels and bunkers. Putting American tactical nuclear weapons back in South Korea - they were withdrawn a quarter-century ago - is also under consideration, even if that step could accelerate an arms race with the North.",
      "position": 45,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 246,
    "fields": {
      "content": "Mr. Trump's \"It won't happen!\" post on Twitter about the North's ICBM threat suggests a larger confrontation could be looming.",
      "position": 46,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 247,
    "fields": {
      "content": "\"Regardless of Trump's actual intentions,\" James M. Acton, a nuclear analyst at the Carnegie Endowment for International Peace, recently noted, \"the tweet could come to be seen as a ‘red line' and hence set up a potential test of his credibility.\"",
      "position": 47,
      "article": 2,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 301,
    "fields": {
      "content": "WASHINGTON - House Republican leaders, facing a revolt among conservatives and moderates in their ranks, pulled legislation to repeal the Affordable Care Act from consideration on the House floor Friday in a major defeat for President Trump on the first legislative showdown of his presidency.",
      "position": 1,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 302,
    "fields": {
      "content": "\"We're going to be living with Obamacare for the foreseeable future,\" the House speaker, Paul D. Ryan, conceded.",
      "position": 2,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 303,
    "fields": {
      "content": "The failure of the Republicans' three-month blitz to repeal President Barack Obama's signature domestic achievement exposed deep divisions in the Republican Party that the election of a Republican president could not mask. It cast a long shadow over the ambitious agenda that Mr. Trump and Republican leaders had promised to enact once their party assumed power at both ends of Pennsylvania Avenue.",
      "position": 3,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 304,
    "fields": {
      "content": "And it was the biggest defeat of Mr. Trump's young presidency, which has suffered many. His travel ban has been blocked by the courts. Allegations of questionable ties to the Russian government forced out his national security adviser, Michael T. Flynn. Tensions with key allies such as Germany, Britain and Australia are high, and Mr. Trump's approval ratings are at historic lows.",
      "position": 4,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 305,
    "fields": {
      "content": "Republican leaders were willing to tolerate Mr. Trump's foibles with the promise that he would sign into law their conservative agenda. The collective defeat of the health care effort could strain that tolerance.",
      "position": 5,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 306,
    "fields": {
      "content": "Mr. Trump, in a telephone interview moments after the bill was pulled, tried to put the most flattering light on it. \"The best thing that could happen is exactly what happened - watch,\" he said.",
      "position": 6,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 307,
    "fields": {
      "content": "\"Obamacare unfortunately will explode,\" Mr. Trump said later. \"It's going to have a very bad year.\" At some point, he said, after another round of big premium increases, \"Democrats will come to us and say, ‘Look, let's get together and get a great health care bill or plan that's really great for the people of our country.'\"",
      "position": 7,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 308,
    "fields": {
      "content": "Mr. Trump expressed weariness with the effort, though its failure took a fraction of the time that Democrats devoted to enacting the Affordable Care Act in 2009 and 2010. \"It's enough already,\" the president said.",
      "position": 8,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 309,
    "fields": {
      "content": "A major reason for the bill's demise was the opposition of members of the conservative House Freedom Caucus, which wanted more aggressive steps to lower insurance costs and to dismantle federal regulation of insurance products.",
      "position": 9,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 310,
    "fields": {
      "content": "In a day of high drama, Mr. Ryan rushed to the White House shortly after noon on Friday to tell Mr. Trump he did not have the votes for a repeal bill that had been promised for seven years - since Mr. Obama signed the landmark health care law. During a 3 p.m. phone call, the two men decided to withdraw the bill rather than watch its defeat on the House floor.",
      "position": 10,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 311,
    "fields": {
      "content": "Mr. Trump later told journalists in the Oval Office that Republicans were 10 to 15 votes short of what they needed to pass the repeal bill.",
      "position": 11,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 312,
    "fields": {
      "content": "The effort to win passage had been relentless, and hardly hidden. Vice President Mike Pence and Tom Price, the health secretary, visited Capitol Hill on Friday for a late appeal to House conservatives, but their pleas fell on deaf ears.",
      "position": 12,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 313,
    "fields": {
      "content": "\"You can't pretend and say this is a win for us,\" said Representative Mark Walker of North Carolina, the chairman of the conservative Republican Study Committee, who conceded it was a \"good moment\" for Democrats.",
      "position": 13,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 314,
    "fields": {
      "content": "\"Probably that champagne that wasn't popped back in November may be utilized this evening,\" Mr. Walker said.",
      "position": 14,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 315,
    "fields": {
      "content": "At 3:30 p.m. on Friday, Mr. Ryan called Republicans into a closed-door meeting to deliver the news that the bill would be withdrawn, with no plans to try again. The meeting lasted five minutes. One of the architects of the House bill, Representative Greg Walden, Republican of Oregon and the chairman of the Energy and Commerce Committee, put it bluntly: \"This bill's done.\"",
      "position": 15,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 316,
    "fields": {
      "content": "\"We are going to focus on other issues at this point,\" he said.",
      "position": 16,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 317,
    "fields": {
      "content": "The Republican bill would have repealed tax penalties for people without health insurance, rolled back federal insurance standards, reduced subsidies for the purchase of private insurance and set new limits on spending for Medicaid, the federal-state program that covers more than 70 million low-income people. The bill would have repealed hundreds of billions of dollars in taxes imposed by the Affordable Care Act and would also have cut off federal funds to Planned Parenthood for one year.",
      "position": 17,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 318,
    "fields": {
      "content": "Mr. Ryan had said the bill included \"huge conservative wins.\" But it never won over conservatives who wanted a more thorough eradication of the Affordable Care Act. Nor did it have the backing of more moderate Republicans who were anxiously aware of the Congressional Budget Office's assessment that the bill would leave 24 million more Americans without insurance in 2024, compared with the number who would be uninsured under the current law.",
      "position": 18,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 319,
    "fields": {
      "content": "The budget office also warned that in the short run, the Republicans' legislation would drive insurance premiums higher. For older Americans approaching retirement, the cost of insurance could have risen sharply.",
      "position": 19,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 320,
    "fields": {
      "content": "With the House's most hard-line conservatives holding fast against the bill, support for the legislation collapsed Friday after more and more Republicans came out in opposition. They included Representatives Rodney Frelinghuysen of New Jersey, the soft-spoken chairman of the House Appropriations Committee, and Barbara Comstock of Virginia, whose suburban Washington district went for the Democratic presidential nominee, Hillary Clinton, in November.",
      "position": 20,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 321,
    "fields": {
      "content": "\"Seven years after enactment of Obamacare, I wanted to support legislation that made positive changes to rescue health care in America,\" Mr. Frelinghuysen said. \"Unfortunately, the legislation before the House today is currently unacceptable as it would place significant new costs and barriers to care on my constituents in New Jersey.\"",
      "position": 21,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 322,
    "fields": {
      "content": "The bill died after Republican leaders, in a bid for conservative support, agreed to eliminate federal standards for the minimum benefits that must be provided by certain health insurance policies.",
      "position": 22,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 323,
    "fields": {
      "content": "\"It's so cartoonishly malicious that I can picture someone twirling their mustache as they drafted it in their secret Capitol lair last night,\" said Representative Jim McGovern, Democrat of Massachusetts. \"Republicans are killing the requirements that insurance plans cover essential health benefits\" such as emergency services, maternity care, mental health care, substance abuse treatment and prescription drugs.",
      "position": 23,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 324,
    "fields": {
      "content": "Mr. Trump blamed Democrats for the bill's defeat, and they proudly accepted responsibility.",
      "position": 24,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 325,
    "fields": {
      "content": "\"Let's just, for a moment, breathe a sigh of relief for the American people that the Affordable Care Act was not repealed,\" said Representative Nancy Pelosi of California, the House Democratic leader.",
      "position": 25,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 326,
    "fields": {
      "content": "Defeat of the bill could be a catalyst if it forces Republicans and Democrats to work together to improve the Affordable Care Act, which members of both parties say needs repair. Democrats have been saying for weeks that they want to work with Republicans on such changes, but first, they said, Republicans must abandon their drive to repeal the law.",
      "position": 26,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 327,
    "fields": {
      "content": "\"Obamacare is the law of the land,\" Mr. Ryan said. \"It's going to remain the law of the land until it's replaced.\"",
      "position": 27,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 328,
    "fields": {
      "content": "Whatever success Mr. Trump had in making business deals, he utterly failed in his first effort at cutting a deal at the pinnacle of power in Washington, Democrats said.",
      "position": 28,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 329,
    "fields": {
      "content": "\"This is not the art of the deal,\" said Representative Lloyd Doggett, Democrat of Texas, alluding to Mr. Trump's best-selling book. \"It is the art of the steal, of taking away insurance coverage from families that really need it to provide tax breaks for those at the very top.\"",
      "position": 29,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 330,
    "fields": {
      "content": "Rejection of the repeal bill may prompt Republicans to reconsider the political strategy they were planning to use for the next few years.",
      "position": 30,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 331,
    "fields": {
      "content": "\"We have to do some soul-searching internally to determine whether or not we are even capable of functioning as a governing body,\" said Representative Kevin Cramer, Republican of North Dakota. \"If ‘no' is your goal, it's the easiest goal in the world to reach.\"",
      "position": 31,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 332,
    "fields": {
      "content": "Representative Robert Pittenger, Republican of North Carolina, offered this advice to hard-line conservatives who helped sink the bill: \"Follow the example of Ronald Reagan. He was a master; he built consensus. He would say, ‘I'll take 80 percent and come back for the other 20 percent later.'\"",
      "position": 32,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 333,
    "fields": {
      "content": "Failure of the House effort leaves the Affordable Care Act in place, with all the features Republicans detest.",
      "position": 33,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 334,
    "fields": {
      "content": "\"We tried our hardest,\" said Representative Michael C. Burgess of Texas, chairman of the Energy and Commerce subcommittee on health. \"There were people who were not interested in solving the problem. They win today.\"",
      "position": 34,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 335,
    "fields": {
      "content": "\"The Freedom Caucus wins,\" he added. \"They get Obamacare forever.\"",
      "position": 35,
      "article": 3,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 401,
    "fields": {
      "content": "BENSALEM, Pa. - \"Do you want to see your tendons?\"",
      "position": 1,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 402,
    "fields": {
      "content": "Dr. Asif Ilyas, a hand and wrist surgeon, was about to close his patient's wound. But first he offered her the opportunity to behold the source of her radiating pain: a band of tendons that looked like pale pink ribbon candy. With a slender surgical instrument, he pushed outward to demonstrate their newly liberated flexibility.",
      "position": 2,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 403,
    "fields": {
      "content": "\"That's pretty neat,\" the patient, Esther Voynow, managed to gasp.",
      "position": 3,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 404,
    "fields": {
      "content": "The operation Dr. Ilyas performed, called a De Quervain's release, is usually done with the patient under anesthesia. But Ms. Voynow, her medical inquisitiveness piqued and her distaste for anesthesia pronounced, had chosen to remain awake throughout, her forearm rendered numb with only an injection of a local anesthetic.",
      "position": 4,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 405,
    "fields": {
      "content": "So she had been able to watch as Dr. Ilyas first sliced into her swollen right wrist, tugged gently at skin flaps, and then opened a small bloody crater, exposing the inflamed sheath that had trapped her tendons. Now she could see why her thumb and wrist had been relentlessly throbbing.",
      "position": 5,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 406,
    "fields": {
      "content": "As he scraped, Dr. Ilyas chatted with Ms. Voynow, trying to keep her calm. From a sound system, the Temptations crooned along, with \"The Way You Do the Things You Do.\"",
      "position": 6,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 407,
    "fields": {
      "content": "More surgery is being performed with the patient awake and looking on, for both financial and medical reasons. But as surgical patients are electing to keep their eyes wide open, doctor-patient protocol has not kept pace with the new practice. Patients can become unnerved by a seemingly ominous silence, or put off by what passes for office humor. Doctors are only beginning to realize that when a patient is alert, it is just not O.K. to say: \"Oops!\" or \"I wasn't expecting that,\" or even \"Oh, my God, what are you doing?!\"",
      "position": 7,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 408,
    "fields": {
      "content": "In a continuing study of negative experiences during awake procedures, a patient informed University of Chicago researchers, \"The surgeon told me he was going to get a sharper knife, and started laughing.\"",
      "position": 8,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 409,
    "fields": {
      "content": "As a heads-up to staff members, some hospitals now post warning signs on the O.R. door: PATIENT AWAKE.",
      "position": 9,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 410,
    "fields": {
      "content": "\"For a thousand years, we talked about the operating theater,\" said Dr. Mark Siegler, a medical ethicist at the University of Chicago and an author of a recent  study on surgeon-patient communication during awake procedures, published in the American Journal of Surgery. \"And for the first time, in recent years the patient has joined the cast.\"",
      "position": 10,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 411,
    "fields": {
      "content": "Choosing to watch your own surgery is one more manifestation of the patient autonomy movement, in which patients, pushing back against physician paternalism, are eager to involve themselves more deeply in their own medical treatment.",
      "position": 11,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 412,
    "fields": {
      "content": "But Dr. Alexander Langerman, the senior author of the communication study and a head and neck surgeon on the faculty of Vanderbilt University Medical Center in Nashville, said that a patient's decision to remain awake during an operation also reflects a growing suspicion, generally, of authority figures. Noting how pedestrians pull out smartphones to capture police activity, he said, \"There's an element in that for patients, too. The occasional scandals that emerge while patients are sedated continue to erode their trust in us.\"",
      "position": 12,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 413,
    "fields": {
      "content": "But patients are also intrigued by what is being done to them while they are asleep. In choosing to stay awake, added Dr. Langerman, \"there's a curiosity and desire to have control over your experience.\"",
      "position": 13,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 414,
    "fields": {
      "content": "Indeed, a few studies suggest that some patients feel less anxious about staying awake during surgery, despite possible gruesome sights, than they do about being sedated. Other patients, studies show, are very anxious about general anesthesia, particularly right before an operation, afraid they will not be able to wake up afterward.",
      "position": 14,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 415,
    "fields": {
      "content": "Some operations, including deep brain stimulations, require the patient to be awake for critical communication. But as anesthesia alternatives like regional nerve blocks and site injections become increasingly sophisticated, many more procedures are possible with the patient fully alert or moderately sedated. Orthopedics is the chief specialty for such procedures, but surgery in breast, colorectal, thoracic, vascular, otolaryngological, urological, ophthalmological and cosmetic specialties is also moving in this direction.",
      "position": 15,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 416,
    "fields": {
      "content": "Studies show that regional anesthesia has fewer complications than general anesthesia and is less expensive. Recovery time is swifter and side effects are fewer, which can reduce the need for postoperative opioids.",
      "position": 16,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 417,
    "fields": {
      "content": "Proponents like Dr. Ilyas, who operates at the Rothman Orthopaedic Specialty Hospital in Bensalem, praise awake surgery as a step forward in transparency. \"It's all about communication, comfort and experience,\" he said. \"It is definitely catching on and creating a different kind of surgeon-patient relationship.\"",
      "position": 17,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 418,
    "fields": {
      "content": "But many doctors view awake surgery with apprehension. What happens if the patient becomes too anxious? Distracts the surgeon with too many questions? Or objects vigorously when a trainee scrubs in - a mainstay of surgical education?",
      "position": 18,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 419,
    "fields": {
      "content": "Dr. Langerman said that many surgeons do not like being observed for other reasons, too. \"They often have a fear of litigation, or a fear of disappointing the patient.\"",
      "position": 19,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 420,
    "fields": {
      "content": "Patient satisfaction, however, tends to be high. Ms. Voynow did not need a preoperative physical exam, blood work, an I.V. drip or even an attending anesthesiologist. As nurses wheeled her on a gurney out of the O.R., she looked pleasantly surprised. \"I've had root canals that were worse,\" she said.",
      "position": 20,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 421,
    "fields": {
      "content": "Scarcely a half-hour after the surgery, she drove herself home, using her right hand, which had just been operated on. By contrast, if she had been given general anesthesia, she would most likely have needed several hours to recover, possibly had side effects like dizziness and nausea, and required someone to drive her. An anesthesiologist would have been necessary throughout the operation. And billed accordingly.",
      "position": 21,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 422,
    "fields": {
      "content": "\"If I want sedation, I'll have a beer,\" said David S. Howes, who has had several awake procedures (and who is himself a doctor, an emergency physician in Chicago). During his awake colonoscopy, he discussed fly-fishing with the gastroenterologist. He had two total knee replacements with only regional nerve blocks.",
      "position": 22,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 423,
    "fields": {
      "content": "\"It's not for the faint of heart,\" he said. \"They have to cut the capsule of the knee, which is quite thick. I could feel the vibration of the saw cutting through the leg bones. Then they hammer, and it sends a shock wave slamming into your knee. It doesn't hurt, but you feel the pressure. And you smell burning flesh.\"",
      "position": 23,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 424,
    "fields": {
      "content": "Knowing that the knee replacement would take several hours, Dr. Howes came prepared. While surgeons put in the new joint, he read The Economist.",
      "position": 24,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 425,
    "fields": {
      "content": "(Related: a reporter watches her own knee surgery.)",
      "position": 25,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 426,
    "fields": {
      "content": "The increasing number of patients who choose to be at least minimally awake is also a reflection of the continuing demystification of surgery, Dr. Langerman said. Some doctors post surgical videos on YouTube, and live procedures on Snapchat. And with patients having been exposed to graphic surgery on reality television shows and nighttime medical dramas, he said, \"They are primed to think they're ready to watch this.\"",
      "position": 26,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 427,
    "fields": {
      "content": "But patients can find the experience a letdown. \"It's not as orchestrated and symphonic as on TV,\" he said. \"It's people at work, doing their job.\"",
      "position": 27,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 428,
    "fields": {
      "content": "Whether the patient is offered the option of staying awake depends on many factors: the amenability of the surgery, the willingness of the surgeon, the flexibility of the anesthesiologist and the ability of a busy hospital to customize procedures. Although typically patients meet and make decisions with an anesthesiologist moments before an operation, Dr. David M. Dickerson, an assistant professor of anesthesia at the University of Chicago, confers with patients earlier, at a surgical clinic intended to coordinate and personalize medical care.",
      "position": 28,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 429,
    "fields": {
      "content": "Patients are evaluated for their likelihood to succumb to stress while awake; they learn about sedation alternatives if, midsurgery, they become overwhelmed. While a satisfying personal experience would be ideal, the patient is told, the most important driver is safety, including the ability of the surgeon to focus and communicate with other medical staff members without interruption.",
      "position": 29,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 430,
    "fields": {
      "content": "So managing the patient during surgery often falls to the anesthesiologist. During a three-hour knee surgery, an awake patient may become bored and tired of being in the same position: \"So you might have to make small talk throughout the entire case,\" said Dr. Dickerson. \"They don't teach that in medical school.\"",
      "position": 30,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 431,
    "fields": {
      "content": "Patients sometimes overestimate their ability to handle the unfamiliar stimuli of the operating room, said Dr. Stavros G. Memtsoudis, a researcher and professor of anesthesiology at Weill Cornell Medical College.",
      "position": 31,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 432,
    "fields": {
      "content": "\"The patient will keep asking, ‘What is my heart doing? Is that beep normal? Is this normal?' I might say, ‘If you'd rather go to sleep you can, because I can see your blood pressure is going up because you're so stressed and you'll bleed more,'\" said Dr. Memtsoudis, who is also an anesthesiologist at Hospital for Special Surgery, an orthopedic center in New York where regional anesthesia is common. He also keeps on hand headphones, music selections and video glasses to soothe anxious awake patients.",
      "position": 32,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 433,
    "fields": {
      "content": "And when it is the assistant's turn to try a technique, Dr. Michael L. Marin, a professor and chairman of the surgery department at Mount Sinai Medical Center, is particularly judicious. Rather than risk unsettling the patient with what might be a typical instruction to a resident - \"See if you can find your way through it\" - Dr. Marin may be more circumspect: \"We need to adjust this piece over here.\"",
      "position": 33,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 434,
    "fields": {
      "content": "Throughout, he is both trying to assure the awake patient, and educate residents and fellows about the importance of doing so. \"You have to recognize that the patient may be listening intently and they're nervous,\" said Dr. Marin, who specializes in aortic aneurysm repair. \"Sometimes I'll go overboard and say, ‘That's perfect!' or ‘It came together exactly the way we wanted!'",
      "position": 34,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 435,
    "fields": {
      "content": "\"That makes patients feel much better,\" he said. \"They want to know you are confident, focused and in control. They are not really interested in hearing doctors joke about the drinking they did last night.\"",
      "position": 35,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 436,
    "fields": {
      "content": "Dr. Ilyas, the hand surgeon, who is also an associate professor of orthopedic surgery at Thomas Jefferson University in Philadelphia, began routinely offering awake options to patients about four years ago. Among other advantages, he said, patients enjoy having a better understanding of their medical problem. And because they are awake and can follow direction, Dr. Ilyas can test their mobility right away to learn whether he needs to do further repair.",
      "position": 36,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 437,
    "fields": {
      "content": "\"You get more ownership and appreciation of the treatment from patients,\" he said.",
      "position": 37,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 438,
    "fields": {
      "content": "Now when he gives patients the choice to be awake or asleep, Dr. Ilyas said, about 80 percent are opting to be awake.",
      "position": 38,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 439,
    "fields": {
      "content": "But when Dr. Ilyas himself needs surgery, he is still rather old-fashioned.",
      "position": 39,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 440,
    "fields": {
      "content": "\"I don't want to be awake and worrying about it,\" he said. \"When I had a vasectomy I had the awake option. But I said, ‘Nope! I'd rather be asleep. I'm good, thanks.'\"",
      "position": 40,
      "article": 4,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 501,
    "fields": {
      "content": "One of President Trump's rare strengths has been his ability to project competence. The Dow Jones stock index is up an astonishing 2,200 points since his election in part because investors believed Trump could deliver tax reform and infrastructure spending.",
      "position": 1,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 502,
    "fields": {
      "content": "Think again!",
      "position": 2,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 503,
    "fields": {
      "content": "The Trump administration is increasingly showing itself to be breathtakingly incompetent, and that's the real lesson of the collapse of the G.O.P. health care bill. The administration proved unable to organize its way out of a paper bag: After seven years of Republicans' publicly loathing Obamacare, their repeal-replace bill failed after 18 days.",
      "position": 3,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 504,
    "fields": {
      "content": "Politics sometimes rewards braggarts, and Trump is a world-class boaster. He promised a health care plan that would be \"unbelievable,\" \"beautiful,\" \"terrific,\" \"less expensive and much better,\" \"insurance for everybody.\" But he's abysmal at delivering - because the basic truth is that he's an effective politician who's utterly incompetent at governing.",
      "position": 4,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 505,
    "fields": {
      "content": "It's sometimes said that politicians campaign in poetry and govern in prose. Trump campaigns in braggadocio and governs in bombast.",
      "position": 5,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 506,
    "fields": {
      "content": "Whatever one thinks of Trump's merits, this competence gap raises profound questions about our national direction. If the administration can't repeal Obamacare - or manage friendly relations with allies like Mexico or Australia - how will it possibly accomplish something complicated like tax reform?",
      "position": 6,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 507,
    "fields": {
      "content": "Failure and weakness also build on themselves, and the health care debacle will make it more difficult for Trump to get his way with Congress on other issues. As people recognize that the emperor is wearing no clothes, that perception of weakness will spiral.",
      "position": 7,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 508,
    "fields": {
      "content": "One of the underlying problems is Trump's penchant for personnel choices that are bafflingly bad or ethically challenged or both. Mike Flynn was perhaps the best-known example.",
      "position": 8,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 509,
    "fields": {
      "content": "But consider Sebastian Gorka, a counterterrorism adviser to the president. Gorka, who is of Hungarian origin, founded an extremist right-wing party in Hungary in 2007, and The Forward has published articles claiming that Gorka had ties to the anti-Semitic Hungarian right and is a sworn member of a Nazi-allied group in Hungary called Vitezi Rend.",
      "position": 9,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 510,
    "fields": {
      "content": "Members of the organization use a lowercase v as a middle initial, and The Forward noted that Gorka has presented his name as Sebastian L.v. Gorka.",
      "position": 10,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 511,
    "fields": {
      "content": "Gorka's background might have become a problem when he immigrated to the U.S., for the State Department manual says that Vitezi Rend members \"are presumed to be inadmissible.\" Karl Pfeifer, an Austrian journalist who has long specialized in Hungarian affairs, told me that Gorka unquestionably had worked with racists and anti-Semites in Hungary.",
      "position": 11,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 512,
    "fields": {
      "content": "Gorka and the White House did not respond to my inquiries. But Gorka told The Tablet website that he had never been a member of Vitezi Rend and used the v initial only to honor his father. He has robust defenders, who say he has never shown a hint of racism or anti-Semitism.",
      "position": 12,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 513,
    "fields": {
      "content": "As Ana Navarro, a G.O.P. strategist, tweeted: \"Donald Trump attracts some of the shadiest, darkest, weirdest people around him.\"",
      "position": 13,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 514,
    "fields": {
      "content": "In fairness, Trump has also appointed plenty of solid people: Jim Mattis, Elaine Chao, H. R. McMaster, Dina Powell, Gary Cohn, Steven Mnuchin and more. And Trump's Supreme Court nominee, Neil Gorsuch, is a first-rate lawyer.",
      "position": 14,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 515,
    "fields": {
      "content": "Yet Trump's record of appointments over all suggests a lack of interest in expertise. I'm not sure that this is \"the worst cabinet in American history,\" as a Washington Post opinion writer put it, but it might be a contender. The last two energy secretaries were renowned scientists, one with a Nobel prize, while Trump appointed Rick Perry - who once couldn't remember the department's name.",
      "position": 15,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 516,
    "fields": {
      "content": "Trump appointed his bankruptcy lawyer, David Friedman, to be ambassador to Israel. He chose Jason Greenblatt, another of his lawyers, to negotiate Mideast peace. He picked Omarosa Manigault, who starred with him on \"The Apprentice\" and has a record of inflating her résumé, to be assistant to the president.",
      "position": 16,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 517,
    "fields": {
      "content": "The director of Oval Office operations is Keith Schiller, a former Trump bodyguard best known for whacking a protester. And the Trump team installed as a minder in the Labor Department a former campaign worker who graduated from high school in 2015, according to ProPublica.",
      "position": 17,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 518,
    "fields": {
      "content": "So see the failure of the Republican health care bill through a larger prism: The measure collapsed not just because it was a dreadful bill (a tax cut for the wealthy financed by dropping health coverage for the needy). It also failed as a prime example of the Trump administration's competence gap.",
      "position": 18,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 519,
    "fields": {
      "content": "Democrats may feel reassured, because ineptitude may impede some of Trump's worst initiatives. But even if Trump is unable to build, he may be able to destroy: I fear that his health care \"plan\" now is to suffocate Obamacare by failing to enforce the insurance mandate, and then claim that its spasms are inevitable.",
      "position": 19,
      "article": 5,
      "style": "n"
    }
  },
  {
    "model": "api.Sentence",
    "pk": 520,
    "fields": {
      "content": "Of all the national politicians I've met over the decades, Trump may be the one least interested in government or policy; he's absorbed simply with himself. And what we're seeing more clearly now is that he has crafted an administration in his own image: vain, narcissistic and dangerous.",
      "position": 20,
      "article": 5,
      "style": "n"
    }
  }
]
